import styles from './ΠοσοστόΥλοποίησης.module.css';

import { προςΥλοποίηση } from '@/db/προςΥλοποίηση';

const ΠοσοστόΥλοποίησης = () => {
  const αριθμόςΚρίσιμων = προςΥλοποίηση.filter(
    (todo) => todo.κρίσιμο === true
  ).length;

  const αριθμόςΕνΑναμονήΚρίσιμων = προςΥλοποίηση.filter(
    (todo) => todo.κρίσιμο === true && todo.ενΕξελίξει === false
  ).length;

  const αριθμόςΕνΕξελίξειΚρίσιμων = προςΥλοποίηση.filter(
    (todo) =>
      todo.κρίσιμο === true &&
      todo.ενΕξελίξει === true &&
      todo.ολοκλήρωση === false
  ).length;

  const αριθμόςΟλοκληρωμένωνΚρίσιμων = προςΥλοποίηση.filter(
    (todo) => todo.κρίσιμο === true && todo.ολοκλήρωση === true
  ).length;

  const ποσοστόΥλοποίησηςΚρίσιμων = parseFloat(
    ((αριθμόςΟλοκληρωμένωνΚρίσιμων + αριθμόςΕνΕξελίξειΚρίσιμων / 2) /
      αριθμόςΚρίσιμων) *
      100
  ).toFixed(0);

  const αριθμόςΕνΕξελίξει = προςΥλοποίηση.filter(
    (todo) => todo.ενΕξελίξει === true && todo.ολοκλήρωση === false
  ).length;

  const αριθμόςΟλοκληρωμένων = προςΥλοποίηση.filter(
    (todo) => todo.ολοκλήρωση === true
  ).length;

  const ποσοστόΣυνολικήςΥλοποίησης = parseFloat(
    (αριθμόςΟλοκληρωμένων / προςΥλοποίηση.length) * 100
  ).toFixed(0);

  const ένδειξηΥλοποίησης =
    ποσοστόΥλοποίησηςΚρίσιμων !== '100'
      ? `${ποσοστόΥλοποίησηςΚρίσιμων}%`
      : ποσοστόΥλοποίησηςΚρίσιμων === '100' &&
          ποσοστόΣυνολικήςΥλοποίησης !== '100'
        ? '99%'
        : '100%';

  return <div className={styles.ποσοστό}>{ένδειξηΥλοποίησης}</div>;
};

export default ΠοσοστόΥλοποίησης;
