import styles from './page.module.css';

import Τίτλος from '@/components/Τίτλος';
import ΣτοιχείαΧρονολογίου from '@/components/Χρονολόγιο/ΣτοιχείαΧρονολογίου';
import ΠλαϊνήΣτήληΧρονολογίουΠρογραμματισμού from '@/components/Navigations/ΠλαϊνήΣτήληΧρονολογίουΠρογραμματισμού';
import ΠλαίσιοΜορφής from '@/components/ΠλαίσιοΜορφής';
import ΚείμενοΤίτλοςΜικρήςΟθόνης from '@/components/Κείμενα/ΚείμενοΤίτλοςΜικρήςΟθόνης';
import ΠλήκτροΚειμένουΜικρήςΟθόνης from '@/components/Κουμπιά/ΠλήκτροΚειμένουΜικρήςΟθόνης';

export const metadata = {
  title: 'ΔΜ - Χρονολόγιο',
  description: 'Η πορεία μου ως προγραμματιστής',
  keywords: ['Χρονολόγιο', 'Timeline', 'Tidlinje'],
  creator: 'Δημήτρης Μανωλόπουλος',
  publisher: 'Δημήτρης Μανωλόπουλος',
};

const ΣελίδαΧρονολογίου = () => {
  return (
    <>
      <main className={styles.main}>
        <Τίτλος text="Χρονολόγιο" />
        <ΠλαϊνήΣτήληΧρονολογίουΠρογραμματισμού
          σελίδα="Χρονολόγιο"
          ύπαρξηΦίλτρων="υπαρκτά"
        />
        <section
          className={styles['τομέας-χρονολογίου']}
          id="τομέας-χρονολογίου"
        >
          <div className={styles['περιέκτης-χρονολογίου']}>
            <ΣτοιχείαΧρονολογίου />
          </div>
        </section>
        {/* <ΠλαίσιοΜορφής
          καθορισμόςΔιαστάσεων="από μέσα"
          ακτίναΓωνίας={15}
          πάχοςΟρίου={1}
          ενεργόςΔιακόπτηςΦέγγουςΟρίων
          ενεργόςΔιακόπτηςΦέγγουςΣτοιχείων
          pxΓιαΑπόκρυψη={1366}
        >
          <ΚείμενοΤίτλοςΜικρήςΟθόνης />
        </ΠλαίσιοΜορφής>
        <ΠλήκτροΚειμένουΜικρήςΟθόνης pxΓιαΑπόκρυψη={1366} /> */}
      </main>
    </>
  );
};

export default ΣελίδαΧρονολογίου;
