import styles from './page.module.css';

import Τίτλος from '@/components/Τίτλος';
import ΣτοιχείαΧρονολογίου from '@/components/Χρονολόγιο/ΣτοιχείαΧρονολογίου';
import ΠλαϊνήΣτήληΧρονολογίουΠρογραμματισμού from '@/components/Navigations/ΠλαϊνήΣτήληΧρονολογίουΠρογραμματισμού';
import ΠλήκτροΚειμένουΜικρήςΟθόνης from '@/components/Πλήκτρα/ΠλήκτροΚειμένουΜικρήςΟθόνης';
import ΚείμενοΤίτλοςΜικρήςΟθόνης from '@/components/ΚείμεναΣεΠλαίσιο/ΚείμενοΤίτλοςΜικρήςΟθόνης';

export const metadata = {
  title: 'ΔΜ - Χρονολόγιο',
  description: 'Η πορεία μου ως προγραμματιστής',
  keywords: ['Χρονολόγιο', 'Timeline', 'Tidlinje'],
  creator: 'Δημήτρης Μανωλόπουλος',
  publisher: 'Δημήτρης Μανωλόπουλος',
};

const ΣελίδαΧρονολογίου = () => {
  return (
    <>
      <main className={styles.main}>
        <Τίτλος text="Χρονολόγιο" />
        <ΠλαϊνήΣτήληΧρονολογίουΠρογραμματισμού
          σελίδα="Χρονολόγιο"
          ύπαρξηΦίλτρων="υπαρκτά"
        />
        <section
          className={styles['τομέας-χρονολογίου']}
          id="τομέας-χρονολογίου"
        >
          <div className={styles['περιέκτης-χρονολογίου']}>
            <ΣτοιχείαΧρονολογίου />
          </div>
        </section>
        <ΚείμενοΤίτλοςΜικρήςΟθόνης />
        <ΠλήκτροΚειμένουΜικρήςΟθόνης />
      </main>
    </>
  );
};

export default ΣελίδαΧρονολογίου;
