import styles from './page.module.css';

import Τίτλος from '@/components/Τίτλος';
import ΣτοιχείαΜαρτυριών from '@/components/Μαρτυρίες/ΣτοιχείαΜαρτυριών';

import ΠλαίσιοΜορφής from '@/components/ΠλαίσιοΜορφής';
import ΚείμενοΤίτλοςΜικρήςΟθόνης from '@/components/Κείμενα/ΚείμενοΤίτλοςΜικρήςΟθόνης';
import ΠλήκτροΚειμένουΜικρήςΟθόνης from '@/components/Κουμπιά/ΠλήκτροΚειμένουΜικρήςΟθόνης';

export const metadata = {
  title: 'ΔΜ - Μαρτυρίες',
  description: 'Μαρτυρίες πελατών και συνεργατών',
  keywords: ['Μαρτυρίες', 'Testimonials', 'Vittnesmål'],
  creator: 'Δημήτρης Μανωλόπουλος',
  publisher: 'Δημήτρης Μανωλόπουλος',
};

const ΣελίδαΜαρτυριών = () => {
  return (
    <main className={styles.main}>
      <Τίτλος text="Μαρτυρίες" />

      <section className={styles['τομέας-μαρτυριών']} id="τομέας-μαρτυριών">
        <div className={styles['περιέκτης-μαρτυριών']}>
          <ΣτοιχείαΜαρτυριών />
        </div>
      </section>
      {/* <ΠλαίσιοΜορφής
        καθορισμόςΔιαστάσεων="από μέσα"
        ακτίναΓωνίας={15}
        πάχοςΟρίου={1}
        ενεργόςΔιακόπτηςΦέγγουςΟρίων
        ενεργόςΔιακόπτηςΦέγγουςΣτοιχείων
        pxΓιαΑπόκρυψη={1024}
      >
        <ΚείμενοΤίτλοςΜικρήςΟθόνης />
      </ΠλαίσιοΜορφής>
      <ΠλήκτροΚειμένουΜικρήςΟθόνης pxΓιαΑπόκρυψη={1024} /> */}
    </main>
  );
};

export default ΣελίδαΜαρτυριών;
