import styles from './page.module.css';

import Τίτλος from '@/components/Τίτλος';
import Μαρτυρία from '@/components/Μαρτυρία';

import { μαρτυρίες } from '@/db/μαρτυρίες';
import ΠλαίσιοΜορφής from '@/components/ΠλαίσιοΜορφής';
import ΚείμενοΤίτλοςΜικρήςΟθόνης from '@/components/Κείμενα/ΚείμενοΤίτλοςΜικρήςΟθόνης';
import ΠλήκτροΚειμένουΜικρήςΟθόνης from '@/components/Κουμπιά/ΠλήκτροΚειμένουΜικρήςΟθόνης';

export const metadata = {
  title: 'ΔΜ - Μαρτυρίες',
  description: 'Μαρτυρίες πελατών και συνεργατών',
  keywords: ['Μαρτυρίες', 'Testimonials', 'Vittnesmål'],
  creator: 'Δημήτρης Μανωλόπουλος',
  publisher: 'Δημήτρης Μανωλόπουλος',
};

const ΣελίδαΜαρτυριών = () => {
  const αυθεντικέςΜαρτυρίες = μαρτυρίες.filter(
    (μαρτυρία) => μαρτυρία.αυθεντικότητα === 'Αληθινή'
  );
  const μηΑυθεντικέςΜαρτυρίες = μαρτυρίες.filter(
    (μαρτυρία) => μαρτυρία.αυθεντικότητα === 'Ψεύτικη'
  );

  const αριθμόςΑυθεντικώνΜαρτυριών = αυθεντικέςΜαρτυρίες.length;

  const μαρτυρίεςΠροςΕμφάνιση =
    αριθμόςΑυθεντικώνΜαρτυριών >= 4
      ? αυθεντικέςΜαρτυρίες
      : αυθεντικέςΜαρτυρίες.concat(μηΑυθεντικέςΜαρτυρίες);

  return (
    <main className={styles.main}>
      <Τίτλος text="Μαρτυρίες" />

      <section className={styles['τομέας-μαρτυριών']} id="τομέας-μαρτυριών">
        <div className={styles['περιέκτης-μαρτυριών']}>
          {/* <div className={styles.wrapper}> */}
          {μαρτυρίεςΠροςΕμφάνιση.map((μαρτυρία) => (
            <Μαρτυρία
              key={μαρτυρία.id}
              id={μαρτυρία.id}
              όνομα={μαρτυρία.όνομα}
              βαθμολογία={μαρτυρία.βαθμολογία}
              κείμενο={μαρτυρία.κείμενο}
              διεύθυνσηΕικόνας={μαρτυρία.διεύθυνσηΕικόνας}
              κείμενοΕικόνας={μαρτυρία.κείμενοΕικόνας}
              αυθεντικότητα={μαρτυρία.αυθεντικότητα}
            />
          ))}
          {/* </div> */}
        </div>
      </section>
      <ΠλαίσιοΜορφής
        καθορισμόςΔιαστάσεων="από μέσα"
        ακτίναΓωνίας={15}
        πάχοςΟρίου={1}
        ενεργόςΔιακόπτηςΦέγγουςΟρίων
        ενεργόςΔιακόπτηςΦέγγουςΣτοιχείων
      >
        <ΚείμενοΤίτλοςΜικρήςΟθόνης pxΓιαΑπόκρυψη={1024} />
      </ΠλαίσιοΜορφής>
      <ΠλήκτροΚειμένουΜικρήςΟθόνης pxΓιαΑπόκρυψη={1024} />
    </main>
  );
};

export default ΣελίδαΜαρτυριών;
