import styles from './ProgrammingTimelineSideNav.module.css';

import ΠερίβλημαΠλήκτροΕπιμονήςΧρωμάτωνΓεγονότος from '@/components/Πλήκτρα/ToggleButtons/ΠερίβλημαΠλήκτροΕπιμονήςΧρωμάτωνΓεγονότος';
import ΣτοιχείοΠλαϊνήςΣτήλης from '@/components/Πλήκτρα/ΣτοιχείοΠλαϊνήςΣτήλης';
import ΠλαίσιοΜορφής from '@/components/ΠλαίσιοΜορφής';

const ProgrammingTimelineSideNav = ({ σελίδα, ύπαρξηΦίλτρων }) => {
  return (
    <nav className={styles['πλαϊνή-στήλη-πλοήγησης-χρονολογίου']}>
      <ΠερίβλημαΠλήκτροΕπιμονήςΧρωμάτωνΓεγονότος σελίδα={σελίδα}>
        <ΠλαίσιοΜορφής
          καθορισμόςΔιαστάσεων="από μέσα"
          ακτίναΓωνίας={15}
          πάχοςΟρίου={0}
          ενεργόςΔιακόπτηςΦέγγουςΟρίων={false}
          ενεργόςΔιακόπτηςΦέγγουςΣτοιχείων={false}
        >
          <ul className={styles['στοιχεία']}>
            <ΣτοιχείοΠλαϊνήςΣτήλης
              σελίδα={σελίδα}
              ύπαρξηΦίλτρων={ύπαρξηΦίλτρων}
              είδοςΚατηγορίας="Εν αναμονή"
            />

            <ΣτοιχείοΠλαϊνήςΣτήλης
              σελίδα={σελίδα}
              ύπαρξηΦίλτρων={ύπαρξηΦίλτρων}
              είδοςΚατηγορίας="Εν εξελίξει"
            />

            {σελίδα === 'Χρονολόγιο' && (
              <>
                <ΣτοιχείοΠλαϊνήςΣτήλης
                  σελίδα={σελίδα}
                  ύπαρξηΦίλτρων={ύπαρξηΦίλτρων}
                  είδοςΚατηγορίας="Ολοκληρωμένο"
                />

                <ΣτοιχείοΠλαϊνήςΣτήλης
                  σελίδα={σελίδα}
                  ύπαρξηΦίλτρων={ύπαρξηΦίλτρων}
                  είδοςΚατηγορίας="Παρατημένο"
                />

                <ΣτοιχείοΠλαϊνήςΣτήλης
                  σελίδα={σελίδα}
                  ύπαρξηΦίλτρων={ύπαρξηΦίλτρων}
                  είδοςΚατηγορίας="Σπουδές"
                />

                <ΣτοιχείοΠλαϊνήςΣτήλης
                  σελίδα={σελίδα}
                  ύπαρξηΦίλτρων={ύπαρξηΦίλτρων}
                  είδοςΚατηγορίας="Εργασία"
                />

                <ΣτοιχείοΠλαϊνήςΣτήλης
                  σελίδα={σελίδα}
                  ύπαρξηΦίλτρων={ύπαρξηΦίλτρων}
                  είδοςΚατηγορίας="Έργα"
                />
              </>
            )}
          </ul>
        </ΠλαίσιοΜορφής>
      </ΠερίβλημαΠλήκτροΕπιμονήςΧρωμάτωνΓεγονότος>
    </nav>
  );
};
export default ProgrammingTimelineSideNav;
