import styles from './ΓραμμήΠλήκτρωνΚειμένουΣελίδαςΣχετικά.module.css';

import ΚοινόΠλήκτρο from '@/components/Κουμπιά/ΚοινόΠλήκτρο';
import Μετάφραση from '@/components/Μετάφραση';

const ΓραμμήΠλήκτρωνΚειμένουΣελίδαςΣχετικά = () => {
  return (
    <div className={styles['περιέκτης-πλήκτρων']}>
      <ΚοινόΠλήκτρο
        είδος="σύνδεσμος"
        σύνδεσμος="/programming/timeline"
        style="δευτερεύον-πλήκτρο"
        κίνησηΑιώρησης="επιτόπια"
      >
        <Μετάφραση>στο Χρονολόγιο</Μετάφραση>
      </ΚοινόΠλήκτρο>
      <ΚοινόΠλήκτρο
        είδος="σύνδεσμος"
        σύνδεσμος="/programming/testimonials"
        style="δευτερεύον-πλήκτρο"
        κίνησηΑιώρησης="επιτόπια"
      >
        <Μετάφραση>στις Μαρτυρίες</Μετάφραση>
      </ΚοινόΠλήκτρο>
    </div>
  );
};

export default ΓραμμήΠλήκτρωνΚειμένουΣελίδαςΣχετικά;
