import styles from './ΓραμμήΠλήκτρωνΣελίδαςΣυχνώνΕρωτήσεων.module.css';

import ΚοινόΠλήκτρο from '@/components/Κουμπιά/ΚοινόΠλήκτρο';
import Μετάφραση from '@/components/Μετάφραση';

const ΓραμμήΠλήκτρωνΣελίδαςΣυχνώνΕρωτήσεων = () => {
  return (
    <div className={styles['περιέκτης-πλήκτρων']}>
      <ΚοινόΠλήκτρο
        είδος="σύνδεσμος"
        σύνδεσμος="/programming/contact"
        style="βασικό-πλήκτρο"
        κίνησηΑιώρησης="επιτόπια"
      >
        <Μετάφραση>Έχω ερώτηση</Μετάφραση>
      </ΚοινόΠλήκτρο>
    </div>
  );
};

export default ΓραμμήΠλήκτρωνΣελίδαςΣυχνώνΕρωτήσεων;
