import styles from './ΓραμμήΠλήκτρωνΗρώου.module.css';

import ΚοινόΠλήκτρο from '@/components/Κουμπιά/ΚοινόΠλήκτρο';
import Μετάφραση from '@/components/Μετάφραση';

const ΓραμμήΠλήκτρωνΗρώου = () => {
  return (
    <div className={styles['περιέκτης-πλήκτρων-ηρώου']}>
      <ΚοινόΠλήκτρο
        Θέση="ηρώο-αριστερά"
        είδος="σύνδεσμος"
        σύνδεσμος="/programming/contact"
        style="βασικό-πλήκτρο"
        κίνησηΑιώρησης="επιτόπια"
      >
        <Μετάφραση>Ας μιλήσουμε</Μετάφραση>
      </ΚοινόΠλήκτρο>
      <ΚοινόΠλήκτρο
        Θέση="ηρώο-δεξιά"
        είδος="σύνδεσμος"
        σύνδεσμος="/programming/about/me"
        style="δευτερεύον-πλήκτρο"
        κίνησηΑιώρησης="επιτόπια"
      >
        <Μετάφραση>Δείξε μου περισσότερα</Μετάφραση>
      </ΚοινόΠλήκτρο>
    </div>
  );
};

export default ΓραμμήΠλήκτρωνΗρώου;
