import styles from './ΓραμμήΠλήκτρωνΣελίδαςΣχετικά.module.css';

import ΚοινόΠλήκτρο from '@/components/Κουμπιά/ΚοινόΠλήκτρο';
import Μετάφραση from '@/components/Μετάφραση';

const ΓραμμήΠλήκτρωνΣελίδαςΣχετικά = () => {
  return (
    <div className={styles['περιέκτης-πλήκτρων']}>
      <ΚοινόΠλήκτρο
        είδος="σύνδεσμος"
        σύνδεσμος="/programming/about/me"
        style="δευτερεύον-πλήκτρο"
        κίνησηΑιώρησης="επιτόπια"
      >
        <Μετάφραση>με Εμένα</Μετάφραση>
      </ΚοινόΠλήκτρο>
      <ΚοινόΠλήκτρο
        είδος="σύνδεσμος"
        σύνδεσμος="/programming/about/site"
        style="δευτερεύον-πλήκτρο"
        κίνησηΑιώρησης="επιτόπια"
      >
        <Μετάφραση>με Ιστότοπο</Μετάφραση>
      </ΚοινόΠλήκτρο>
    </div>
  );
};

export default ΓραμμήΠλήκτρωνΣελίδαςΣχετικά;
