import styles from './page.module.css';

import ΠλαίσιοΜορφής from '@/components/ΠλαίσιοΜορφής';
import ΚοινόΠλήκτρο from '@/components/Κουμπιά/ΚοινόΠλήκτρο';
import ΚείμενοΣυχνώνΕρωτήσεων from '@/components/Κείμενα/ΚείμενοΣυχνώνΕρωτήσεων';
import Μετάφραση from '@/components/Μετάφραση';

import { συχνέςΕρωτήσεις } from '@/db/συχνέςΕρωτήσεις';

export const metadata = {
  title: 'ΔΜ - Συχνές Ερωτήσεις',
  description: 'Συχνές ερωτήσεις επισκεπτών',
  keywords: ['Συχνές Ερωτήσεις', 'FAQ', 'Vanliga Frågor'],
  creator: 'Δημήτρης Μανωλόπουλος',
  publisher: 'Δημήτρης Μανωλόπουλος',
};

const ΣελίδαΣυχνώνΕρωτήσεων = () => {
  return (
    <section
      className={styles['τομέας-συχνές-ερωτήσεις']}
      id="τομέας-συχνές-ερωτήσεις"
    >
      <ΠλαίσιοΜορφής
        καθορισμόςΔιαστάσεων="από μέσα"
        ακτίναΓωνίας={15}
        πάχοςΟρίου={2}
        ενεργόςΔιακόπτηςΦέγγουςΟρίων
        ενεργόςΔιακόπτηςΦέγγουςΣτοιχείων
        // pxΠλάτουςΓιαΑπόκρυψη={5000}
      >
        <ΚείμενοΣυχνώνΕρωτήσεων />
      </ΠλαίσιοΜορφής>
      <ΚοινόΠλήκτρο
        είδος="σύνδεσμος"
        σύνδεσμος="/programming/contact"
        style="βασικό-πλήκτρο"
        κίνησηΑιώρησης="επιτόπια"
      >
        <Μετάφραση>
          {συχνέςΕρωτήσεις.length === 0 ? 'Έχω ερώτηση' : 'Έχω άλλη ερώτηση'}
        </Μετάφραση>
      </ΚοινόΠλήκτρο>
    </section>
  );
};

export default ΣελίδαΣυχνώνΕρωτήσεων;
