import styles from './Κεφαλίδα.module.css';

import LanguagesDropdown from '../LanguagesDropdown';
// import Λογότυπο from '@/components/Λογότυπο';
import Link from 'next/link';
import ΠλήκτροΡυθμίσεων from '@/components/Πλήκτρα/ΠλήκτροΡυθμίσεων';

const Κεφαλίδα = () => {
  return (
    <header className={styles.κεφαλίδα}>
      <div className={styles['περιέκτης-λογότυπου-κεφαλίδας-προγραμματισμού']}>
        <Link href="/" className={styles.λογότυπο}>
          <svg
            xmlns="http://www.w3.org/2000/svg"
            width={28.41}
            height={25}
            data-name="Υπόβαθρο Λογότυπου"
          >
            <title>{'Λογότυπο'}</title>
            <path
              d="M28.29.36c-.09 0-2.1 1.96-4.5 4.35L20 8.5c-.32.32-.85.32-1.17 0l-3.97-3.97-4.3-4.29A.825.825 0 0 0 9.98 0H5.21c-.72 0-1.1.86-.6 1.39.03.04.06.07.1.1.01 0 .02.02.03.03.01.01.02.03.04.04l.09.09c.02.02.04.03.06.05.01.01.02.03.03.04 0 .01.02.02.03.03l.03.03c.01.01.03.03.03.04.05.05.09.1.14.15.03.03.06.06.08.09l.05.05c.02.02.03.04.05.06.04.05.09.1.14.15l.04.04s.05.05.07.08.03.03.04.04l.04.04c.01.01.02.02.03.04.08.08.15.16.23.25h.01l.02.02c.3.31.62.66.97 1.03l.02.02c1.2 1.28 2.7 2.87 4.44 4.72l7.42 7.42c.32.32.85.32 1.17 0l1.09-1.09c.92-.9 1.73-1.65 1.8-1.65.05 0 .14 2.61.16 5.79l.05 5.01c0 .45.36.81.81.82l1.86.04 1.8.04c.46 0 .84-.36.84-.83V12.68c0-6.78-.05-12.32-.13-12.32z"
              className={styles.εικόνα}
              data-name="svg 1"
            />
            <path
              d="m13.67 22.39-2.37 2.37c-.15.15-.37.24-.58.24H.83c-.46 0-.83-.37-.83-.83v-2.86l.03-1.69c.73 0 1.47-.01 2.2-.02h3.02c1.65 0 3.02-.05 3.02-.14 0-.07-1.85-2-4.14-4.26L.24 11.3a.825.825 0 0 1-.24-.58V7.54c0-1.95.05-3.58.13-3.66.07-.07 3.74 3.49 8.15 7.9l7.42 7.42c.32.32.32.85 0 1.17l-2.02 2.02h-.01z"
              className={styles.εικόνα}
              data-name="svg 2"
            />
          </svg>
        </Link>
      </div>
      <div className={styles['περιέκτης-πλήκτρου-ρυθμίσεων-κεφαλίδας-προγραμματισμού']}>
        <ΠλήκτροΡυθμίσεων />
      </div>
      <nav className={styles['γραμμή-πλοήγησης-κεφαλίδας-προγραμματισμού']}>
        <ul className={styles['επιλογές-ρυθμίσεων-κεφαλίδας-προγραμματισμού']}>
          <LanguagesDropdown />
        </ul>
      </nav>
    </header>
  );
};
export default Κεφαλίδα;
