import styles from '@/components/TimelineItems.module.css';
import ΤίτλοςΓεγονότος from '@/components/Event/ΤίτλοςΓεγονότος';
import ΒασικάΣτοιχείαΓεγονότος from '@/components/Event/ΒασικάΣτοιχείαΓεγονότος';
import ΔιάρκειαΓεγονότος from '@/components/Event/ΔιάρκειαΓεγονότος';
import ΠλαϊνάΕικονίδια from '@/components/Event/ΠλαϊνάΕικονίδια';
import ΔευτερεύουσαΓραμμή from '@/components/Event/ΠληροφορίεςΔευτερεύουσαςΓραμμής';
import ΚείμενοΓεγονότος from '@/components/Event/ΚείμενοΓεγονότος';

const Event = ({
  ταυτότητα,
  μονός,
  μορφήΠεριβλήματος,
  μονόςΖυγόςΠάνωΓραμμή,
  χρώμαΕίδους,
  κείμενοΧρονολογίας,
  αριθμόςΗμερώνΕβδομάδωνΜηνώνΕτών,
  ημέρεςΕβδομάδεςΜήνεςΈτη,
  μονόςΖυγόςΔευτερεύουσαΓραμμή,
  κείμενοΔεδομένωνH3,
  μεΉΧωρίςΔευτερεύουσαΓραμμή,
  τύποςΔεδομένωνH6Βασικό,
  κείμενοΔεδομένωνH6Βασικό,
  κείμενοΔεδομένωνH6Δευτερεύον,
  τύποςΔεδομένωνH6Δευτερεύον,
  κείμενο,
  είδος,
  φωτογραφίαΠιστοποιητικού,
  ιστότοπος,
  τεχνολογίεςΓεγονότος,
}) => {
  return (
    <article key={ταυτότητα} className={styles['timeline-item']}>
      <div className={styles['timeline-dot']} />

      <div
        className={
          styles['timeline-content'] +
          ' ' +
          styles[`${μορφήΠεριβλήματος}`] +
          ' ' +
          styles[`${μεΉΧωρίςΔευτερεύουσαΓραμμή}`]
        }
      >
        <div className={styles[`${μονόςΖυγόςΠάνωΓραμμή}`]}>
          <div
            className={
              styles['χρονικές-πληροφορίες'] +
              ' ' +
              styles[`color${χρώμαΕίδους}`]
            }
          >
            <div className={styles['ημερομηνία-γεγονότος']}>
              {κείμενοΧρονολογίας}
            </div>
            <ΔιάρκειαΓεγονότος
              αριθμόςΗμερώνΕβδομάδωνΜηνώνΕτών={αριθμόςΗμερώνΕβδομάδωνΜηνώνΕτών}
              ημέρεςΕβδομάδεςΜήνεςΈτη={ημέρεςΕβδομάδεςΜήνεςΈτη}
            />
          </div>
          <ΒασικάΣτοιχείαΓεγονότος
            μονόςΖυγόςΔευτερεύουσαΓραμμή={μονόςΖυγόςΔευτερεύουσαΓραμμή}
            μεΉΧωρίςΔευτερεύουσαΓραμμή={μεΉΧωρίςΔευτερεύουσαΓραμμή}
          >
            <ΤίτλοςΓεγονότος κείμενοΔεδομένωνH3={κείμενοΔεδομένωνH3} />
            {μεΉΧωρίςΔευτερεύουσαΓραμμή === 'μεΔευτερεύουσαΓραμμή' && (
              <div className={styles['event-info']}>
                <ΔευτερεύουσαΓραμμή
                  μονός={μονός}
                  είδος={είδος}
                  τύποςΔεδομένωνH6Βασικό={τύποςΔεδομένωνH6Βασικό}
                  κείμενοΔεδομένωνH6Βασικό={κείμενοΔεδομένωνH6Βασικό}
                  τύποςΔεδομένωνH6Δευτερεύον={τύποςΔεδομένωνH6Δευτερεύον}
                  χρώμαΕίδους={χρώμαΕίδους}
                  κείμενοΔεδομένωνH6Δευτερεύον={κείμενοΔεδομένωνH6Δευτερεύον}
                />
              </div>
            )}
          </ΒασικάΣτοιχείαΓεγονότος>
        </div>
        <ΚείμενοΓεγονότος μονός={μονός} κείμενο={κείμενο} />
        <ΠλαϊνάΕικονίδια
          μονός={μονός}
          είδος={είδος}
          φωτογραφίαΠιστοποιητικού={φωτογραφίαΠιστοποιητικού}
          ιστότοπος={ιστότοπος}
        />
        {τεχνολογίεςΓεγονότος}
      </div>
    </article>
  );
};

export default Event;
