import styles from '@/components/TimelineItems.module.css';
import ΠληροφορίεςΔευτερεύουσαςΓραμμής from '@/components/Event/ΠληροφορίεςΔευτερεύουσαςΓραμμής';

const ΔευτερεύουσαΓραμμή = ({
  μονός,
  είδος,
  όνομα,
  τύπος,
  τοποθεσία,
  τύποςΣπουδών,
  τομέαςΕργασίας,
  χρώμαΕίδους,
  μεΉΧωρίςΔευτερεύουσαΓραμμή,
}) => {
  return (
    μεΉΧωρίςΔευτερεύουσαΓραμμή === 'μεΔευτερεύουσαΓραμμή' && (
      <div className={styles['event-info']}>
        <ΠληροφορίεςΔευτερεύουσαςΓραμμής
          μονός={μονός}
          είδος={είδος}
          όνομα={όνομα}
          τύπος={τύπος}
          τοποθεσία={τοποθεσία}
          τύποςΣπουδών={τύποςΣπουδών}
          τομέαςΕργασίας={τομέαςΕργασίας}
          χρώμαΕίδους={χρώμαΕίδους}
        />
      </div>
    )
  );
};

export default ΔευτερεύουσαΓραμμή;
