import styles from '@/components/TimelineItems.module.css';
import ΠληροφορίεςΔευτερεύουσαςΓραμμής from '@/components/Event/ΠληροφορίεςΔευτερεύουσαςΓραμμής';

const ΔευτερεύουσαΓραμμή = ({ στιγμή, μεΉΧωρίςΔευτερεύουσαΓραμμή, χρώμαΕίδους }) => {

  return (
    μεΉΧωρίςΔευτερεύουσαΓραμμή === 'μεΔευτερεύουσαΓραμμή' && (
      <div className={styles['event-info']}>
        <ΠληροφορίεςΔευτερεύουσαςΓραμμής
         στιγμή={στιγμή}
         χρώμαΕίδους={χρώμαΕίδους}
        />
      </div>
    )
  );
};

export default ΔευτερεύουσαΓραμμή;
