import styles from '@/components/TimelineItems.module.css';

import ΤίτλοςΓεγονότος from '@/components/Event/ΤίτλοςΓεγονότος';
import ΒασικάΣτοιχείαΓεγονότος from '@/components/Event/ΒασικάΣτοιχείαΓεγονότος';
import ΔευτερεύουσαΓραμμή from '@/components/Event/ΔευτερεύουσαΓραμμή';
import ΧρονικέςΠληροφορίες from '@/components/Event/ΧρονικέςΠληροφορίες';

const ΕπάνωΓραμμή = ({ στιγμή, μεΉΧωρίςΔευτερεύουσαΓραμμή }) => {

  const { ταυτότητα, γεγονός } = στιγμή;

  const { είδος } = γεγονός;

  const μονός = ταυτότητα % 2 !== 0 ? true : false;

  const μονόςΖυγόςΠάνωΓραμμή = μονός
    ? 'timeline-upper-line-odd'
    : 'timeline-upper-line-even';

  const χρώμαΕίδους =
    είδος === 'Σπουδές'
      ? '-orange'
      : είδος === 'Εργασία'
      ? '-gold'
      : είδος === 'Έργα'
      ? '-tirquaz'
      : '-normal';

  return (
    <div className={styles[`${μονόςΖυγόςΠάνωΓραμμή}`]}>
      <div
        className={
          styles['χρονικές-πληροφορίες'] + ' ' + styles[`color${χρώμαΕίδους}`]
        }
      >
        <ΧρονικέςΠληροφορίες στιγμή={στιγμή} />
      </div>
      <ΒασικάΣτοιχείαΓεγονότος
        στιγμή={στιγμή}
        μεΉΧωρίςΔευτερεύουσαΓραμμή={μεΉΧωρίςΔευτερεύουσαΓραμμή}
      >
        <ΤίτλοςΓεγονότος στιγμή={στιγμή} />
        <ΔευτερεύουσαΓραμμή
          στιγμή={στιγμή}
          μεΉΧωρίςΔευτερεύουσαΓραμμή={μεΉΧωρίςΔευτερεύουσαΓραμμή}
          χρώμαΕίδους={χρώμαΕίδους}
        />
      </ΒασικάΣτοιχείαΓεγονότος>
    </div>
  );
};

export default ΕπάνωΓραμμή;
