import styles from '@/components/TimelineItems.module.css';
import ΕπάνωΓραμμή from '@/components/Event/ΕπάνωΓραμμή';
import ΠλαϊνάΕικονίδια from '@/components/Event/ΠλαϊνάΕικονίδια';
import ΚείμενοΓεγονότος from '@/components/Event/ΚείμενοΓεγονότος';
import ΤεχνολογίεςΓεγονότος from '@/components/Event/ΤεχνολογίεςΓεγονότος';
import ΠερίβλημαΓεγονότος from '@/components/Event/ΠερίβλημαΓεγονότος';

import { στοιχείαΗμερομηνιών } from '@/utils/στοιχείαΗμερομηνιών';

const ΠεριεχόμενοΓεγονότος = ({ στιγμή }) => {
  const { γεγονός, οντότητα, σπουδές, κείμενο } = στιγμή;

  const { είδος, έναρξη, λήξη } = γεγονός;
  const { όνομα, τύπος } = οντότητα;

  const { ολοκλήρωση } = σπουδές;

  const { μελλοντικόΉΠαρελθοντικόΓεγονός } = στοιχείαΗμερομηνιών(έναρξη, λήξη);

  const μεΉΧωρίςΔευτερεύουσαΓραμμή =
    είδος === 'Έργα' && !όνομα
      ? 'χωρίςΔευτερεύουσαΓραμμή'
      : είδος === 'Έργα' && !τύπος
      ? 'χωρίςΔευτερεύουσαΓραμμή'
      : 'μεΔευτερεύουσαΓραμμή';

  const μορφήΠεριβλήματος =
    μελλοντικόΉΠαρελθοντικόΓεγονός === 'Μελλοντικό' && κείμενο
      ? 'pending-with-text'
      : μελλοντικόΉΠαρελθοντικόΓεγονός === 'Μελλοντικό' && !κείμενο
      ? 'pending-without-text'
      : ολοκλήρωση === '-' && κείμενο
      ? 'in-progress-with-text'
      : ολοκλήρωση === '-' && !κείμενο
      ? 'in-progress-without-text'
      : !ολοκλήρωση && κείμενο
      ? 'unfinished-with-text'
      : !ολοκλήρωση && !κείμενο
      ? 'unfinished-without-text'
      : ολοκλήρωση && !κείμενο
      ? 'finished-without-text'
      : 'finished-with-text';

  return (
    <ΠερίβλημαΓεγονότος
      μεΉΧωρίςΔευτερεύουσαΓραμμή={μεΉΧωρίςΔευτερεύουσαΓραμμή}
      μορφήΠεριβλήματος={μορφήΠεριβλήματος}
    >
      <ΕπάνωΓραμμή
        στιγμή={στιγμή}
        μεΉΧωρίςΔευτερεύουσαΓραμμή={μεΉΧωρίςΔευτερεύουσαΓραμμή}
      />
      <ΚείμενοΓεγονότος στιγμή={στιγμή} />
      <ΠλαϊνάΕικονίδια στιγμή={στιγμή} />
      <ΤεχνολογίεςΓεγονότος στιγμή={στιγμή} />
    </ΠερίβλημαΓεγονότος>
  );
};

export default ΠεριεχόμενοΓεγονότος;
