import styles from './page.module.css';

import Τίτλος from '@/components/Τίτλος';
import ΓραμμήΠλήκτρωνΣελίδαςΣχετικά from '@/components/Navigations/ΓραμμήΠλήκτρωνΣελίδαςΣχετικά';
import ΓραμμήΠλήκτρωνΚειμένουΣελίδαςΣχετικά from '@/components/Navigations/ΓραμμήΠλήκτρωνΚειμένουΣελίδαςΣχετικά';
import ΚοινόΠλήκτρο from '@/components/Κουμπιά/ΚοινόΠλήκτρο';
import Μετάφραση from '@/components/Μετάφραση';

export const metadata = {
  title: 'ΔΜ - Σχετικά με εμένα',
  description: 'Λεπτομέρειες σχετικά εμένα',
  keywords: ['Σχετικά με εμένα', 'About me', 'Om mig'],
  creator: 'Δημήτρης Μανωλόπουλος',
  publisher: 'Δημήτρης Μανωλόπουλος',
};

const ΣελίδαΣχετικάΜεΙστότοπο = () => {
  return (
    <main className={styles.main}>
      <Τίτλος text="Σχετικά" />
      <ΓραμμήΠλήκτρωνΣελίδαςΣχετικά />
      <section className={styles['τομέας-σχετικά']} id="τομέας-σχετικά">
        <div className={styles['περιέκτης-σχετικά']}>
          <p className={styles['κείμενο-σελίδας']}>
            <Μετάφραση>
              Καλώς ήλθατε! Ονομάζομαι Δημήτρης, κατάγομαι από την υπέροχη και
              ιστορική Ελλάδα και επί του παρόντος ζω και δραστηριοποιούμαι στην
              Σουηδία.
            </Μετάφραση>
          </p>
          <p className={styles['κείμενο-σελίδας']}>
            <Μετάφραση>
              Καθώς το βασικό μου ακαδημαϊκό υπόβαθρο είναι στην Πολιτική
              Μηχανική, η πορεία μου χαρακτηρίζεται από διαρκή εξέλιξη και
              προσαρμοστικότητα.
            </Μετάφραση>
          </p>
          <p className={styles['κείμενο-σελίδας']}>
            <Μετάφραση>
              Μετά από σπουδές στην Ελλάδα και την Αγγλία, ακολούθησε μια
              δύσκολη περίοδος ανεύρεσης εργασίας, στην υπό οικονομική κρίση
              χώρα μου, η οποία με οδήγησε να φύγω εκ νέου στο εξωτερικό.
            </Μετάφραση>
          </p>
          <p className={styles['κείμενο-σελίδας']}>
            <Μετάφραση>
              Μετά από μια εξίσου δύσκολη περίοδο αλλαγών, μεταξύ πόλεων της
              Αγγλίας και της Σουηδίας, κατέληξα στην Στοκχόλμη, όπου ζω τα
              τελευταία τρία χρόνια, και όπου αποφάσισα να αλλάξω επαγγελματική
              κατεύθυνση στον κόσμο της τεχνολογίας, καθότι ήταν και μεγάλη
              επιθυμία μου όπως και απώτερός μου στόχος.
            </Μετάφραση>
          </p>
          <p className={styles['κείμενο-σελίδας']}>
            <Μετάφραση>
              Η μετάβασή μου αυτή ξεκίνησε με έντονη διάθεση για μάθηση και
              δημιουργικότητα, οδηγώντας με σήμερα στη θέση του Νεαρού
              Πλήρους-Εύρους Προγραμματιστή (Junior Full-Stack Developer).
            </Μετάφραση>
          </p>
          <p className={styles['κείμενο-σελίδας']}>
            <Μετάφραση>
              Προς το παρόν εστιάζω κυρίως στην ανάπτυξη διαδικτυακών εφαρμογών,
              έχοντας αποκτήσει αρκετές γνώσεις και εμπειρία στη δημιουργία
              σύγχρονων ιστοτόπων και εφαρμογών ιστού.
            </Μετάφραση>
          </p>
          <p className={styles['κείμενο-σελίδας']}>
            <Μετάφραση>
              Πρόσφατα, ανέπτυξα τον παρόντα ιστότοπο, για προσωπική χρήση,
              χρησιμοποιώντας το NextJS, ένα ισχυρό πλαίσιο (framework) React
              που μου επέτρεψε να παρουσιάσω τις δεξιότητές μου και τα έργα μου
              με επαγγελματικό τρόπο.
            </Μετάφραση>
          </p>
          <p className={styles['κείμενο-σελίδας']}>
            <Μετάφραση>
              Παράλληλα, στοχεύω να διευρύνω τις γνώσεις μου στην Τεχνητή
              Νοημοσύνη (TN) και στις τεχνολογίες WEB3, με στόχο να συμβαδίζω με
              τις τεχνολογικές εξελίξεις και να προσφέρω καινοτόμες λύσεις. Η
              πορεία μου αποτυπώνει το πάθος για συνεχή βελτίωση και την
              επιθυμία να συμβάλλω ενεργά στον σύγχρονο ψηφιακό κόσμο.
            </Μετάφραση>
          </p>
          <p className={styles['κείμενο-σελίδας']}>
            <Μετάφραση>
              Παράλληλα, στοχεύω να διευρύνω τις γνώσεις μου στην Τεχνητή
              Νοημοσύνη (TN) και στις τεχνολογίες WEB3, με στόχο να συμβαδίζω με
              τις τεχνολογικές εξελίξεις και να προσφέρω καινοτόμες λύσεις. Η
              πορεία μου αποτυπώνει το πάθος για συνεχή βελτίωση και την
              επιθυμία να συμβάλλω ενεργά στον σύγχρονο ψηφιακό κόσμο.
            </Μετάφραση>
          </p>
          <div className={styles['περιέκτης-πλήκτρων-κειμένου']}>
            <h3 className={styles['τίτλος-πλήκτρων-κειμένου']}>
              <Μετάφραση>Μάθετε περισσότερα για εμένα</Μετάφραση>
            </h3>
            <ΓραμμήΠλήκτρωνΚειμένουΣελίδαςΣχετικά />
            <ΚοινόΠλήκτρο
              είδος="σύνδεσμος"
              σύνδεσμος="/programming/faq"
              style="δευτερεύον-πλήκτρο"
              κίνησηΑιώρησης="επιτόπια"
            >
              <Μετάφραση>Έχω ερώτηση</Μετάφραση>
            </ΚοινόΠλήκτρο>
          </div>
        </div>
      </section>
    </main>
  );
};

export default ΣελίδαΣχετικάΜεΙστότοπο;
