import styles from './ΣτοιχείοΤαινίαςΚύλισης.module.css';

import ΣτοιχείοΤαινίαςΚύλισης from '@/components/ΤαινίεςΚύλισης/ΣτοιχείοΤαινίαςΚύλισης';

import { σύνολοΤεχνολογιών } from '@/db/τεχνολογίες';

const ΑριστερόστροφηΤαινίαΚύλισης = () => {
  return (
    <div className={styles.wrapper}>
      {σύνολοΤεχνολογιών.map((τεχνολογία, index) => {
        return (
          <ΣτοιχείοΤαινίαςΚύλισης
            key={index}
            αριθμόςΣτοιχείου={index}
            όνομαΤεχνολογίας={τεχνολογία}
          />
        );
      })}

    
    </div>
  );
};
export default ΑριστερόστροφηΤαινίαΚύλισης
;
