import styles from './ΣτοιχείοΤαινίαςΚύλισης.module.css';

import ΣτοιχείοΤαινίαςΚύλισηςΜόνοΚείμενο from '@/components/ΤαινίεςΚύλισης/ΣτοιχείοΤαινίαςΚύλισηςΜόνοΚείμενο';

const ΔεξιόστροφηΤαινίαΚύλισης = ({ στοιχείαΠροςΑνάπτυξη }) => {
  return (
    <div className={styles['περιέκτης'] + ' ' + styles['περιέκτης-προς-δεξιά']}>
      {στοιχείαΠροςΑνάπτυξη.map((στοιχείο, index) => {
        return (
          <ΣτοιχείοΤαινίαςΚύλισηςΜόνοΚείμενο
            key={index}
            αριθμόςΣτοιχείου={index}
            όνομαΣτοιχείου={στοιχείο}
          />
        );
      })}
    </div>
  );
};
export default ΔεξιόστροφηΤαινίαΚύλισης;


