import styles from './page.module.css';

import Τίτλος from '@/components/Τίτλος';
import Φόρμα from '@/components/Επικοινωνία/Φόρμα';
import ΠλαίσιοΜορφής from '@/components/ΠλαίσιοΜορφής';
import ΚείμενοΤίτλοςΜικρήςΟθόνης from '@/components/Κείμενα/ΚείμενοΤίτλοςΜικρήςΟθόνης';
import ΠλήκτροΚειμένουΜικρήςΟθόνης from '@/components/Κουμπιά/ΠλήκτροΚειμένουΜικρήςΟθόνης';

export const metadata = {
  title: 'ΔΜ - Επικοινωνία',
  description: 'Σελίδα επικοινωνίας με Δημήτρη Μανωλόπουλο',
  keywords: ['Σελίδα επικοινωνίας', 'Contact page', 'Kontaktsida'],
  creator: 'Δημήτρης Μανωλόπουλος',
  publisher: 'Δημήτρης Μανωλόπουλος',
};

const ΣελίδαΕπικοινωνίας = () => {
  return (
    <main className={styles.main}>
      <Τίτλος text="Επικοινωνία" />

      <section
        className={styles['τομέας-επικοινωνίας']}
        id="τομέας-επικοινωνίας"
      >
        <Φόρμα id="φόρμα-γενικής-επικοινωνίας" />
      </section>
      {/* <ΠλαίσιοΜορφής
        καθορισμόςΔιαστάσεων="από μέσα"
        ακτίναΓωνίας={15}
        πάχοςΟρίου={1}
        ενεργόςΔιακόπτηςΦέγγουςΟρίων
        ενεργόςΔιακόπτηςΦέγγουςΣτοιχείων
        pxΠλάτουςΓιαΑπόκρυψη={1024}
      >
        <ΚείμενοΤίτλοςΜικρήςΟθόνης />
      </ΠλαίσιοΜορφής>
      <ΠλήκτροΚειμένουΜικρήςΟθόνης pxΠλάτουςΓιαΑπόκρυψη={1024} /> */}
    </main>
  );
};

export default ΣελίδαΕπικοινωνίας;
