import styles from '@/components/Κείμενα/Κείμενο.module.css';

import Μετάφραση from '@/components/Μετάφραση';

const ΚείμενοΜικρήςΟθόνης = () => {
  return (
    <div className={styles['περιέκτης-κειμένου']}>
      <div className={styles['κείμενο']}>
        <Μετάφραση>
          Αυτός ο ιστότοπος δημιουργήθηκε με στόχο την επίδειξη των δεξιοτήτων
          μου στην ανάπτυξη ιστού, με αποτέλεσμα πολύπλοκα στοιχεία (π.χ.
          «Χρονολόγιο») που λειτουργούν ιδανικά σε μεγαλύτερες οθόνες. Για μια
          ολοκληρωμένη εμπειρία, συνιστάται η περιήγηση σε συσκευή με μεγαλύτερο
          μέγεθος οθόνης (iPad ή μεγαλύτερη).
        </Μετάφραση>
      </div>
    </div>
  );
};

export default ΚείμενοΜικρήςΟθόνης;
