import styles from '@/components/Κείμενα/ΚείμενοΤίτλοςΜικρήςΟθόνης.module.css';

import Μετάφραση from '@/components/Μετάφραση';

const ΚείμενοΤίτλοςΜικρήςΟθόνης = ({ pxΓιαΑπόκρυψη }) => {
  const μέγεθοςΑπόκρυψης = pxΓιαΑπόκρυψη
    ? pxΓιαΑπόκρυψη === 1024
      ? 'απόκρυψη-στα-1024px'
      : 'απόκρυψη-στα-1366px'
    : '';

  return (
    <div
      className={
        styles['περιέκτης-κειμένου'] + ' ' + styles[`${μέγεθοςΑπόκρυψης}`]
      }
    >
      <p className={styles['παράγραφος']}>
        <Μετάφραση>
          Για βέλτιστη εμπειρία, συνιστάται η περιήγηση σε συσκευή με μεγαλύτερη
          οθόνη (iPad ή μεγαλύτερη).
        </Μετάφραση>
      </p>
    </div>
  );
};

export default ΚείμενοΤίτλοςΜικρήςΟθόνης;
