import styles from '@/components/Κείμενα/Κείμενο.module.css';

import Μετάφραση from '@/components/Μετάφραση';

const ΚείμενοΣυχνώνΕρωτήσεων = () => {
  return (
    <>
      <div className={styles['περιέκτης-κειμένου']}>
        <p className={styles['παράγραφος']}>
          <Μετάφραση>Προς το παρόν δεν υπάρχουν συχνές ερωτήσεις.</Μετάφραση>
        </p>
        <p className={styles['παράγραφος']}>
          <Μετάφραση>
            Εάν έχετε κάποιαν ερώτηση παρακαλώ επικοινωνήστε μαζί μου.
          </Μετάφραση>
        </p>
      </div>
    </>
  );
};

export default ΚείμενοΣυχνώνΕρωτήσεων;
