import styles from '@/components/Κείμενα/Κείμενο.module.css';

import Μετάφραση from '@/components/Μετάφραση';

const ΚείμενοΜικρήςΟθόνης = () => {
  return (
    <div className={styles['περιέκτης-κειμένου']}>
      <p className={styles['παράγραφος']}>
        <Μετάφραση>
          Ο ιστότοπος αυτός δημιουργήθηκε για την επίδειξη των δεξιοτήτων μου
          στην ανάπτυξη ιστού, με αποτέλεσμα σύνθετα στοιχεία (όπως το
          "Χρονολόγιο") που αποδίδουν καλύτερα σε μεγαλύτερες οθόνες.
        </Μετάφραση>
      </p>
      <p className={styles['παράγραφος']}>
        <Μετάφραση>
          Η ανάπτυξη συνεχίζεται και σταδιακά προστίθεται αποκρισιμότητα και για
          μικρότερες οθόνες. Ορισμένες σελίδες θα εμφανίζουν αυτό το μήνυμα
          μέχρι το πέρας τους, καθώς η προσαρμογή για κινητές συσκευές δεν
          αποτελεί άμεση προτεραιότητα.
        </Μετάφραση>
      </p>
      <p className={styles['παράγραφος']}>
        <Μετάφραση>
          Για βέλτιστη εμπειρία, συνιστάται η περιήγηση σε συσκευή με μεγαλύτερη
          οθόνη (iPad ή μεγαλύτερη).
        </Μετάφραση>
      </p>
      <p className={styles['παράγραφος']}>
        <Μετάφραση>
          Εάν χρησιμοποιείτε συσκευή τύπου iPad και το μήνυμα συνεχίζει να
          εμφανίζεται δοκιμάστε να την στρέψετε στο πλάι σε οριζόντιο
          προσανατολισμό.
        </Μετάφραση>
      </p>
    </div>
  );
};

export default ΚείμενοΜικρήςΟθόνης;
