import styles from './TimelineItems.module.css';
import { χρονολόγιο } from '@/db/χρονολόγιο';
import { στοιχείαΗμερομηνιών } from '@/utils/στοιχείαΗμερομηνιών';

import TechIcon from '@/components/TechIcon';
import EventMonth from './EventMonth';
import Event from './Event';

const TimelineItems = () => {
  return (
    <>
      <div className={styles['timeline-items']}>
        {χρονολόγιο
          .filter((στιγμή) => στιγμή.γεγονός.κατηγορία === 'Προγραμματισμός')
          .map((στιγμή) => {
            const {
              ταυτότητα,
              γεγονός,
              οντότητα,
              σπουδές,
              εργασία,
              έργο,
              τεχνολογίες,
              τοποθεσία,
              κείμενο,
            } = στιγμή;

            const { είδος, κατηγορία, έναρξη, λήξη } = γεγονός;
            const { όνομα, τύπος, λογότυπο, ιστότοπος } = οντότητα;

            const {
              σχολή,
              τμήμαΉΤίτλος,
              τύποςΣπουδών,
              διάρκειαΔιδακτέαςΎλης,
              δίδακτρα,
              ολοκλήρωση,
              πιστοποιητικό,
              φωτογραφίαΠιστοποιητικού,
            } = σπουδές;

            const { θέση, τομέαςΕργασίας } = εργασία;
            const { τίτλοςΈργου } = έργο;

            const μονός = ταυτότητα % 2 !== 0 ? true : false;

            const {
              τρέχουσαΗμερομηνία,
              τρέχονΈτος,
              τρέχονΜήνας,
              τρέχουσαΗμέρα,
              ημερομηνίαΈναρξης,
              ημερομηνίαΛήξης,
              μήναςΈναρξης,
              μήναςΛήξης,
              χρονολογίαΈναρξης,
              χρονολογίαΛήξης,
              μελλοντικόΉΠαρελθοντικόΓεγονός,
              διάρκειαΓεγονότοςΣεΗμέρες,
              αριθμόςΗμερώνΕβδομάδωνΜηνώνΕτών,
              ημέρεςΕβδομάδεςΜήνεςΈτη,
              κείμενοΔιάρκειαςΓεγονότος,
            } = στοιχείαΗμερομηνιών(έναρξη, λήξη);

            const μεΉΧωρίςΔευτερεύουσαΓραμμή =
              είδος === 'Έργα' && !όνομα
                ? 'χωρίςΔευτερεύουσαΓραμμή'
                : είδος === 'Έργα' && !τύπος
                ? 'χωρίςΔευτερεύουσαΓραμμή'
                : 'μεΔευτερεύουσαΓραμμή';


            const μορφήΠεριβλήματος =
              μελλοντικόΉΠαρελθοντικόΓεγονός === 'Μελλοντικό' && κείμενο
                ? 'pending-with-text'
                : μελλοντικόΉΠαρελθοντικόΓεγονός === 'Μελλοντικό' && !κείμενο
                ? 'pending-without-text'
                :ολοκλήρωση === '-' && κείμενο
                ? 'in-progress-with-text'
                : ολοκλήρωση === '-' && !κείμενο
                ? 'in-progress-without-text'
                : !ολοκλήρωση && κείμενο
                ? 'unfinished-with-text'
                : !ολοκλήρωση && !κείμενο
                ? 'unfinished-without-text'
                : ολοκλήρωση && !κείμενο
                ? 'finished-without-text'
                : 'finished-with-text';

            const μονόςΖυγόςΠάνωΓραμμή = μονός
              ? 'timeline-upper-line-odd'
              : 'timeline-upper-line-even';

            const μονόςΖυγόςΔευτερεύουσαΓραμμή = μονός
              ? 'event-odd'
              : 'event-even';

            const χρώμαΕίδους =
              είδος === 'Σπουδές'
                ? '-orange'
                : είδος === 'Εργασία'
                ? '-gold'
                : είδος === 'Έργα'
                ? '-tirquaz'
                : '-normal';

            const κείμενοΧρονολογίας = μονός ? (
              μήναςΈναρξης ? (
                <>
                  <div className={styles['timeline-date-year']}>
                    {χρονολογίαΈναρξης}
                  </div>
                  <div className={styles['timeline-date-month-odd']}>
                    <EventMonth έναρξη={έναρξη} />
                  </div>
                </>
              ) : (
                <div className={styles['timeline-date-year']}>
                  {χρονολογίαΈναρξης}
                </div>
              )
            ) : μήναςΈναρξης ? (
              <>
                <div className={styles['timeline-date-month-even']}>
                  <EventMonth έναρξη={έναρξη} />
                </div>
                <div className={styles['timeline-date-year']}>
                  {χρονολογίαΈναρξης}
                </div>
              </>
            ) : (
              <div className={styles['timeline-date-year']}>
                {χρονολογίαΈναρξης}
              </div>
            );

            const κείμενοΔεδομένωνH3 =
              είδος === 'Σπουδές'
                ? τμήμαΉΤίτλος
                : είδος === 'Εργασία'
                ? θέση
                : είδος === 'Έργα'
                ? τίτλοςΈργου
                : τμήμαΉΤίτλος || θέση || τίτλοςΈργου;

            const κείμενοΔεδομένωνH6Βασικό =
              είδος === 'Σπουδές' || είδος === 'Εργασία' ? όνομα : null;

            const τύποςΔεδομένωνH6Βασικό =
              είδος === 'Σπουδές' || είδος === 'Εργασία' ? τύπος : null;

            const τύποςΔεδομένωνH6Δευτερεύον =
              είδος === 'Σπουδές'
                ? τοποθεσία && τοποθεσία
                : είδος === 'Εργασία'
                ? τοποθεσία && τοποθεσία
                : είδος === 'Έργα'
                ? null
                : null;

            const κείμενοΔεδομένωνH6Δευτερεύον =
              είδος === 'Σπουδές'
                ? τύποςΣπουδών && τύποςΣπουδών
                : είδος === 'Εργασία'
                ? τομέαςΕργασίας
                : είδος === 'Έργα'
                ? null
                : null;

            const τεχνολογίεςΓεγονότος =
              τεχνολογίες.length !== 0 ? (
                <div
                  className={
                    styles['tech-container'] +
                    ' ' +
                    styles[`tech-${τεχνολογίες.length}`]
                  }
                >
                  {τεχνολογίες.map((τεχνολογία) => {
                    return (
                      <TechIcon
                        key={τεχνολογία}
                        όνομαΤεχνολογίας={τεχνολογία}
                      />
                    );
                  })}
                </div>
              ) : null;

            return (
              <Event
                key={ταυτότητα}
                ταυτότητα={ταυτότητα}
                μονός={μονός}
                μορφήΠεριβλήματος={μορφήΠεριβλήματος}
                μονόςΖυγόςΠάνωΓραμμή={μονόςΖυγόςΠάνωΓραμμή}
                χρώμαΕίδους={χρώμαΕίδους}
                κείμενοΧρονολογίας={κείμενοΧρονολογίας}
                αριθμόςΗμερώνΕβδομάδωνΜηνώνΕτών={
                  αριθμόςΗμερώνΕβδομάδωνΜηνώνΕτών
                }
                ημέρεςΕβδομάδεςΜήνεςΈτη={ημέρεςΕβδομάδεςΜήνεςΈτη}
                μονόςΖυγόςΔευτερεύουσαΓραμμή={μονόςΖυγόςΔευτερεύουσαΓραμμή}
                κείμενοΔεδομένωνH3={κείμενοΔεδομένωνH3}
                μεΉΧωρίςΔευτερεύουσαΓραμμή={μεΉΧωρίςΔευτερεύουσαΓραμμή}
                τύποςΔεδομένωνH6Βασικό={τύποςΔεδομένωνH6Βασικό}
                κείμενοΔεδομένωνH6Βασικό={κείμενοΔεδομένωνH6Βασικό}
                κείμενοΔεδομένωνH6Δευτερεύον={κείμενοΔεδομένωνH6Δευτερεύον}
                τύποςΔεδομένωνH6Δευτερεύον={τύποςΔεδομένωνH6Δευτερεύον}
                κείμενο={κείμενο}
                είδος={είδος}
                φωτογραφίαΠιστοποιητικού={φωτογραφίαΠιστοποιητικού}
                ιστότοπος={ιστότοπος}
                τεχνολογίεςΓεγονότος={τεχνολογίεςΓεγονότος}
              ></Event>
            );
          })}
      </div>
    </>
  );
};
export default TimelineItems;
