import styles from '@/components/TimelineItems.module.css';
import ΤίτλοςΓεγονότος from '@/components/Event/ΤίτλοςΓεγονότος';
import ΒασικάΣτοιχείαΓεγονότος from '@/components/Event/ΒασικάΣτοιχείαΓεγονότος';
import ΠλαϊνάΕικονίδια from '@/components/Event/ΠλαϊνάΕικονίδια';
import ΔευτερεύουσαΓραμμή from '@/components/Event/ΔευτερεύουσαΓραμμή';
import ΚείμενοΓεγονότος from '@/components/Event/ΚείμενοΓεγονότος';
import ΧρονικέςΠληροφορίες from '@/components/Event/ΧρονικέςΠληροφορίες';
import ΤεχνολογίεςΓεγονότος from '@/components/Event/ΤεχνολογίεςΓεγονότος';
import ΤελείαΓεγονότος from '@/components/Event/ΤελείαΓεγονότος';

import { χρονολόγιο } from '@/db/χρονολόγιο';
import { στοιχείαΗμερομηνιών } from '@/utils/στοιχείαΗμερομηνιών';

const TimelineItems = () => {
  return (
    <>
      <div className={styles['timeline-items']}>
        {χρονολόγιο
          .filter((στιγμή) => στιγμή.γεγονός.κατηγορία === 'Προγραμματισμός')
          .map((στιγμή) => {
            const {
              ταυτότητα,
              γεγονός,
              οντότητα,
              σπουδές,
              εργασία,
              έργο,
              τεχνολογίες,
              τοποθεσία,
              κείμενο,
            } = στιγμή;

            const { είδος, κατηγορία, έναρξη, λήξη } = γεγονός;
            const { όνομα, τύπος, λογότυπο, ιστότοπος } = οντότητα;

            const {
              σχολή,
              τμήμαΉΤίτλος,
              τύποςΣπουδών,
              διάρκειαΔιδακτέαςΎλης,
              δίδακτρα,
              ολοκλήρωση,
              πιστοποιητικό,
              φωτογραφίαΠιστοποιητικού,
            } = σπουδές;

            const { θέση, τομέαςΕργασίας } = εργασία;
            const { τίτλοςΈργου } = έργο;

            const μονός = ταυτότητα % 2 !== 0 ? true : false;

            const {
              τρέχουσαΗμερομηνία,
              τρέχονΈτος,
              τρέχονΜήνας,
              τρέχουσαΗμέρα,
              ημερομηνίαΈναρξης,
              ημερομηνίαΛήξης,
              μήναςΈναρξης,
              μήναςΛήξης,
              χρονολογίαΈναρξης,
              χρονολογίαΛήξης,
              μελλοντικόΉΠαρελθοντικόΓεγονός,
              διάρκειαΓεγονότοςΣεΗμέρες,
              αριθμόςΗμερώνΕβδομάδωνΜηνώνΕτών,
              ημέρεςΕβδομάδεςΜήνεςΈτη,
              κείμενοΔιάρκειαςΓεγονότος,
            } = στοιχείαΗμερομηνιών(έναρξη, λήξη);

            const μεΉΧωρίςΔευτερεύουσαΓραμμή =
              είδος === 'Έργα' && !όνομα
                ? 'χωρίςΔευτερεύουσαΓραμμή'
                : είδος === 'Έργα' && !τύπος
                ? 'χωρίςΔευτερεύουσαΓραμμή'
                : 'μεΔευτερεύουσαΓραμμή';

            const μορφήΠεριβλήματος =
              μελλοντικόΉΠαρελθοντικόΓεγονός === 'Μελλοντικό' && κείμενο
                ? 'pending-with-text'
                : μελλοντικόΉΠαρελθοντικόΓεγονός === 'Μελλοντικό' && !κείμενο
                ? 'pending-without-text'
                : ολοκλήρωση === '-' && κείμενο
                ? 'in-progress-with-text'
                : ολοκλήρωση === '-' && !κείμενο
                ? 'in-progress-without-text'
                : !ολοκλήρωση && κείμενο
                ? 'unfinished-with-text'
                : !ολοκλήρωση && !κείμενο
                ? 'unfinished-without-text'
                : ολοκλήρωση && !κείμενο
                ? 'finished-without-text'
                : 'finished-with-text';

            const μονόςΖυγόςΠάνωΓραμμή = μονός
              ? 'timeline-upper-line-odd'
              : 'timeline-upper-line-even';

            const χρώμαΕίδους =
              είδος === 'Σπουδές'
                ? '-orange'
                : είδος === 'Εργασία'
                ? '-gold'
                : είδος === 'Έργα'
                ? '-tirquaz'
                : '-normal';

            return (
              <article key={ταυτότητα} className={styles['timeline-item']}>
                <ΤελείαΓεγονότος />

                <div
                  className={
                    styles['timeline-content'] +
                    ' ' +
                    styles[`${μορφήΠεριβλήματος}`] +
                    ' ' +
                    styles[`${μεΉΧωρίςΔευτερεύουσαΓραμμή}`]
                  }
                >
                  <div className={styles[`${μονόςΖυγόςΠάνωΓραμμή}`]}>
                    <div
                      className={
                        styles['χρονικές-πληροφορίες'] +
                        ' ' +
                        styles[`color${χρώμαΕίδους}`]
                      }
                    >
                      <ΧρονικέςΠληροφορίες
                        μονός={μονός}
                        έναρξη={έναρξη}
                        λήξη={λήξη}
                      />
                    </div>
                    <ΒασικάΣτοιχείαΓεγονότος
                      μονός={μονός}
                      μεΉΧωρίςΔευτερεύουσαΓραμμή={μεΉΧωρίςΔευτερεύουσαΓραμμή}
                    >
                      <ΤίτλοςΓεγονότος
                        είδος={είδος}
                        τμήμαΉΤίτλος={τμήμαΉΤίτλος}
                        θέση={θέση}
                        τίτλοςΈργου={τίτλοςΈργου}
                      />
                      <ΔευτερεύουσαΓραμμή
                        μονός={μονός}
                        είδος={είδος}
                        όνομα={όνομα}
                        τύπος={τύπος}
                        τοποθεσία={τοποθεσία}
                        τύποςΣπουδών={τύποςΣπουδών}
                        τομέαςΕργασίας={τομέαςΕργασίας}
                        χρώμαΕίδους={χρώμαΕίδους}
                        μεΉΧωρίςΔευτερεύουσαΓραμμή={μεΉΧωρίςΔευτερεύουσαΓραμμή}
                      />
                    </ΒασικάΣτοιχείαΓεγονότος>
                  </div>
                  <ΚείμενοΓεγονότος μονός={μονός} κείμενο={κείμενο} />
                  <ΠλαϊνάΕικονίδια
                    μονός={μονός}
                    είδος={είδος}
                    φωτογραφίαΠιστοποιητικού={φωτογραφίαΠιστοποιητικού}
                    ιστότοπος={ιστότοπος}
                  />
                  <ΤεχνολογίεςΓεγονότος τεχνολογίες={τεχνολογίες} />
                </div>
              </article>
            );
          })}
      </div>
    </>
  );
};
export default TimelineItems;
