import styles from './TodoItems.module.css';

import Μετάφραση from './Μετάφραση';

import { DateTime, Duration } from 'luxon';
import { προςΥλοποίηση } from '@/db/προςΥλοποίηση';

import { μετάφραση } from '@/utils/μετάφραση';

const TodoItems = () => {
  const εναπομείνασεςΚρίσιμεςΕκκρεμότητες = προςΥλοποίηση
    .filter((todo) => todo.τομέας === 'Προγραμματισμός')
    .filter((todo) => todo.ολοκλήρωση === false)
    .filter((todo) => todo.κρίσιμο === true);

  const εναπομείνασεςΕκκρεμότητες = προςΥλοποίηση
    .filter((todo) => todo.τομέας === 'Προγραμματισμός')
    .filter((todo) => todo.ολοκλήρωση === false);

  const εκκρεμότητεςΠροςΕμφάνιση =
    εναπομείνασεςΚρίσιμεςΕκκρεμότητες.length > 0
      ? εναπομείνασεςΚρίσιμεςΕκκρεμότητες
      : εναπομείνασεςΕκκρεμότητες;

  return (
    <>
      <div className={styles['στοιχεία-εκκρεμοτήτων']}>
        {εκκρεμότητεςΠροςΕμφάνιση.map((todo, index) => {
          const {
            ταυτότητα,
            τομέας,
            μέρος,
            τύπος,
            επεξήγηση,
            κρίσιμο,
            ενΕξελίξει,
            ολοκλήρωση,
          } = todo;

          const μορφήΠεριβλήματος =
            ολοκλήρωση === true
              ? 'ολοκληρωμένο'
              : ενΕξελίξει
                ? 'ενΕξελίξει'
                : 'ενΑναμονή';
          const κείμενο =
            τύπος === 'Σελίδα' && επεξήγηση === 'Δημιουργία σελίδας'
              ? `${επεξήγηση} «${μέρος}»`
              : επεξήγηση;

          return (
            <article key={ταυτότητα} className={styles['εκκρεμότητα']}>
              <div
                className={
                  styles['περιεχόμενο-εκκρεμότητας'] +
                  ' ' +
                  styles[`${μορφήΠεριβλήματος}`]
                }
              >
                <div className={styles['αριθμός-εκκρεμότητας']}>
                  {index + 1}
                </div>
                <h4 className={styles['επάνω-γραμμή']}>
                  <Μετάφραση>{τύπος}</Μετάφραση> <Μετάφραση>για</Μετάφραση>{' '}
                  <Μετάφραση>
                    {μέρος === 'Ιστότοπος' ? 'Ιστότοπο' : μέρος}
                  </Μετάφραση>
                </h4>
                <h3 className={styles['κάτω-γραμμή']}>
                  <Μετάφραση>{κείμενο}</Μετάφραση>
                </h3>
              </div>
            </article>
          );
        })}
      </div>
    </>
  );
};
export default TodoItems;
