'use client';

import styles from './Ηρώο.module.css';

import Link from 'next/link';
import ΓραμμήΠλήκτρωνΗρώου from '@/components/Navigations/ΓραμμήΠλήκτρωνΗρώου';
import ΔεξιόστροφηΤαινίαΚύλισης from '@/components/ΤαινίεςΚύλισης/ΔεξιόστροφηΤαινίαΚύλισης';
import ΑριστερόστροφηΤαινίαΚύλισης from '@/components/ΤαινίεςΚύλισης/ΑριστερόστροφηΤαινίαΚύλισης';
import Μετάφραση from '@/components/Μετάφραση';
import ΠλαίσιοΜορφής from '@/components/ΠλαίσιοΜορφής';

import { useAppContext } from '@/context/AppContext';

import { σύνολοΤεχνολογιώνΠληνΠακέτων, πακέτα } from '@/db/τεχνολογίες';

const Hero = () => {
  const { language } = useAppContext();

  return (
    <>
      <ΠλαίσιοΜορφής
        καθορισμόςΔιαστάσεων="από μέσα"
        ακτίναΓωνίας={35}
        πάχοςΟρίου={2}
        ενεργόςΔιακόπτηςΦέγγουςΟρίων={true}
        ενεργόςΔιακόπτηςΦέγγουςΣτοιχείων={true}
      >
        <div className={styles['περιεχόμενο-αρχικής']}>
          {language === 'english' ? (
            <h1>
              Hi, it&apos;s<pre> </pre>
              <span> Dimitris</span>
            </h1>
          ) : language === 'svenska' ? (
            <h1>
              Hej, jag heter<pre> </pre>
              <span>Dimitris</span>
            </h1>
          ) : (
            <h1>
              Χαίρεται,<pre> </pre>
              <span>Δημήτρης</span>
              <pre> </pre>εδώ
            </h1>
          )}

          <p>
            <Μετάφραση>
              Είμαι ένας νεαρός Πλήρους-Εύρους Προγραμματιστής Ιστού με
              προσήλωση στην εξέλιξη και στόχο την βέλτιστη λύση.
            </Μετάφραση>
          </p>

          <div className={styles['περιέκτης-ταινιών-κύλισης']}>
            <ΑριστερόστροφηΤαινίαΚύλισης
              στοιχείαΠροςΑνάπτυξη={σύνολοΤεχνολογιώνΠληνΠακέτων}
            />
            <ΔεξιόστροφηΤαινίαΚύλισης στοιχείαΠροςΑνάπτυξη={πακέτα} />
          </div>

          <ΓραμμήΠλήκτρωνΗρώου />
        </div>
      </ΠλαίσιοΜορφής>
      <div className={styles['περιέκτης-λογότυπου']}>
        {/* <Λογότυπο πλάτος={350} μέρος="ηρώο" /> */}
        {/* <Image
          className={styles.εικόνα}
          src={'/images/Φτερά.png'}
          height={400}
          width={400}
          alt="Φτερά Ικάρου"
        /> */}
        <Link href="/" className={styles.λογότυπο}>
          <div className={styles['λογότυπο-ενιαίο']}>
            <svg
              width="100%"
              height="100%"
              viewBox="0 0 345 300"
              xmlns="http://www.w3.org/2000/svg"
              data-name="Υπόβαθρο Λογότυπου"
            >
              <g transform="translate(172.5,150) scale(0.85) translate(-172.5,-150)">
                <title>Λογότυπο</title>
                <path
                  d="m339.5,4.32c-1.07999,0 -25.25,23.53 -53.95999,52.23l-45.43001,45.43c-3.86,3.85999 -10.14,3.85999 -14.00999,0l-47.59001,-47.59l-51.73,-51.5c-1.86,-1.86 -4.36,-2.89 -6.99,-2.89l-57.22,0c-8.65,0 -13.14,10.36 -7.23,16.68c0.39,0.43 0.76,0.82 1.14,1.23c0.13,0.11 0.24,0.22 0.37,0.35c0.17,0.15 0.28,0.35 0.43,0.52c0.35,0.37 0.71,0.76 1.06,1.12c0.24,0.19 0.5,0.39 0.69,0.63c0.13,0.17 0.26,0.35 0.39,0.52c0,0 0,0.02 0.02,0.04c0.11,0.13 0.22,0.24 0.32,0.35c0.13,0.13 0.28,0.24 0.41,0.37c0.17,0.15 0.3,0.32 0.41,0.52c0.56,0.6 1.12,1.21 1.66,1.79c0.32,0.35 0.67,0.71 0.99,1.06c0.22,0.19 0.41,0.41 0.63,0.63c0.22,0.19 0.41,0.43 0.58,0.67c0.54,0.56 1.07999,1.17 1.64,1.75c0.17,0.17 0.32,0.37 0.5,0.52l0,0.02c0.28,0.3 0.56,0.6 0.84,0.91l0.04,0.04l0.5,0.5c0.15,0.15 0.32,0.3 0.47,0.47c0.13,0.13 0.24,0.28 0.35,0.43l0,0c0.91,0.97 1.83,1.94 2.78,2.96c0.04,0.04 0.09,0.06 0.15,0.11l0,0s0.02,0.02 0.04,0.04l0,0c0.06,0.09 0.13,0.17 0.19,0.26c3.56,3.78 7.42,7.9 11.59,12.3c0.06,0.06 0.13,0.13 0.19,0.19c14.44,15.35 32.4,34.42 53.24001,56.59l89.03,89.03001c3.86,3.86 10.14,3.86 14.00999,0l13.06,-13.06001c11.01001,-10.78999 20.72,-19.86 21.58002,-19.86c0.64999,0 1.72998,31.29001 1.93997,69.5l0.56003,60.09c0.03998,5.35001 4.35999,9.71002 9.70999,9.82001l22.32001,0.45001l21.59998,0.42999c5.55002,0.10999 10.12003,-4.36002 10.12003,-9.91l0,-137.94c0,-81.37 -0.65002,-147.83999 -1.51001,-147.83999l0.09,0.04l0,0l0.03,0z"
                  className={styles.εικόνα}
                  data-name="svg 1"
                  id="svg_1"
                />
                <path
                  d="m164.03,268.70999l-28.38,28.38c-1.86,1.85999 -4.37999,2.91 -7.00999,2.91l-118.73,0c-5.48,0 -9.91,-4.45001 -9.91,-9.91l0,-34.34001l0.37,-20.26999l0,0c8.81,-0.09001 17.59,-0.15001 26.4,-0.24001l36.26,0c19.86,0 36.26,-0.64999 36.26,-1.73c0,-0.86 -22.23,-23.96001 -49.64,-51.15001l-46.74,-46.72998c-1.85,-1.86 -2.91,-4.39 -2.91,-7.02l0,-38.2c0,-23.31001 0.65,-42.95 1.51,-43.81001c0.86,-0.86 44.89,41.87 97.77,94.75001l89.03,89.03c3.86,3.86 3.86,10.14 0,14.00999l-24.28001,24.28001l0,0.03998l0,0l0.00002,0z"
                  className={styles.εικόνα}
                  data-name="svg 2"
                  id="svg_2"
                />
              </g>
            </svg>
          </div>
        </Link>
      </div>
    </>
  );
};

export default Hero;

{
  /* <iframe allow="autoplay *; encrypted-media *;" frameborder="0" height="150" style="width:100%;max-width:660px;overflow:hidden;background:transparent;" sandbox="allow-forms allow-popups allow-same-origin allow-scripts allow-storage-access-by-user-activation allow-top-navigation-by-user-activation" src="https://embed.music.apple.com/gr/album/drakontas/767350412?i=767350497"></iframe> */
}
