'use client';

import styles from './Ηρώο.module.css';

import Link from 'next/link';
import ΔεξιόστροφηΤαινίαΚύλισης from '@/components/ΤαινίεςΚύλισης/ΔεξιόστροφηΤαινίαΚύλισης';
import ΑριστερόστροφηΤαινίαΚύλισης from '@/components/ΤαινίεςΚύλισης/ΑριστερόστροφηΤαινίαΚύλισης';
import TranslatedText from '@/components/TranslatedText';
import ΠλαίσιοΜορφής from '@/components/ΠλαίσιοΜορφής';

import { useAppContext } from '@/context/AppContext';

import { σύνολοΤεχνολογιώνΠληνΠακέτων, πακέτα } from '../db/τεχνολογίες';

const Hero = () => {
  const { language, υπόβαθροΠρογραμματισμού } = useAppContext();

  return (
    <section
      className={
        styles[
          `${υπόβαθροΠρογραμματισμού === 'δυναμικό' ? 'αρχική' : 'αρχική'}` //<-------------- Στο τέλος να ελέγξω αν χρειάζεται
        ]
      }
      id="αρχική"
    >
      <ΠλαίσιοΜορφής
        καθορισμόςΔιαστάσεων="από μέσα"
        ακτίναΓωνίας={35}
        πάχοςΟρίου={2}
        ενεργόςΔιακόπτηςΦέγγουςΟρίων={true}
        ενεργόςΔιακόπτηςΦέγγουςΣτοιχείων={true}
      >
        <div className={styles['περιεχόμενο-αρχικής']}>
          {language === 'english' ? (
            <h1>
              Hi, it&apos;s<pre> </pre>
              <span> Dimitris</span>
            </h1>
          ) : language === 'svenska' ? (
            <h1>
              Hej, jag heter<pre> </pre>
              <span>Dimitris</span>
            </h1>
          ) : (
            <h1>
              Χαίρεται,<pre> </pre>
              <span>Δημήτρης</span>
              <pre> </pre>εδώ
            </h1>
          )}

          <h3>
            <TranslatedText>
              Είμαι ένας νεαρός Πλήρους-Εύρους Προγραμματιστής Ιστού με
              προσήλωση στην εξέλιξη και στόχο την βέλτιστη λύση.
            </TranslatedText>
          </h3>

          <div className={styles['περιέκτης-ταινιών-κύλισης']}>
            <ΑριστερόστροφηΤαινίαΚύλισης
              στοιχείαΠροςΑνάπτυξη={σύνολοΤεχνολογιώνΠληνΠακέτων}
            />
            <ΔεξιόστροφηΤαινίαΚύλισης στοιχείαΠροςΑνάπτυξη={πακέτα} />
          </div>

          <div className={styles['περιέκτης-πλήκτρων']}>
            <Link href="#" className={styles['βασικό-πλήκτρο']}>
              <TranslatedText>Πρόσληψη</TranslatedText>
            </Link>
            <Link
              href="/programming/contact"
              className={styles['δευτερεύον-πλήκτρο']}
            >
              <TranslatedText>Επικοινωνία</TranslatedText>
            </Link>
          </div>
        </div>
      </ΠλαίσιοΜορφής>
      <div className={styles['περιέκτης-λογότυπου']}>
        {/* <Λογότυπο πλάτος={350} μέρος="ηρώο" /> */}
        {/* <Image
          className={styles.εικόνα}
          src={'/images/Φτερά.png'}
          height={400}
          width={400}
          alt="Φτερά Ικάρου"
        /> */}
        <Link href="/" className={styles.λογότυπο}>
          <div className={styles['logo-to-480px']}>
            <svg
              width="158"
              height="139.01"
              xmlns="http://www.w3.org/2000/svg"
              data-name="Layer 1"
            >
              <g>
                <title>Layer 1</title>
                <path
                  className={styles.εικόνα}
                  d="m157.3,2c-0.5,0 -11.7,10.9 -25,24.2l-21.05,21.05c-1.79,1.79 -4.7,1.79 -6.49,0l-22.05,-22.05l-23.96999,-23.86c-0.86,-0.86 -2.02,-1.34 -3.24,-1.34l-26.51,0c-4.01,0 -6.09,4.8 -3.35,7.73c0.18,0.2 0.35,0.38 0.53,0.57c0.06,0.05 0.11,0.1 0.17,0.16c0.08,0.07 0.13,0.16 0.2,0.24c0.16,0.17 0.33,0.35 0.49,0.52c0.11,0.09 0.23,0.18 0.32,0.29c0.06,0.08 0.12,0.16 0.18,0.24c0,0 0,0.01 0.01,0.02c0.05,0.06 0.1,0.11 0.15,0.16c0.06,0.06 0.13,0.11 0.19,0.17c0.08,0.07 0.14,0.15 0.19,0.24c0.26,0.28 0.52,0.56 0.77,0.83c0.15,0.16 0.31,0.33 0.46,0.49c0.1,0.09 0.19,0.19 0.29,0.29c0.1,0.09 0.19,0.2 0.27,0.31c0.25,0.26 0.5,0.54 0.76,0.81c0.08,0.08 0.15,0.17 0.23,0.24c0,0 0,0 0,0.01c0.13,0.14 0.26,0.28 0.39,0.42c0,0 0.01,0.01 0.02,0.02c0.08,0.08 0.16,0.16 0.23,0.23c0.07,0.07 0.15,0.14 0.22,0.22c0.06,0.06 0.11,0.13 0.16,0.2c0,0 0,0 0,0c0.42,0.45 0.85,0.9 1.29,1.37c0.02,0.02 0.04,0.03 0.07,0.05c0,0 0,0 0,0c0,0 0.01,0.01 0.02,0.02c0,0 0,0 0,0c0,0 0,0 0,0c0.03,0.04 0.06,0.08 0.09,0.12c1.65,1.75 3.44,3.66 5.37,5.7c0.03,0.03 0.06,0.06 0.09,0.09c6.69,7.11 15.01,15.95 24.67,26.22l41.25,41.25c1.79,1.78999 4.7,1.78999 6.49,0l6.05,-6.05c5.1,-5 9.6,-9.2 10,-9.2c0.3,0 0.8,14.5 0.89999,32.2l0.25999,27.84c0.02,2.48 2.02,4.5 4.5,4.55l10.34,0.20998l10.01001,0.20001c2.56999,0.04999 4.69,-2.01999 4.69,-4.59001l0,-63.91c0,-37.7 -0.3,-68.5 -0.70001,-68.5l0.04001,0.02l0,0.00001z"
                  fill="#00fcfd"
                  id="svg_1"
                />
                <path
                  className={styles.εικόνα}
                  d="m76,124.5l-13.15,13.14999c-0.86,0.86 -2.03,1.35001 -3.25,1.35001l-55.01,0c-2.54,0 -4.59,-2.06 -4.59,-4.59l0,-15.91l0.17,-9.39l0,0c4.08,-0.04 8.15,-0.07 12.23,-0.11l16.8,0c9.2,0 16.8,-0.3 16.8,-0.8c0,-0.39999 -10.3,-11.1 -23,-23.7l-21.65,-21.66c-0.86,-0.86 -1.35,-2.03 -1.35,-3.25l0,-17.7c0,-10.8 0.3,-19.9 0.7,-20.3c0.4,-0.4 20.8,19.4 45.3,43.9l41.25,41.25c1.79,1.79 1.79,4.7 0,6.49001l-11.25,11.25l0,0.02l0,-0.00001z"
                  fill="#00fcfd"
                  id="svg_2"
                />
              </g>
            </svg>
          </div>
          <div className={styles['logo-from-1024px']}>
            <svg
              width="340.92"
              height="300"
              xmlns="http://www.w3.org/2000/svg"
              data-name="Υπόβαθρο Λογότυπου"
            >
              <g>
                <title>Λογότυπο</title>
                <path
                  d="m339.5,4.32c-1.07999,0 -25.25,23.53 -53.95999,52.23l-45.43001,45.43c-3.86,3.85999 -10.14,3.85999 -14.00999,0l-47.59001,-47.59l-51.73,-51.5c-1.86,-1.86 -4.36,-2.89 -6.99,-2.89l-57.22,0c-8.65,0 -13.14,10.36 -7.23,16.68c0.39,0.43 0.76,0.82 1.14,1.23c0.13,0.11 0.24,0.22 0.37,0.35c0.17,0.15 0.28,0.35 0.43,0.52c0.35,0.37 0.71,0.76 1.06,1.12c0.24,0.19 0.5,0.39 0.69,0.63c0.13,0.17 0.26,0.35 0.39,0.52c0,0 0,0.02 0.02,0.04c0.11,0.13 0.22,0.24 0.32,0.35c0.13,0.13 0.28,0.24 0.41,0.37c0.17,0.15 0.3,0.32 0.41,0.52c0.56,0.6 1.12,1.21 1.66,1.79c0.32,0.35 0.67,0.71 0.99,1.06c0.22,0.19 0.41,0.41 0.63,0.63c0.22,0.19 0.41,0.43 0.58,0.67c0.54,0.56 1.07999,1.17 1.64,1.75c0.17,0.17 0.32,0.37 0.5,0.52l0,0.02c0.28,0.3 0.56,0.6 0.84,0.91l0.04,0.04l0.5,0.5c0.15,0.15 0.32,0.3 0.47,0.47c0.13,0.13 0.24,0.28 0.35,0.43l0,0c0.91,0.97 1.83,1.94 2.78,2.96c0.04,0.04 0.09,0.06 0.15,0.11l0,0s0.02,0.02 0.04,0.04l0,0c0.06,0.09 0.13,0.17 0.19,0.26c3.56,3.78 7.42,7.9 11.59,12.3c0.06,0.06 0.13,0.13 0.19,0.19c14.44,15.35 32.4,34.42 53.24001,56.59l89.03,89.03001c3.86,3.86 10.14,3.86 14.00999,0l13.06,-13.06001c11.01001,-10.78999 20.72,-19.86 21.58002,-19.86c0.64999,0 1.72998,31.29001 1.93997,69.5l0.56003,60.09c0.03998,5.35001 4.35999,9.71002 9.70999,9.82001l22.32001,0.45001l21.59998,0.42999c5.55002,0.10999 10.12003,-4.36002 10.12003,-9.91l0,-137.94c0,-81.37 -0.65002,-147.83999 -1.51001,-147.83999l0.09,0.04l0,0l0.03,0z"
                  className={styles.εικόνα}
                  data-name="svg 1"
                  id="svg_1"
                />
                <path
                  d="m164.03,268.70999l-28.38,28.38c-1.86,1.85999 -4.37999,2.91 -7.00999,2.91l-118.73,0c-5.48,0 -9.91,-4.45001 -9.91,-9.91l0,-34.34001l0.37,-20.26999l0,0c8.81,-0.09001 17.59,-0.15001 26.4,-0.24001l36.26,0c19.86,0 36.26,-0.64999 36.26,-1.73c0,-0.86 -22.23,-23.96001 -49.64,-51.15001l-46.74,-46.72998c-1.85,-1.86 -2.91,-4.39 -2.91,-7.02l0,-38.2c0,-23.31001 0.65,-42.95 1.51,-43.81001c0.86,-0.86 44.89,41.87 97.77,94.75001l89.03,89.03c3.86,3.86 3.86,10.14 0,14.00999l-24.28001,24.28001l0,0.03998l0,0l0.00002,0z"
                  className={styles.εικόνα}
                  data-name="svg 2"
                  id="svg_2"
                />
              </g>
            </svg>
          </div>
        </Link>
      </div>
    </section>
  );
};

export default Hero;
