import styles from '@/components/Χρονολόγιο/ΣτοιχείαΧρονολογίου.module.css';

const ΒασικάΣτοιχείαΓεγονότος = ({
  γεγονόςΣεΜονόΑριθμό = { γεγονόςΣεΜονόΑριθμό },
  μεΉΧωρίςΔευτερεύουσαΓραμμή,
  children,
}) => {
  const περιττόΉΆρτιοΓεγονός = γεγονόςΣεΜονόΑριθμό
    ? 'βασικές-πληροφορίες-περιττού-γεγονότος'
    : 'βασικές-πληροφορίες-άρτιου-γεγονότος';

  return (
    <div
      className={
        styles[`${περιττόΉΆρτιοΓεγονός}`] +
        ' ' +
        styles[`${μεΉΧωρίςΔευτερεύουσαΓραμμή}`]
      }
    >
      {children}
    </div>
  );
};

export default ΒασικάΣτοιχείαΓεγονότος;
