import styles from '@/components/Χρονολόγιο/ΣτοιχείαΧρονολογίου.module.css';

const ΒασικάΣτοιχείαΓεγονότος = ({
  γεγονόςΣεΜονόΑριθμό = { γεγονόςΣεΜονόΑριθμό },
  μεΉΧωρίςΔευτερεύουσαΓραμμή,
  children,
}) => {
  const μονόςΖυγόςΔευτερεύουσαΓραμμή = γεγονόςΣεΜονόΑριθμό
    ? 'event-odd'
    : 'event-even';

  return (
    <div
      className={
        styles[`${μονόςΖυγόςΔευτερεύουσαΓραμμή}`] +
        ' ' +
        styles[`${μεΉΧωρίςΔευτερεύουσαΓραμμή}`]
      }
    >
      {children}
    </div>
  );
};

export default ΒασικάΣτοιχείαΓεγονότος;
