import styles from '@/components/Χρονολόγιο/ΣτοιχείαΧρονολογίου.module.css';

import ΠεριεχόμενοΓεγονότος from '@/components/Χρονολόγιο/ΠεριεχόμενοΓεγονότος';
import ΤελείαΓεγονότος from '@/components/Χρονολόγιο/ΤελείαΓεγονότος';

const Γεγονός = ({ στιγμή, γεγονόςΣεΠεριττόΑριθμό }) => {

  // Η κλάση είτε να αλλάξει σε 'περιττό-γεγονός΄ ή 'άρτιο-γεγονός', είτε να προστεθούν αυτά εδώ
  return (
    <article className={styles['γεγονός-χρονολογίου'] + ' ' + styles[`${γεγονόςΣεΠεριττόΑριθμό ? 'περιττού-αριθμού' : 'άρτιου-αριθμού'}`]}> 
      <ΤελείαΓεγονότος />
      <ΠεριεχόμενοΓεγονότος
        στιγμή={στιγμή}
        γεγονόςΣεΠεριττόΑριθμό={γεγονόςΣεΠεριττόΑριθμό}
      />  
    </article> 
  );
};

export default Γεγονός;
