import styles from '@/components/Χρονολόγιο/ΣτοιχείαΧρονολογίου.module.css';

import ΠεριεχόμενοΓεγονότος from '@/components/Χρονολόγιο/ΠεριεχόμενοΓεγονότος';
import ΤελείαΓεγονότος from '@/components/Χρονολόγιο/ΤελείαΓεγονότος';

const Γεγονός = ({ στιγμή, γεγονόςΣεΜονόΑριθμό }) => {

  return (
    <article className={styles['γεγονός-χρονολογίου']}>
      <ΤελείαΓεγονότος />
      <ΠεριεχόμενοΓεγονότος
        στιγμή={στιγμή}
        γεγονόςΣεΜονόΑριθμό={γεγονόςΣεΜονόΑριθμό}
      />
    </article>
  );
};

export default Γεγονός;
