import ΠληροφορίεςΔευτερεύουσαςΓραμμής from '@/components/Χρονολόγιο/ΠληροφορίεςΔευτερεύουσαςΓραμμής';

const ΔευτερεύουσαΓραμμή = ({
  στιγμή,
  γεγονόςΣεΠεριττόΑριθμό,
  μεΉΧωρίςΔευτερεύουσαΓραμμή,
  χρώμαΕίδους,
}) => {
  return (
    μεΉΧωρίςΔευτερεύουσαΓραμμή === 'με-δευτερεύουσα-γραμμή2' && (
      <ΠληροφορίεςΔευτερεύουσαςΓραμμής
        στιγμή={στιγμή}
        γεγονόςΣεΠεριττόΑριθμό={γεγονόςΣεΠεριττόΑριθμό}
        χρώμαΕίδους={χρώμαΕίδους}
      />
    )
  );
};

export default ΔευτερεύουσαΓραμμή;
