import ΠληροφορίεςΔευτερεύουσαςΓραμμής from '@/components/Χρονολόγιο/ΠληροφορίεςΔευτερεύουσαςΓραμμής';

const ΔευτερεύουσαΓραμμή = ({
  στιγμή,
  γεγονόςΣεΜονόΑριθμό,
  μεΉΧωρίςΔευτερεύουσαΓραμμή,
  χρώμαΕίδους,
}) => {
  return (
    μεΉΧωρίςΔευτερεύουσαΓραμμή === 'με-δευτερεύουσα-γραμμή' && (
      <ΠληροφορίεςΔευτερεύουσαςΓραμμής
        στιγμή={στιγμή}
        γεγονόςΣεΜονόΑριθμό={γεγονόςΣεΜονόΑριθμό}
        χρώμαΕίδους={χρώμαΕίδους}
      />
    )
  );
};

export default ΔευτερεύουσαΓραμμή;
