import styles from '@/components/Χρονολόγιο/ΣτοιχείαΧρονολογίου.module.css';

import ΤίτλοςΓεγονότος from '@/components/Χρονολόγιο/ΤίτλοςΓεγονότος';
import ΒασικάΣτοιχείαΓεγονότος from '@/components/Χρονολόγιο/ΒασικάΣτοιχείαΓεγονότος';
import ΔευτερεύουσαΓραμμή from '@/components/Χρονολόγιο/ΔευτερεύουσαΓραμμή';
import ΧρονικέςΠληροφορίες from '@/components/Χρονολόγιο/ΧρονικέςΠληροφορίες';

const ΕπάνωΓραμμή = ({
  στιγμή,
  γεγονόςΣεΠεριττόΑριθμό,
  μεΉΧωρίςΔευτερεύουσαΓραμμή,
}) => {
  const { γεγονός } = στιγμή;

  const { είδος } = γεγονός;

  const μονόςΖυγόςΠάνωΓραμμή = γεγονόςΣεΠεριττόΑριθμό
    ? 'περιττή-επάνω-γραμμή-χρονολογίου'
    : 'άρτια-επάνω-γραμμή-χρονολογίου';

  const χρώμαΕίδους =
    είδος === 'Σπουδές'
      ? '-orange'
      : είδος === 'Εργασία'
        ? '-gold'
        : είδος === 'Έργα'
          ? '-tirquaz'
          : '-normal';

  return (
    <div className={styles[`${μονόςΖυγόςΠάνωΓραμμή}`]}>
      <div
        className={
          styles['χρονικές-πληροφορίες'] + ' ' + styles[`color${χρώμαΕίδους}`]
        }
      >
        <ΧρονικέςΠληροφορίες
          στιγμή={στιγμή}
          γεγονόςΣεΠεριττόΑριθμό={γεγονόςΣεΠεριττόΑριθμό}
        />
      </div>
      <ΒασικάΣτοιχείαΓεγονότος
        στιγμή={στιγμή}
        γεγονόςΣεΠεριττόΑριθμό={γεγονόςΣεΠεριττόΑριθμό}
        μεΉΧωρίςΔευτερεύουσαΓραμμή={μεΉΧωρίςΔευτερεύουσαΓραμμή}
      >
        <ΤίτλοςΓεγονότος στιγμή={στιγμή} />
        <ΔευτερεύουσαΓραμμή
          στιγμή={στιγμή}
          γεγονόςΣεΠεριττόΑριθμό={γεγονόςΣεΠεριττόΑριθμό}
          μεΉΧωρίςΔευτερεύουσαΓραμμή={μεΉΧωρίςΔευτερεύουσαΓραμμή}
          χρώμαΕίδους={χρώμαΕίδους}
        />
      </ΒασικάΣτοιχείαΓεγονότος>
    </div>
  );
};

export default ΕπάνωΓραμμή;
