import styles from '@/components/Χρονολόγιο/ΣτοιχείαΧρονολογίου.module.css';

import Μετάφραση from '../Μετάφραση';

const ΚείμενοΓεγονότος = ({ στιγμή, γεγονόςΣεΜονόΑριθμό }) => {
  const { κείμενο } = στιγμή;

  return κείμενο !== '' && γεγονόςΣεΜονόΑριθμό ? (
    <p
      className={
        styles['γεγονός-μονού-αριθμού'] + ' ' + styles['κείμενο-γεγονότος']
      }
    >
      <Μετάφραση>{κείμενο}</Μετάφραση>
    </p>
  ) : (
    <p
      className={
        styles['γεγονός-ζυγού-αριθμού'] + ' ' + styles['κείμενο-γεγονότος']
      }
    >
      <Μετάφραση>{κείμενο}</Μετάφραση>
    </p>
  );
};

export default ΚείμενοΓεγονότος;
