import styles from '@/components/Χρονολόγιο/ΣτοιχείαΧρονολογίου.module.css';

import ΕπάνωΓραμμή from '@/components/Χρονολόγιο/ΕπάνωΓραμμή';
import ΠλαϊνάΕικονίδια from '@/components/Χρονολόγιο/ΠλαϊνάΕικονίδια';
import ΚείμενοΓεγονότος from '@/components/Χρονολόγιο/ΚείμενοΓεγονότος';
import ΤεχνολογίεςΓεγονότος from '@/components/Χρονολόγιο/ΤεχνολογίεςΓεγονότος';
import ΠερίβλημαΓεγονότος from '@/components/Χρονολόγιο/ΠερίβλημαΓεγονότος';

import { στοιχείαΗμερομηνιών } from '@/utils/στοιχείαΗμερομηνιών';

const ΠεριεχόμενοΓεγονότος = ({ στιγμή, γεγονόςΣεΜονόΑριθμό }) => {
  const { γεγονός, οντότητα, κείμενο } = στιγμή;

  const { είδος, έναρξη, λήξη, ολοκλήρωση } = γεγονός;
  const { όνομα, τύπος } = οντότητα;

  const { μελλοντικόΉΠαρελθοντικόΓεγονός } = στοιχείαΗμερομηνιών(έναρξη, λήξη);

  const μεΉΧωρίςΔευτερεύουσαΓραμμή =
    είδος === 'Έργα' && !όνομα
      ? 'χωρίςΔευτερεύουσαΓραμμή'
      : είδος === 'Έργα' && !τύπος
      ? 'χωρίςΔευτερεύουσαΓραμμή'
      : 'μεΔευτερεύουσαΓραμμή';

  const μορφήΠεριβλήματος =
    μελλοντικόΉΠαρελθοντικόΓεγονός === 'Μελλοντικό' && κείμενο
      ? 'εν-αναμονή-με-κείμενο'
      : μελλοντικόΉΠαρελθοντικόΓεγονός === 'Μελλοντικό' && !κείμενο
      ? 'εν-αναμονή-χωρίς-κείμενο'
      : !ολοκλήρωση && κείμενο
      ? 'παρατημένο-με-κείμενο'
      : !ολοκλήρωση && !κείμενο
      ? 'παρατημένο-χωρίς-κείμενο'
      : λήξη === '' && κείμενο
      ? 'εν-εξελίξει-με-κείμενο'
      : λήξη === '' && !κείμενο
      ? 'εν-εξελίξει-χωρίς-κείμενο'
      : ολοκλήρωση && !κείμενο
      ? 'ολοκληρωμένο-χωρίς-κείμενο'
      : 'ολοκληρωμένο-με-κείμενο';

  return (
    <ΠερίβλημαΓεγονότος
      μεΉΧωρίςΔευτερεύουσαΓραμμή={μεΉΧωρίςΔευτερεύουσαΓραμμή}
      μορφήΠεριβλήματος={μορφήΠεριβλήματος}
    >
      <ΕπάνωΓραμμή
        στιγμή={στιγμή}
        γεγονόςΣεΜονόΑριθμό={γεγονόςΣεΜονόΑριθμό}
        μεΉΧωρίςΔευτερεύουσαΓραμμή={μεΉΧωρίςΔευτερεύουσαΓραμμή}
      />
      <ΚείμενοΓεγονότος στιγμή={στιγμή} γεγονόςΣεΜονόΑριθμό={γεγονόςΣεΜονόΑριθμό}/>
      <ΠλαϊνάΕικονίδια στιγμή={στιγμή} γεγονόςΣεΜονόΑριθμό={γεγονόςΣεΜονόΑριθμό}/>
      <ΤεχνολογίεςΓεγονότος στιγμή={στιγμή} />
    </ΠερίβλημαΓεγονότος>
  );
};

export default ΠεριεχόμενοΓεγονότος;
