import ΕπάνωΓραμμή from '@/components/Χρονολόγιο/ΕπάνωΓραμμή';
import ΚείμενοΓεγονότος from '@/components/Χρονολόγιο/ΚείμενοΓεγονότος';
import ΠερίβλημαΓεγονότος from '@/components/Χρονολόγιο/ΠερίβλημαΓεγονότος';
// import ΣχετιζόμεναΈργα from '@/components/Χρονολόγιο/ΣχετιζόμεναΈργα';
import ΠλαϊνάΕικονίδια from '@/components/Χρονολόγιο/ΠλαϊνάΕικονίδια';
import ΤεχνολογίεςΓεγονότος from '@/components/Χρονολόγιο/ΤεχνολογίεςΓεγονότος';

import { στοιχείαΗμερομηνιών } from '@/utils/στοιχείαΗμερομηνιών';

const ΠεριεχόμενοΓεγονότος = ({ στιγμή, γεγονόςΣεΠεριττόΑριθμό }) => {
  const { γεγονός, οντότητα, κείμενο, τεχνολογίες } = στιγμή;

  const { είδος, έναρξη, λήξη, φάσεις, ολοκλήρωση } = γεγονός;
  const { όνομα, τύπος } = οντότητα;

  const { μελλοντικόΉΠαρελθοντικόΓεγονός } = στοιχείαΗμερομηνιών(έναρξη, λήξη);

  const κατάστασηΓεγονότος =
    μελλοντικόΉΠαρελθοντικόΓεγονός === 'Μελλοντικό'
      ? 'Εν αναμονή'
      : !ολοκλήρωση
        ? 'Παρατημένο'
        : λήξη === ''
          ? 'Εν εξελίξει'
          : ολοκλήρωση && 'Ολοκληρωμένο';

  const μεΉΧωρίςΔευτερεύουσαΓραμμή =
    όνομα || τύπος || φάσεις.length > 0 ? 'με-δευτερεύουσα-γραμμή' : 'χωρίς-δευτερεύουσα-γραμμή';

  const μεΉΧωρίςΚείμενο = κείμενο ? 'με-κείμενο' : 'χωρίς-κείμενο';

  const μεΉΧωρίςΤεχνολογίες = τεχνολογίες.length !== 0 ? 'με-τεχνολογίες' : 'χωρίς-τεχνολογίες';

  const μορφήΠεριβλήματος =
    κατάστασηΓεγονότος === 'Εν αναμονή'
      ? 'εν-αναμονή'
      : κατάστασηΓεγονότος === 'Παρατημένο'
        ? 'παρατημένο'
        : κατάστασηΓεγονότος === 'Εν εξελίξει'
          ? 'εν-εξελίξει'
          : 'ολοκληρωμένο';

  return (
    <ΠερίβλημαΓεγονότος
      μεΉΧωρίςΔευτερεύουσαΓραμμή={μεΉΧωρίςΔευτερεύουσαΓραμμή}
      μεΉΧωρίςΚείμενο={μεΉΧωρίςΚείμενο}
      μεΉΧωρίςΤεχνολογίες={μεΉΧωρίςΤεχνολογίες}
      μορφήΠεριβλήματος={μορφήΠεριβλήματος}
    >
      <ΕπάνωΓραμμή
        στιγμή={στιγμή}
        γεγονόςΣεΠεριττόΑριθμό={γεγονόςΣεΠεριττόΑριθμό}
        μεΉΧωρίςΔευτερεύουσαΓραμμή={μεΉΧωρίςΔευτερεύουσαΓραμμή}
        μεΉΧωρίςΚείμενο={μεΉΧωρίςΚείμενο}
      />
      <ΚείμενοΓεγονότος
        στιγμή={στιγμή}
        γεγονόςΣεΠεριττόΑριθμό={γεγονόςΣεΠεριττόΑριθμό}
      />
      {/* <ΣχετιζόμεναΈργα /> */}
      <ΠλαϊνάΕικονίδια
        στιγμή={στιγμή}
        γεγονόςΣεΠεριττόΑριθμό={γεγονόςΣεΠεριττόΑριθμό}
        κατάστασηΓεγονότος={κατάστασηΓεγονότος}
      />
      <ΤεχνολογίεςΓεγονότος στιγμή={στιγμή} />
    </ΠερίβλημαΓεγονότος>
  );
};

export default ΠεριεχόμενοΓεγονότος;
