'use client';

import styles from '@/components/Χρονολόγιο/ΣτοιχείαΧρονολογίου.module.css';

import { useAppContext } from '@/context/AppContext';

const EventContainer = ({
  φανερόΉΚρυφό,
  μεΉΧωρίςΔευτερεύουσαΓραμμή,
  μεΉΧωρίςΚείμενο,
  μεΉΧωρίςΤεχνολογίες,
  μορφήΠεριβλήματος,
  children,
}) => {
  const { showEventColors, μορφήΣτοιχείων, φέγγοςΟρίων, φέγγοςΣτοιχείων } = useAppContext();

  const μόνιμαΧρώματαΉΠροσωρινά = showEventColors ? 'μεΜόνιμαΧρώματα' : '';

  return (
    <div
      className={
        styles['περιεχόμενο-γεγονότος'] +
        ' ' +
        styles[`${φανερόΉΚρυφό === 'κρυφό' ? 'κρυφό' : ''}`] +
        ' ' +
        styles[
          `${μορφήΣτοιχείων === 'υαλομορφισμός' ? 'με-υαλομορφισμό' : μορφήΣτοιχείων === 'ημιδιαφανή στοιχεία' ? 'με-ημιδιαφανή-στοιχεία' : μορφήΣτοιχείων === 'αδιαφανή στοιχεία' ? 'με-αδιαφανή-στοιχεία' : ''}`
        ] +
        ' ' +
        styles[`${φέγγοςΟρίων === true ? 'με-φέγγος-ορίων' : ''}`] +
        ' ' +
        styles[`${φέγγοςΣτοιχείων === true ? 'με-φέγγος-στοιχείων' : ''}`] +
        ' ' +
        styles[`${μεΉΧωρίςΔευτερεύουσαΓραμμή}`] +
        ' ' +
        styles[`${μεΉΧωρίςΚείμενο}`] +
        ' ' +
        styles[`${μεΉΧωρίςΤεχνολογίες}`] +
        ' ' +
        styles[`${μορφήΠεριβλήματος}`] +
        ' ' +
        styles[`${μόνιμαΧρώματαΉΠροσωρινά}`]
      }
    >
      {children}
    </div>
  );
};

export default EventContainer;
