import styles from '@/components/Χρονολόγιο/ΣτοιχείαΧρονολογίου.module.css';
import Μετάφραση from '@/components/Μετάφραση';

const ΠληροφορίεςΦάσηςΈργου = ({ πλήθοςΦάσεωνΈργου, τίτλοςΦάσηςΈργου }) => {
  return (
    <h6 className={styles[`φάση-έργου`]}>
      <div className={styles[`περιέκτης-κειμένου-φάσης-έργου`]}>
        <Μετάφραση>{`${πλήθοςΦάσεωνΈργου}η`}</Μετάφραση>
        <pre> </pre>
        <Μετάφραση>Φάση</Μετάφραση>
        <pre>{' - '}</pre>
        <Μετάφραση>{`${τίτλοςΦάσηςΈργου}`}</Μετάφραση>
      </div>
    </h6>
  );
};

export default ΠληροφορίεςΦάσηςΈργου;
