'use client';

import styles from '@/components/Χρονολόγιο/ΣτοιχείαΧρονολογίου.module.css';

import TranslatedText from '@/components/TranslatedText';
import ΠληροφορίεςΟντότητας from '@/components/Χρονολόγιο/ΠληροφορίεςΟντότητας';
import ΠληροφορίεςΣπουδώνΈργουΉΕργασίας from '@/components/Χρονολόγιο/ΠληροφορίεςΣπουδώνΈργουΉΕργασίας';
import ΕνδιάμεσοΔιαχωριστικό from '@/components/Χρονολόγιο/ΕνδιάμεσοΔιαχωριστικό';

import { RiHomeOfficeLine } from 'react-icons/ri';
import { HiOutlineBuildingOffice2 } from 'react-icons/hi2';
import { FaSchoolFlag } from 'react-icons/fa6';

import { useAppContext } from '@/context/AppContext';
import { μετάφραση } from '@/utils/μετάφραση';

const ΠληροφορίεςΔευτερεύουσαςΓραμμής = ({
  στιγμή,
  γεγονόςΣεΜονόΑριθμό,
  χρώμαΕίδους,
}) => {
  const { language } = useAppContext();

  const { γεγονός, οντότητα, σπουδές, εργασία, τοποθεσία } = στιγμή;

  const { είδος } = γεγονός;
  const { όνομα, τύπος, ιστότοποςΟντότητας } = οντότητα;

  const { τύποςΣπουδών, ιστότοποςΣπουδών } = σπουδές;

  const { τομέαςΕργασίας } = εργασία;

  const κείμενοΔεδομένωνΟντότητας =
    είδος === 'Σπουδές' || είδος === 'Εργασία' || είδος === 'Έργα'
      ? όνομα
      : null;

  const τύποςΔεδομένωνΟντότητας =
    είδος === 'Σπουδές' || είδος === 'Εργασία' || είδος === 'Έργα'
      ? τύπος
      : null;

  const τύποςΔεδομένωνΣπουδώνΈργουΉΕργασίας =
    είδος === 'Σπουδές' || είδος === 'Εργασία' || είδος === 'Έργα'
      ? τοποθεσία && τοποθεσία
      : null;

  const κείμενοΔεδομένωνΣπουδώνΈργουΉΕργασίας =
    είδος === 'Σπουδές'
      ? τύποςΣπουδών && τύποςΣπουδών
      : είδος === 'Εργασία'
        ? τομέαςΕργασίας && τομέαςΕργασίας
        : είδος === 'Έργα'
          ? τύποςΣπουδών && τύποςΣπουδών
          : null;

  return γεγονόςΣεΜονόΑριθμό ? (
    <>
      {/* <div
        className={styles['περιέκτης-εικονιδίων']}
        data-types-icon={μετάφραση(τοποθεσία, language)}
      >
        {τοποθεσία === 'Απομακρυσμένα' ? (
          <RiHomeOfficeLine
            className={styles['εικονίδιο-δευτερεύουσας-γραμμής']}
          />
        ) : τοποθεσία === 'Δια ζώσης' && είδος === 'Εργασία' ? (
          <HiOutlineBuildingOffice2
            className={styles['εικονίδιο-δευτερεύουσας-γραμμής']}
          />
        ) : τοποθεσία === 'Δια ζώσης' && είδος === 'Σπουδές' ? (
          <FaSchoolFlag className={styles['εικονίδιο-δευτερεύουσας-γραμμής']} />
        ) : null}
      </div>
            <ΕνδιάμεσοΔιαχωριστικό
        παράμετροςΕμφάνισης={κείμενοΔεδομένωνΣπουδώνΈργουΉΕργασίας}
        διαχωριστικό={`   `} */}

      <ΠληροφορίεςΣπουδώνΈργουΉΕργασίας
        ιστότοποςΣπουδών={ιστότοποςΣπουδών}
        χρώμαΕίδους={χρώμαΕίδους}
        κείμενοΔεδομένωνΣπουδώνΈργουΉΕργασίας={μετάφραση(
          κείμενοΔεδομένωνΣπουδώνΈργουΉΕργασίας,
          language
        )}
        τύποςΔεδομένωνΣπουδώνΈργουΉΕργασίας={μετάφραση(
          τύποςΔεδομένωνΣπουδώνΈργουΉΕργασίας,
          language
        )}
      />
      <ΕνδιάμεσοΔιαχωριστικό
        παράμετροςΕμφάνισης={κείμενοΔεδομένωνΣπουδώνΈργουΉΕργασίας}
        διαχωριστικό={` | `}
      />
      <ΠληροφορίεςΟντότητας
        είδος={είδος}
        ιστότοποςΟντότητας={ιστότοποςΟντότητας}
        χρώμαΕίδους={χρώμαΕίδους}
        κείμενοΔεδομένωνΟντότητας={μετάφραση(
          κείμενοΔεδομένωνΟντότητας,
          language
        )}
        τύποςΔεδομένωνΟντότητας={μετάφραση(τύποςΔεδομένωνΟντότητας, language)}
      />
    </>
  ) : (
    <>
      <ΠληροφορίεςΟντότητας
        είδος={είδος}
        ιστότοποςΟντότητας={ιστότοποςΟντότητας}
        χρώμαΕίδους={χρώμαΕίδους}
        κείμενοΔεδομένωνΟντότητας={μετάφραση(
          κείμενοΔεδομένωνΟντότητας,
          language
        )}
        τύποςΔεδομένωνΟντότητας={μετάφραση(τύποςΔεδομένωνΟντότητας, language)}
      />
      <ΕνδιάμεσοΔιαχωριστικό
        παράμετροςΕμφάνισης={κείμενοΔεδομένωνΣπουδώνΈργουΉΕργασίας}
        διαχωριστικό={` | `}
      />
      <ΠληροφορίεςΣπουδώνΈργουΉΕργασίας
        ιστότοποςΣπουδών={ιστότοποςΣπουδών}
        χρώμαΕίδους={χρώμαΕίδους}
        κείμενοΔεδομένωνΣπουδώνΈργουΉΕργασίας={μετάφραση(
          κείμενοΔεδομένωνΣπουδώνΈργουΉΕργασίας,
          language
        )}
        τύποςΔεδομένωνΣπουδώνΈργουΉΕργασίας={μετάφραση(
          τύποςΔεδομένωνΣπουδώνΈργουΉΕργασίας,
          language
        )}
      />

      {/* <ΕνδιάμεσοΔιαχωριστικό
        παράμετροςΕμφάνισης={κείμενοΔεδομένωνΣπουδώνΈργουΉΕργασίας}
        διαχωριστικό={`   `}
      />
      <div
        className={styles['περιέκτης-εικονιδίων']}
        data-types-icon={μετάφραση(τοποθεσία, language)}
      >
        {τοποθεσία === 'Απομακρυσμένα' ? (
          <RiHomeOfficeLine
            className={styles['εικονίδιο-δευτερεύουσας-γραμμής']}
          />
        ) : τοποθεσία === 'Δια ζώσης' && είδος === 'Εργασία' ? (
          <HiOutlineBuildingOffice2
            className={styles['εικονίδιο-δευτερεύουσας-γραμμής']}
          />
        ) : τοποθεσία === 'Δια ζώσης' && είδος === 'Σπουδές' ? (
          <FaSchoolFlag className={styles['εικονίδιο-δευτερεύουσας-γραμμής']} />
        ) : null}
      </div> */}
    </>
  );
};

export default ΠληροφορίεςΔευτερεύουσαςΓραμμής;
