'use client';

import styles from '@/components/Χρονολόγιο/ΣτοιχείαΧρονολογίου.module.css';

import ΠληροφορίεςΟντότητας from '@/components/Χρονολόγιο/ΠληροφορίεςΟντότητας';
import ΠληροφορίεςΦάσηςΈργου from '@/components/Χρονολόγιο/ΠληροφορίεςΦάσηςΈργου';
import ΠληροφορίεςΣπουδώνΈργουΉΕργασίας from '@/components/Χρονολόγιο/ΠληροφορίεςΣπουδώνΈργουΉΕργασίας';
import ΕικονίδιαΔευτερεύουσαςΓραμμής from '@/components/Χρονολόγιο/ΕικονίδιαΔευτερεύουσαςΓραμμής';
import ΕνδιάμεσοΔιαχωριστικό from '@/components/Χρονολόγιο/ΕνδιάμεσοΔιαχωριστικό';

import { useAppContext } from '@/context/AppContext';
import { μετάφραση } from '@/utils/μετάφραση';

const SecondaryLineInfo = ({ στιγμή, γεγονόςΣεΜονόΑριθμό, χρώμαΕίδους }) => {
  const { language } = useAppContext();

  const { γεγονός, οντότητα, σπουδές, εργασία, τοποθεσία } = στιγμή;

  const { είδος, φάσεις } = γεγονός;

  const { όνομα, τύπος, ιστότοποςΟντότητας } = οντότητα;

  const { τύποςΣπουδών, ιστότοποςΣπουδών } = σπουδές;

  const { τομέαςΕργασίας } = εργασία;

  const πλήθοςΦάσεωνΈργου = φάσεις.length;

  const τίτλοςΦάσηςΈργου =
    πλήθοςΦάσεωνΈργου > 0 && φάσεις[φάσεις.length - 1].τίτλοςΦάσης;

  const κείμενοΔεδομένωνΟντότητας =
    είδος === 'Σπουδές' || είδος === 'Εργασία' || είδος === 'Έργα'
      ? όνομα
      : null;

  const τύποςΔεδομένωνΟντότητας =
    είδος === 'Σπουδές' || είδος === 'Εργασία' || είδος === 'Έργα'
      ? τύπος
      : null;

  const τύποςΔεδομένωνΣπουδώνΈργουΉΕργασίας =
    είδος === 'Σπουδές' || είδος === 'Εργασία' || είδος === 'Έργα'
      ? τοποθεσία && τοποθεσία
      : null;

  const κείμενοΔεδομένωνΣπουδώνΈργουΉΕργασίας =
    είδος === 'Σπουδές'
      ? τύποςΣπουδών && τύποςΣπουδών
      : είδος === 'Εργασία'
        ? τομέαςΕργασίας && τομέαςΕργασίας
        : είδος === 'Έργα'
          ? τύποςΣπουδών && τύποςΣπουδών
          : null;

  const περιττήΉΆρτιαΔευτερεύουσαΓραμμή = γεγονόςΣεΜονόΑριθμό
    ? 'περιττή'
    : 'άρτια';

  return (
    <div
      className={
        styles['πληροφορίες-δευτερεύουσας-γραμμής'] +
        ' ' +
        styles[`${περιττήΉΆρτιαΔευτερεύουσαΓραμμή}`]
      }
    >
      {πλήθοςΦάσεωνΈργου > 0 ? (
        <ΠληροφορίεςΦάσηςΈργου
          πλήθοςΦάσεωνΈργου={πλήθοςΦάσεωνΈργου}
          τίτλοςΦάσηςΈργου={τίτλοςΦάσηςΈργου}
        />
      ) : (
        <>
          <ΠληροφορίεςΣπουδώνΈργουΉΕργασίας
            ιστότοποςΣπουδών={ιστότοποςΣπουδών}
            χρώμαΕίδους={χρώμαΕίδους}
            κείμενοΔεδομένωνΣπουδώνΈργουΉΕργασίας={μετάφραση(
              κείμενοΔεδομένωνΣπουδώνΈργουΉΕργασίας,
              language
            )}
            τύποςΔεδομένωνΣπουδώνΈργουΉΕργασίας={μετάφραση(
              τύποςΔεδομένωνΣπουδώνΈργουΉΕργασίας,
              language
            )}
          />
          <ΕνδιάμεσοΔιαχωριστικό
            παράμετροςΕμφάνισης={κείμενοΔεδομένωνΣπουδώνΈργουΉΕργασίας}
            διαχωριστικό={` | `}
          />
          <ΠληροφορίεςΟντότητας
            είδος={είδος}
            ιστότοποςΟντότητας={ιστότοποςΟντότητας}
            χρώμαΕίδους={χρώμαΕίδους}
            κείμενοΔεδομένωνΟντότητας={μετάφραση(
              κείμενοΔεδομένωνΟντότητας,
              language
            )}
            τύποςΔεδομένωνΟντότητας={μετάφραση(
              τύποςΔεδομένωνΟντότητας,
              language
            )}
          />{' '}
          <ΕνδιάμεσοΔιαχωριστικό
            παράμετροςΕμφάνισης={κείμενοΔεδομένωνΣπουδώνΈργουΉΕργασίας}
            διαχωριστικό={`   `}
          />
          <ΕικονίδιαΔευτερεύουσαςΓραμμής είδος={είδος} τοποθεσία={τοποθεσία} />
        </>
      )}
    </div>
  );
};

export default SecondaryLineInfo;
