import styles from '@/components/Χρονολόγιο/ΣτοιχείαΧρονολογίου.module.css';

const ΠληροφορίεςΣπουδώνΈργουΉΕργασίας = ({
  ιστότοποςΣπουδών,
  χρώμαΕίδους,
  κείμενοΔεδομένωνΣπουδώνΈργουΉΕργασίας,
  // τύποςΔεδομένωνΣπουδώνΈργουΉΕργασίας,
}) => {
  return ιστότοποςΣπουδών ? (
    <a
      target="_blank"
      href={ιστότοποςΣπουδών}
      rel="noopener noreferrer"
      className={styles['σύνδεσμος-σπουδών']}
    >
      <h6
        // data-types-sec={μετάφραση(τύποςΔεδομένωνΣπουδώνΈργουΉΕργασίας, language)}
        className={styles[`σπουδές`] + ' ' + styles[`σπουδές${χρώμαΕίδους}`]}
      >
        {κείμενοΔεδομένωνΣπουδώνΈργουΉΕργασίας}
      </h6>
    </a>
  ) : (
    <h6
      // data-types-sec={μετάφραση(τύποςΔεδομένωνΣπουδώνΈργουΉΕργασίας, language)}
      className={styles[`σπουδές`] + ' ' + styles[`σπουδές${χρώμαΕίδους}`]}
    >
      {κείμενοΔεδομένωνΣπουδώνΈργουΉΕργασίας}
    </h6>
  );
};

export default ΠληροφορίεςΣπουδώνΈργουΉΕργασίας;
