import styles from '@/components/Χρονολόγιο/ΣτοιχείαΧρονολογίου.module.css';

import ΔιάρκειαΓεγονότος from '@/components/Χρονολόγιο/ΔιάρκειαΓεγονότος';
import ΜήναςΓεγονότος from './ΜήναςΓεγονότος';

import { στοιχείαΗμερομηνιών } from '@/utils/στοιχείαΗμερομηνιών';

const ΧρονικέςΠληροφορίες = ({ στιγμή, γεγονόςΣεΜονόΑριθμό }) => {
  const { γεγονός } = στιγμή;

  const { έναρξη, λήξη } = γεγονός;

  const {
    μήναςΈναρξης,
    χρονολογίαΈναρξης,
    αριθμόςΗμερώνΕβδομάδωνΜηνώνΕτών,
    ημέρεςΕβδομάδεςΜήνεςΈτη,
  } = στοιχείαΗμερομηνιών(έναρξη, λήξη);

  const κείμενοΗμερομηνίαςΓεγονότος = γεγονόςΣεΜονόΑριθμό ? (
    μήναςΈναρξης ? (
      <>
        <div className={styles['έτος-γεγονότος-χρονολογίου']}>{χρονολογίαΈναρξης}</div>
        <div className={styles['περιττός-μήνας-γεγονότος-χρονολογίου']}>
          <ΜήναςΓεγονότος έναρξη={έναρξη} />
        </div>
      </>
    ) : (
      <div className={styles['έτος-γεγονότος-χρονολογίου']}>{χρονολογίαΈναρξης}</div>
    )
  ) : μήναςΈναρξης ? (
    <>
      <div className={styles['έτος-γεγονότος-χρονολογίου']}>{χρονολογίαΈναρξης}</div>
      <div className={styles['άρτιος-μήνας-γεγονότος-χρονολογίου']}>
        <ΜήναςΓεγονότος έναρξη={έναρξη} />
      </div>
    </>
  ) : (
    <div className={styles['έτος-γεγονότος-χρονολογίου']}>{χρονολογίαΈναρξης}</div>
  );

  return (
    <>
      <div className={styles['ημερομηνία-γεγονότος']}>{κείμενοΗμερομηνίαςΓεγονότος}</div>
      <ΔιάρκειαΓεγονότος
        στιγμή={στιγμή}
        αριθμόςΗμερώνΕβδομάδωνΜηνώνΕτών={αριθμόςΗμερώνΕβδομάδωνΜηνώνΕτών}
        ημέρεςΕβδομάδεςΜήνεςΈτη={ημέρεςΕβδομάδεςΜήνεςΈτη}
      />
    </>
  );
};

export default ΧρονικέςΠληροφορίες;
