export const έννοιες = [
  { ελληνικά: '1η', αγγλικά: '1st', σουηδικά: '1:a' },
  { ελληνικά: '2η', αγγλικά: '2nd', σουηδικά: '2:a' },
  { ελληνικά: '3η', αγγλικά: '3rd', σουηδικά: '3:a' },
  { ελληνικά: '4η', αγγλικά: '4th', σουηδικά: '4:a' },
  { ελληνικά: '5η', αγγλικά: '5th', σουηδικά: '5:a' },
  { ελληνικά: '', αγγλικά: '', σουηδικά: '' },
  { ελληνικά: 'el', αγγλικά: 'en', σουηδικά: 'swe' },
  { ελληνικά: 'gr', αγγλικά: 'uk', σουηδικά: 'se' },
  { ελληνικά: 'Β', αγγλικά: 'W', σουηδικά: 'V' },
  { ελληνικά: 'Βδομάδα', αγγλικά: 'Week', σουηδικά: 'Vecka' },
  { ελληνικά: 'Εβδομάδα', αγγλικά: 'Week', σουηδικά: 'Vecka' },
  { ελληνικά: 'Βδομάδες', αγγλικά: 'Weeks', σουηδικά: 'Veckor' },
  { ελληνικά: 'Εβδομάδες', αγγλικά: 'Weeks', σουηδικά: 'Veckor' },
  { ελληνικά: 'Ε', αγγλικά: 'Y', σουηδικά: 'Å' },
  { ελληνικά: 'Έτος', αγγλικά: 'Year', σουηδικά: 'År' },
  { ελληνικά: 'Έτος', αγγλικά: 'Years', σουηδικά: 'År' },
  { ελληνικά: 'Η', αγγλικά: 'D', σουηδικά: 'D' },
  { ελληνικά: 'Ημέρα', αγγλικά: 'Day', σουηδικά: 'Dag' },
  { ελληνικά: 'Ημέρες', αγγλικά: 'Days', σουηδικά: 'Dagar' },
  { ελληνικά: 'Μ', αγγλικά: 'M', σουηδικά: 'M' },
  { ελληνικά: 'Μήνας', αγγλικά: 'Month', σουηδικά: 'Månad' },
  { ελληνικά: 'Μήνες', αγγλικά: 'Months', σουηδικά: 'Månader' },
  { ελληνικά: 'Έργα', αγγλικά: 'Projects', σουηδικά: 'Projekt' },
  { ελληνικά: 'Ίσως', αγγλικά: 'Maybe', σουηδικά: 'Kanske' },
  { ελληνικά: 'Όλα', αγγλικά: 'All', σουηδικά: 'Allt' },
  { ελληνικά: 'Όνομα', αγγλικά: 'Name', σουηδικά: 'Namn' },
  { ελληνικά: 'Όχι', αγγλικά: 'No', σουηδικά: 'Nej' },
  // Α //
  { ελληνικά: 'Α -> Ω', αγγλικά: 'A -> Z', σουηδικά: 'A -> Ö' },
  { ελληνικά: 'Αδιαφάνεια:', αγγλικά: 'Opacity:', σουηδικά: 'Opacitet:' },
  { ελληνικά: 'Αιτήσεις', αγγλικά: 'Applications', σουηδικά: 'Applikationer' },
  {
    ελληνικά:
      'Ακόμη πιο συγκεκριμένα όσον αφορά την μετάφραση ιδιαίτερη έμφαση έχει δοθεί στην πολυγλωσσική υποστήριξη, με ένα προσαρμοσμένο σύστημα μετάφρασης που αναπτύχθηκε εκ του μηδενός, εξασφαλίζοντας άψογη λειτουργία χωρίς εξάρτηση από εξωτερικές υπηρεσίες.',
    αγγλικά:
      'Even more specifically, regarding translation, special emphasis has been placed on multilingual support, with a customized translation system developed from scratch, ensuring flawless operation without dependence on external services.',
    σουηδικά:
      'Ännu mer specifikt, när det gäller översättning, har särskild vikt lagts vid flerspråkigt stöd, med ett anpassat översättningssystem som utvecklats från grunden, vilket säkerställer felfri drift utan beroende av externa tjänster.',
  },
  { ελληνικά: 'Αλλαγή', αγγλικά: 'Edit', σουηδικά: 'Redigera' },
  {
    ελληνικά: 'Αλλαγή Γραφήματος',
    αγγλικά: 'Change Chart',
    σουηδικά: 'Ändra Diagram',
  },

  {
    ελληνικά: 'Ανάπτυξη αποκρισιμότητας ιστοτόπου',
    αγγλικά: 'Website responsive development',
    σουηδικά: 'Responsiv utveckling av webbplatser',
  },
  {
    ελληνικά: 'Ανάπτυξη Εφαρμογών',
    αγγλικά: 'Application Development',
    σουηδικά: 'Applikationsutveckling',
  },
  {
    ελληνικά: 'Αλλαγή εμφάνισης πλήκτρου δυναμικού υποβάθρου',
    αγγλικά: 'Change the appearance of the dynamic background button',
    σουηδικά: 'Ändra dynamisk bakgrundsknappvisning',
  },
  {
    ελληνικά: 'Αλλαγή χρώματος υποβάθρου του δυναμικού υποβάθρου',
    αγγλικά: 'Change background color of dynamic background',
    σουηδικά: 'Ändra bakgrundsfärgen för den dynamiska bakgrunden',
  },
  {
    ελληνικά: 'Ανάπτυξη Ιστού',
    αγγλικά: 'Web Development',
    σουηδικά: 'Webbutveckling',
  },
  {
    ελληνικά: 'Ανάπτυξη κώδικα φίλτρων',
    αγγλικά: 'Filter code development',
    σουηδικά: 'Utveckla filterkod',
  },
  { ελληνικά: 'Αναζήτηση', αγγλικά: 'Search', σουηδικά: 'Sök' },
  { ελληνικά: 'Παρατημένα', αγγλικά: 'Abandoned', σουηδικά: 'Övergiven' },
  {
    ελληνικά: 'Ανώτατο Εκπαιδευτικό Ίδρυμα',
    αγγλικά: 'Higher Educational Institution',
    σουηδικά: 'Högre Läroanstalt',
  },
  { ελληνικά: 'Αξιολόγηση', αγγλικά: 'Assessment', σουηδικά: 'Bedömning' },
  { ελληνικά: 'Αποθήκευση', αγγλικά: 'Submit', σουηδικά: 'Skicka In' },
  {
    ελληνικά: 'Αποθήκευση Αλλαγών',
    αγγλικά: 'Save Changes',
    σουηδικά: 'Spara Ändringar',
  },
  {
    ελληνικά: 'Αποκρινόμενος σχεδιασμός',
    αγγλικά: 'Responsive design',
    σουηδικά: 'Responsiv design',
  },
  { ελληνικά: 'Απομακρυσμένα', αγγλικά: 'Remotely', σουηδικά: 'Avlägset' },
  { ελληνικά: 'Απομακρυσμένη', αγγλικά: 'Remote', σουηδικά: 'Avlägsen' },
  { ελληνικά: 'Απορρίφθηκαν', αγγλικά: 'Rejected', σουηδικά: 'Avvisade' },
  { ελληνικά: 'Απορρίφθηκε', αγγλικά: 'Rejected', σουηδικά: 'Avvisade' },
  {
    ελληνικά: 'Αποστολή Μηνύματος',
    αγγλικά: 'Send Message',
    σουηδικά: 'Skicka Meddelande',
  },
  {
    ελληνικά: 'Αποτυχία Αυθεντικοποίησης',
    αγγλικά: 'Authentication Failure',
    σουηδικά: 'Misslyckad autentisering',
  },
  {
    ελληνικά: 'Αρ. Τηλεφώνου',
    αγγλικά: 'Ph. Number',
    σουηδικά: 'Telefonnummer',
  },
  {
    ελληνικά: 'Αριθμός Τηλεφώνου',
    αγγλικά: 'Phone Number',
    σουηδικά: 'Telefonnummer',
  },
  {
    ελληνικά: 'Αριθμός Τηλεφώνου (για iMessage, Viber, WhatsApp κ.λπ)',
    αγγλικά: 'Phone Number (for iMessage, Viber, WhatsApp etc)',
    σουηδικά: 'Telefonnummer (för iMessage, Viber, WhatsApp, etc)',
  },
  { ελληνικά: 'Αρχική Σελίδα', αγγλικά: 'Home Page', σουηδικά: 'Hemsida' },
  {
    ελληνικά: 'Ας μιλήσουμε',
    αγγλικά: "Let's talk",
    σουηδικά: 'Låt oss prata',
  },
  {
    ελληνικά:
      'Αυτό έγινε προσπάθεια να επιτευχθεί μέσω μιας εξαιρετικής εμπειρίας χρήστη και την βέλτιστη απόδοση. Για παράδειγμα ένα από αυτά που ξεχωρίζουν στον ιστότοπο είναι η πλήρως δυναμική του φύση. Κάθε στοιχείο, από το διαδραστικό χρονολόγιο μέχρι και την μετάφραση και του μικρότερου κειμένου, δημιουργείται δυναμικά από προσεκτικά σχεδιασμένες βάσεις δεδομένων.',
    αγγλικά:
      'This was attempted to be achieved through an excellent user experience and optimal performance. For example, one of the things that stands out about the site is its fully dynamic nature. Every element, from the interactive timeline to the translation of even the smallest text, is dynamically generated from carefully designed databases.',
    σουηδικά:
      'Detta försökte uppnås genom en utmärkt användarupplevelse och optimal prestanda. Till exempel är en av de saker som sticker ut med webbplatsen dess helt dynamiska natur. Varje element, från den interaktiva tidslinjen till översättningen av även den minsta text, genereras dynamiskt från noggrant utformade databaser.',
  },
  {
    ελληνικά: 'Αυτοκινητοβιομηχανία',
    αγγλικά: 'Automotive Industry',
    σουηδικά: 'Bilindustrin',
  },
  // Β //
  { ελληνικά: 'Βάση Δεδομένων', αγγλικά: 'Database', σουηδικά: 'Databas' },
  // Γ //
  { ελληνικά: 'για', αγγλικά: 'for', σουηδικά: 'för' },
  {
    ελληνικά:
      ' Για προσανατολισμό τοπίου, συνιστάται η περιήγηση σε συσκευή με μεγαλύτερη οθόνη.',
    αγγλικά:
      'For landscape orientation, it is recommended to browse on a device with a larger screen.',
    σουηδικά:
      'För landskapsorientering rekommenderas det att surfa på en enhet med en större skärm.',
  },
  { ελληνικά: 'Γλώσσα', αγγλικά: 'Language', σουηδικά: 'Språk' },
  { ελληνικά: 'Γλώσσα:', αγγλικά: 'Language:', σουηδικά: 'Språk:' },
  {
    ελληνικά: 'Γράφημα Περιοχής',
    αγγλικά: 'Area Chart',
    σουηδικά: 'Områdesdiagram',
  },
  {
    ελληνικά: 'Γράψτε το μήνυμά σας στα ελληνικά.',
    αγγλικά: 'Write your message in greek or in english.',
    σουηδικά: 'Skriv ditt meddelande på grekiska eller engelska.',
  },
  { ελληνικά: 'Γραφείο', αγγλικά: 'Office', σουηδικά: 'Kontor' },
  // Δ //
  {
    ελληνικά: 'Δείξε μου περισσότερα',
    αγγλικά: 'Show me more',
    σουηδικά: 'Visa mig mer',
  },
  {
    ελληνικά: 'Δελφικά Παραγγέλματα API',
    αγγλικά: 'Delphic Maxims API',
    σουηδικά: 'Delphic Maxims API',
  },
  {
    ελληνικά: 'Δελφικά Παραγγέλματα API (Ενημέρωση)',
    αγγλικά: 'Delphic Maxims API (Update)',
    σουηδικά: 'Delphic Maxims API (Uppdatering)',
  },
  {
    ελληνικά: 'Δελφικό Παράγγελμα της Ημέρας',
    αγγλικά: 'Delphic Maxim of the Day',
    σουηδικά: 'Delphic Maxim av Dagen',
  },
  {
    ελληνικά: 'Δεν βρέθηκαν εργασίες...',
    αγγλικά: 'No jobs found...',
    σουηδικά: 'Inga jobb hittades...',
  },
  {
    ελληνικά: 'Δεν είσαι μέλος; ',
    αγγλικά: 'Not a member? ',
    σουηδικά: 'Inte en medlem? ',
  },
  {
    ελληνικά: 'Δεν επιτρέπονται οι αλλαγές στην «Λειτουργία Επίδειξης».',
    αγγλικά: 'Changes are not allowed in «Demo Mode».',
    σουηδικά: 'Ändringar är inte tillåtna i «Demoläge».',
  },
  {
    ελληνικά: 'Δευτεροβάθμια Εκπαίδευση',
    αγγλικά: 'Secondary Education',
    σουηδικά: 'Gymnasieutbildning',
  },
  {
    ελληνικά: 'Δημήτρης Μανωλόπουλος',
    αγγλικά: 'Dimitris Manolopoulos',
    σουηδικά: 'Dimitris Manolopoulos',
  },
  {
    ελληνικά: 'Δημιουργία Λογότυπου',
    αγγλικά: 'Logo Creation',
    σουηδικά: 'Skapa En Logotyp',
  },
  {
    ελληνικά: 'Δημιουργία πλήκτρου μόνιμης εμφάνισης χρωμάτων',
    αγγλικά: 'Create a color permanent display button',
    σουηδικά: 'Skapa en permanent färgdisplaynyckel',
  },
  {
    ελληνικά: 'Δημιουργία σελίδας «Συχνές Ερωτήσεις»',
    αγγλικά: 'Create "FAQ" page',
    σουηδικά: 'Skapa sidan "FAQ"',
  },
  {
    ελληνικά: 'Δημιουργία σελίδας «Ρυθμίσεις»',
    αγγλικά: 'Create "Settings" page',
    σουηδικά: 'Skapa sidan "Inställningar"',
  },
  {
    ελληνικά: 'Δημιουργία σελίδας «Σχετικά με τον Ιστότοπο»',
    αγγλικά: 'Create "About the Website" page',
    σουηδικά: 'Skapa sidan "Om Webbplatsen"',
  },
  { ελληνικά: 'Διαγραφή', αγγλικά: 'Delete', σουηδικά: 'Radera' },
  { ελληνικά: 'Δοκιμής', αγγλικά: 'Test', σουηδικά: 'Testa' },
  {
    ελληνικά: 'Διαδικτυακή Βιβλιοθήκη Εκμάθησης',
    αγγλικά: 'Online Learning Library',
    σουηδικά: 'Online Lärande Bibliotek',
  },
  {
    ελληνικά: 'Διαδικτυακό Φροντιστήριο',
    αγγλικά: 'Online Tutorial',
    σουηδικά: 'Handledning Online',
  },
  { ελληνικά: 'Δια ζώσης', αγγλικά: 'In person', σουηδικά: 'För livet' },
  { ελληνικά: 'Δυναμική', αγγλικά: 'Dynamic', σουηδικά: 'Dynamisk' },
  { ελληνικά: 'Δυναμικό', αγγλικά: 'Dynamic', σουηδικά: 'Dynamisk' },
  {
    ελληνικά: 'Δυναμικό υπόβαθρο:',
    αγγλικά: 'Dynamic background:',
    σουηδικά: 'Dynamisk bakgrund:',
  },
  // Ε //
  {
    ελληνικά:
      'Εάν χρησιμοποιείτε συσκευή τύπου iPad και το μήνυμα συνεχίζει να εμφανίζεται δοκιμάστε να την στρέψετε στο πλάι σε οριζόντιο προσανατολισμό.',
    αγγλικά:
      'If you are using an iPad-type device and the message continues to appear, try turning it sideways in landscape orientation.',
    σουηδικά:
      'Om du använder en iPad-enhet och meddelandet fortsätter att visas, försök att vända det åt sidan i liggande riktning.',
  },
  {
    ελληνικά: 'Εάν έχετε κάποιαν ερώτηση παρακαλώ επικοινωνήστε μαζί μου.',
    αγγλικά: 'If you have any questions please contact me.',
    σουηδικά: 'Om du har några frågor, vänligen kontakta mig.',
  },
  { ελληνικά: 'Έξοδος', αγγλικά: 'Logout', σουηδικά: 'Logga ut' },
  {
    ελληνικά: 'Έλλειψη εξουσιοδότησης για  πρόσβαση σε αυτήν τη διαδρομή',
    αγγλικά: 'Lack of authorization to access this path',
    σουηδικά: 'Avsaknad av behörighet att komma åt den här sökvägen',
  },
  { ελληνικά: 'ΕΠΙΣΤΡΟΦΗ', αγγλικά: 'RETURN', σουηδικά: 'LÄMNA TILLBAKA' },
  {
    ελληνικά:
      'Είμαι ένας νεαρός Πλήρους-Εύρους Προγραμματιστής Ιστού με προσήλωση στην εξέλιξη και στόχο την βέλτιστη λύση.',
    αγγλικά:
      'I am a junior Full-Stack Web Developer with a commitment to evolution and a constant aim for the best solution.',
    σουηδικά:
      'Jag är en junior Full-Stack Webbutvecklare med ett stort engagemang för utveckling och som strävar efter den bästa lösningen.',
  },
  {
    ελληνικά: 'Ένας ιστότοπος που μπορείς να παίξεις τύμπανα και κρουστά.',
    αγγλικά: 'A website where you can play drums and percussion.',
    σουηδικά: 'En webbplats där du kan spela trummor och slagverk.',
  },
  {
    ελληνικά: 'Εισαγωγή στα Νεότερα Εργαλεία ΤΝ',
    αγγλικά: 'Introduction to the Latest AI Tools',
    σουηδικά: 'Introduktion till de Senaste AI-Verktygen',
  },
  {
    ελληνικά: 'Είσαι ήδη μέλος; ',
    αγγλικά: 'Already a member? ',
    σουηδικά: 'Redan medlem? ',
  },
  { ελληνικά: 'Είσοδος', αγγλικά: 'Login', σουηδικά: 'Logga In' },
  { ελληνικά: 'Εγγράψου.', αγγλικά: 'Register.', σουηδικά: 'Registrera' },
  { ελληνικά: 'Εγγραφή', αγγλικά: 'Register', σουηδικά: 'Registrera' },
  { ελληνικά: 'Εγκρίθηκαν', αγγλικά: 'Approved', σουηδικά: 'Godkänd' },
  { ελληνικά: 'Εγκρίθηκε', αγγλικά: 'Approved', σουηδικά: 'Godkänd' },
  { ελληνικά: 'Είμαι', αγγλικά: "I'm", σουηδικά: 'Jag är' },
  { ελληνικά: 'Εκκαθάριση', αγγλικά: 'Clear', σουηδικά: 'Klar' },
  { ελληνικά: 'Εκκρεμεί', αγγλικά: 'Pending', σουηδικά: 'I Väntan På' },
  { ελληνικά: 'Εκκρεμούν', αγγλικά: 'Pending', σουηδικά: 'I Väntan På' },
  {
    ελληνικά:
      'Εκπαίδευσε το εσωτερικό σου ωρολόι για να συγχρονιστεί με τον πραγματικό χρόνο.',
    αγγλικά: 'Train your internal clock to synchronize with real time.',
    σουηδικά: 'Träna din interna klocka att synkronisera med realtid.',
  },
  { ελληνικά: 'Εν αναμονή', αγγλικά: 'Pending', σουηδικά: 'I Väntan På' },
  { ελληνικά: 'Εν εξελίξει', αγγλικά: 'In progress', σουηδικά: 'Pågår' },
  {
    ελληνικά: 'Ενεργοποίηση εμφάνισης πιστοποιητικών',
    αγγλικά: 'Enable display of certificates',
    σουηδικά: 'Aktivera visning av certifikat',
  },
  {
    ελληνικά: 'Ενεργοποίηση πλήκτρου «Επικοινωνία»',
    αγγλικά: 'Activate "Contact" button',
    σουηδικά: 'Aktivera knappen "Kontakt"',
  },
  {
    ελληνικά: 'Ενεργοποίηση πλήκτρου «Πρόσληψη»',
    αγγλικά: 'Activate the "Hire Me" button',
    σουηδικά: 'Aktivera knappen "Anställ Mig"',
  },
  {
    ελληνικά: 'Ενεργοποίηση Φόρμας Επικοινωνίας',
    αγγλικά: 'Contact Form Activation',
    σουηδικά: 'Aktivering av Kontaktformulär',
  },
  {
    ελληνικά:
      'Ενημέρωση του API για την υποστήριξη νέων λειτουργιών και βελτιώσεων και αλλαγή σε NextJS με χρήση ΤΝ.',
    αγγλικά:
      'Update the API to support new features and improvements while switching it to NextJS using AI.',
    σουηδικά:
      'Uppdatera API:et för att stödja nya funktioner och förbättringar och byta till NextJS med hjälp av AI.',
  },
  {
    ελληνικά: 'Επίδειξη Εφαρμογής',
    αγγλικά: 'Application Demo',
    σουηδικά: 'Applikationsdemo',
  },
  {
    ελληνικά: 'Επεξεργασία Εργασίας',
    αγγλικά: 'Edit Job',
    σουηδικά: 'Redigera Jobb',
  },
  {
    ελληνικά: 'Επιδιόρθωση προβλήματος "CORS"',
    αγγλικά: 'Fix "CORS" problem',
    σουηδικά: 'Fixa "CORS"-problemet',
  },
  {
    ελληνικά: 'Επιδιόρθωση τρεμοπαίγματος σε safari',
    αγγλικά: 'Fix flickering in safari',
    σουηδικά: 'Åtgärda flimmer i safari',
  },
  { ελληνικά: 'Επικοινωνία', αγγλικά: 'Contact', σουηδικά: 'Kontakt' },
  {
    ελληνικά: 'Επιτυχής Έξοδος Χρήστη!',
    αγγλικά: 'User Logout Successful!',
    σουηδικά: 'Utloggning av användare lyckades!',
  },
  {
    ελληνικά: 'Επιτυχής Είσοδος! Ανακατεύθυνση...',
    αγγλικά: 'Login Successful! Redirect...',
    σουηδικά: 'Inloggningen lyckades! Dirigera om...',
  },
  {
    ελληνικά: 'Επιτυχής διαγραφή εργασίας!',
    αγγλικά: 'Job deleted successfully!',
    σουηδικά: 'Jobb raderades!',
  },
  {
    ελληνικά: 'Επιφύλαξη Παντός Δικαιώματος',
    αγγλικά: 'All Rights Reserved',
    σουηδικά: 'Med Ensamrätt',
  },
  { ελληνικά: 'Επόμενη', αγγλικά: 'Next', σουηδικά: 'Νästa' },
  {
    ελληνικά: 'Επιμονή κατάστασης',
    αγγλικά: 'State persistence',
    σουηδικά: 'Statlig uthållighet',
  },
  {
    ελληνικά: 'Επιστροφή στην αρχική σελίδα',
    αγγλικά: 'Return to home page',
    σουηδικά: 'Återgå till hemsidan',
  },
  { ελληνικά: 'Επώνυμο', αγγλικά: 'Surname', σουηδικά: 'Efternamn' },
  { ελληνικά: 'Εργασία', αγγλικά: 'Job', σουηδικά: 'Jobb' },
  { ελληνικά: 'Εργασίες', αγγλικά: 'Jobs', σουηδικά: 'Jobb' },
  {
    ελληνικά: 'Εργασιομανία',
    αγγλικά: 'Ergasiomania',
    σουηδικά: 'Ergasiomania',
  },
  {
    ελληνικά: 'Εσωτερικό Ωρολόι',
    αγγλικά: 'Internal Clock',
    σουηδικά: 'Intern klocka',
  },
  { ελληνικά: 'Εταιρεία', αγγλικά: 'Company', σουηδικά: 'Företag' },
  {
    ελληνικά: 'Εταιρεία Εκπαίδευσης Προγραμματιστών',
    αγγλικά: 'Developer Training Company',
    σουηδικά: 'Utbildningsföretag för Utvecklare',
  },
  {
    ελληνικά: 'Εφαρμογή αποκρισιμότητας ιστοτόπου',
    αγγλικά: 'Website responsive application',
    σουηδικά: 'Tillämpning av webbplatsens responsivitet',
  },
  {
    ελληνικά: 'Εφαρμογή Υαλομορφισμού',
    αγγλικά: 'Glassmorphism Application',
    σουηδικά: 'Tillämpning av Glasmorfism',
  },
  {
    ελληνικά: 'Έχω άλλη ερώτηση',
    αγγλικά: 'I have another question',
    σουηδικά: 'Jag har en annan fråga',
  },
  {
    ελληνικά: 'Έχω ερώτηση',
    αγγλικά: 'I have a question',
    σουηδικά: 'Jag har en fråga',
  },
  // Ζ //
  // Η //
  {
    ελληνικά:
      'Η ανάπτυξη συνεχίζεται και σταδιακά προστίθεται αποκρισιμότητα και για μικρότερες οθόνες. Ορισμένες σελίδες θα εμφανίζουν αυτό το μήνυμα μέχρι το πέρας τους, καθώς η προσαρμογή για κινητές συσκευές δεν αποτελεί άμεση προτεραιότητα.',
    αγγλικά:
      'Development is ongoing and responsiveness for smaller screens is gradually being added. Some pages will display this message until they are completed, as adaptation for mobile devices is not an immediate priority.',
    σουηδικά:
      'Utvecklingen fortsätter och lyhördhet för mindre skärmar tillkommer successivt. Vissa sidor kommer att visa detta meddelande tills de är klara, eftersom mobilvänlighet inte är en omedelbar prioritet.',
  },
  {
    ελληνικά: 'Η Εργασία Ενημερώθηκε!',
    αγγλικά: 'Job Updated!',
    σουηδικά: 'Jobb uppdaterat!',
  },
  {
    ελληνικά: 'Η Εργασία Προστέθηκε!',
    αγγλικά: 'Job Added!',
    σουηδικά: 'Jobb tillagt!',
  },
  {
    ελληνικά: 'Η εργασία των ονείρων μου.',
    αγγλικά: 'My dream job.',
    σουηδικά: 'Mitt drömjobb.',
  },
  {
    ελληνικά: 'Η διαδρομή (route) δεν υπάρχει!',
    αγγλικά: 'The route does not exist!',
    σουηδικά: 'Rutten finns inte!',
  },
  {
    ελληνικά:
      'Η μετάβασή μου αυτή ξεκίνησε με έντονη διάθεση για μάθηση και δημιουργικότητα, οδηγώντας με σήμερα στη θέση του Νεαρού Πλήρους-Εύρους Προγραμματιστή (Junior Full-Stack Developer).',
    αγγλικά:
      'My transition began with a strong desire for learning and creativity, leading me today to the position of Junior Full-Stack Developer.',
    σουηδικά:
      'Min övergång började med en stark längtan efter lärande och kreativitet, vilket idag ledde mig till tjänsten som Junior Full-Stack Utvecklare.',
  },
  { ελληνικά: 'Η πόλη μου', αγγλικά: 'My city', σουηδικά: 'Min stad' },
  {
    ελληνικά: 'Η πρώτη μου επαφή με την «Υποβοηθούμενη Ανάπτυξη μέσω ΤΝ».',
    αγγλικά: 'My first contact with "AI-Assisted Development".',
    σουηδικά: 'Min första kontakt med "AI-Assisterad Utveckling".',
  },
  {
    ελληνικά: 'Η σελίδα δεν βρέθηκε',
    αγγλικά: 'Page not found',
    σουηδικά: 'Sidan hittades inte',
  },
  {
    ελληνικά: `Ηλεκτρονικό Κατάστημα «Αμαζόνες»`,
    αγγλικά: `"Amazones" Electronic Store`,
    σουηδικά: `"Amazones" elektroniska butik`,
  },
  {
    ελληνικά: 'Ηλεκτρονικό Ταχυδρομείο',
    αγγλικά: 'Electronic Mail',
    σουηδικά: 'Elektronisk Post',
  },
  { ελληνικά: 'Ηλ. Ταχυδρομείο', αγγλικά: 'E-Mail', σουηδικά: 'E-Post' },
  { ελληνικά: 'Ημιαπασχόληση', αγγλικά: 'Part-Time', σουηδικά: 'Deltid' },
  // Θ //
  { ελληνικά: 'Θέμα', αγγλικά: 'Subject', σουηδικά: 'Ämne' },
  {
    ελληνικά: 'Θέση Εργασίας',
    αγγλικά: 'Job Position',
    σουηδικά: 'Befattning',
  },
  {
    ελληνικά: 'Θετικών & Τεχνολογικών Επιστημών',
    αγγλικά: 'Sciences & Technology',
    σουηδικά: 'Positiva & Tekniska Vetenskaper',
  },
  // Ι //
  { ελληνικά: 'ΙΣΤΟΣ 3.0', αγγλικά: 'WEB 3.0', σουηδικά: 'WEB 3.0' },
  { ελληνικά: 'Ιστότοπο', αγγλικά: 'Website', σουηδικά: 'Webbplats' },
  // Κ //
  {
    ελληνικά: 'Καθαρισμός & τακτοποίηση του κώδικα',
    αγγλικά: 'Cleaning & tidying up the code',
    σουηδικά: 'Rengöring och ordning av koden',
  },
  {
    ελληνικά:
      'Καθώς το βασικό μου ακαδημαϊκό υπόβαθρο είναι στην Πολιτική Μηχανική, η πορεία μου χαρακτηρίζεται από διαρκή εξέλιξη και προσαρμοστικότητα.',
    αγγλικά:
      'As my main academic background is in Civil Engineering, my career path is characterized by constant evolution and adaptability.',
    σουηδικά:
      'Eftersom min huvudsakliga akademiska bakgrund är inom väg- och vattenbyggnad, kännetecknas min karriärväg av ständig utveckling och anpassningsförmåga.',
  },
  {
    ελληνικά:
      'Καλώς ήλθατε! Ονομάζομαι Δημήτρης, κατάγομαι από την υπέροχη και ιστορική Ελλάδα και επί του παρόντος ζω και δραστηριοποιούμαι στην Σουηδία.',
    αγγλικά:
      'Welcome! My name is Dimitris, I come from the wonderful and historic Greece and I currently live and work in Sweden.',
    σουηδικά:
      'Välkomna! Mitt namn är Dimitris, jag kommer från det underbara och historiska Grekland och jag bor och arbetar för närvarande i Sverige.',
  },
  {
    ελληνικά:
      'Καλωσορίσατε στον προσωπικό μου ιστότοπο, ένα έργο που αντικατοπτρίζει το πάθος μου για την ανάπτυξη σύγχρονων και καινοτόμων διαδικτυακών εφαρμογών.',
    αγγλικά:
      'Welcome to my personal website, a project that reflects my passion for developing modern and innovative web applications.',
    σουηδικά:
      'Välkommen till min personliga webbplats, ett projekt som återspeglar min passion för att utveckla moderna och innovativa webbapplikationer.',
  },
  {
    ελληνικά: 'Κάποιο λάθος προέκυψε',
    αγγλικά: 'An error occurred',
    σουηδικά: 'Ett fel uppstod',
  },
  {
    ελληνικά: 'Κάποιο λάθος προέκυψε κατά την αποστολή του μηνύματος',
    αγγλικά: 'An error occurred while sending your message',
    σουηδικά: 'Ett fel uppstod när meddelandet skickades.',
  },
  {
    ελληνικά: 'Καθαρισμός Φίλτρων',
    αγγλικά: 'Clear Filters',
    σουηδικά: 'Rensa Filter',
  },
  {
    ελληνικά:
      'Κατανοώ ότι θέλεις να μάθεις περισσότερα για εμένα (Και γιατί όχι; Είμαι πολύ ενδιαφέρον άτομο. 😏) αλλά η ανάπτυξη αυτού του μέρους είναι ακόμη σε βασικό επίπεδο. Προς το παρόν μπορείς να απολαύσεις την πορεία μου στην ανάπτυξη ιστού και σύντομα θα έρθουν κι άλλα.',
    αγγλικά:
      "I understand that you would like to know more about me (And why not? I'm a very interesting person. 😏) but the development of this part is still at a basic level. At the moment you can enjoy my journey in web development and more will come soon.",
    σουηδικά:
      'Jag förstår att du vill veta mer om mig (Och varför inte? Jag är en väldigt intressant person. 😏) men utvecklingen av denna del är fortfarande på en grundläggande nivå. För nu kan du njuta av min resa inom webbutveckling och mer kommer snart.',
  },
  {
    ελληνικά: 'Κατάσταση Αίτησης',
    αγγλικά: 'Application Status',
    σουηδικά: 'Ansökningsstatus',
  },
  { ελληνικά: 'Κενό', αγγλικά: 'Null', σουηδικά: 'Noll' },
  { ελληνικά: 'Κομμάτι', αγγλικά: 'Component', σουηδικά: 'Komponent' },
  { ελληνικά: 'Κολλέγιο DEI', αγγλικά: 'DEI College', σουηδικά: 'DEI College' },
  { ελληνικά: 'Κωδικός', αγγλικά: 'Password', σουηδικά: 'Lösenord' },
  // Λ //
  {
    ελληνικά: 'Λάθος στοιχεία.',
    αγγλικά: 'Wrong data.',
    σουηδικά: 'Fel data.',
  },
  { ελληνικά: 'Λειτουργία', αγγλικά: 'Function', σουηδικά: 'Funktion' },
  // Μ //
  { ελληνικά: 'Μάθε Περισσότερα', αγγλικά: 'Learn More', σουηδικά: 'Läs Mer' }, // Μεγάλα πρώτα γράμματα
  { ελληνικά: 'Μάθε περισσότερα', αγγλικά: 'Learn more', σουηδικά: 'Läs mer' }, // Μικρά πρώτα γράμματα
  {
    ελληνικά: 'Μάθετε περισσότερα για εμένα',
    αγγλικά: 'Learn more about me',
    σουηδικά: 'Läs mer om mig',
  },
  { ελληνικά: 'Μαρτυρίες', αγγλικά: 'Testimonials', σουηδικά: 'Vittnesmål' },
  { ελληνικά: 'με Εμένα', αγγλικά: 'Me', σουηδικά: 'Mig' },
  {
    ελληνικά: 'με Ιστότοπο',
    αγγλικά: 'this Website',
    σουηδικά: 'denna Webbplats',
  },
  { ελληνικά: 'Μετάφραση', αγγλικά: 'Translation', σουηδικά: 'Översättning' },
  {
    ελληνικά:
      'Μετά από μια εξίσου δύσκολη περίοδο αλλαγών, μεταξύ πόλεων της Αγγλίας και της Σουηδίας, κατέληξα στην Στοκχόλμη, όπου ζω τα τελευταία τρία χρόνια, και όπου αποφάσισα να αλλάξω επαγγελματική κατεύθυνση στον κόσμο της τεχνολογίας, καθότι ήταν και μεγάλη επιθυμία μου όπως και απώτερός μου στόχος.',
    αγγλικά:
      'After an equally difficult period of change, between cities in England and Sweden, I ended up in Stockholm, where I have been living for the last three years, and where I decided to change my professional direction to the world of technology, as it was both my great desire and my ultimate goal.',
    σουηδικά:
      'Efter en lika svår period av förändring, mellan städer i England och Sverige, hamnade jag i Stockholm, där jag har bott de senaste tre åren, och där jag bestämde mig för att byta yrkesinriktning till teknikens värld, eftersom det var både min stora önskan och mitt yttersta mål.',
  },
  {
    ελληνικά:
      'Μετά από προτάσεις βελτίωσης επισκεπτών γίνονται οι απαραίτητες αλλαγές στο χρονολόγιο. Οπότε προς το παρόν τα γεγονότα χρονολογίου είναι ορατά μόνο σε υπολογιστές. Σύντομα θα γίνουν προσβάσιμα και στις υπόλοιπες συσκευές. Ευχαριστώ για την κατανόηση.',
    αγγλικά:
      'After improvement suggestions from visitors, the necessary changes are being made to the timeline. So for now, timeline events are only visible on computers. They will soon be accessible on other devices. Thank you for your understanding.',
    σουηδικά:
      'Efter förslag till förbättringar från besökare görs nödvändiga ändringar i tidslinje. Så för närvarande är tidslinjehändelser endast synliga på stationära datorer. De kommer snart att finnas tillgängliga på andra enheter också. Tack för din förståelse.',
  },
  {
    ελληνικά:
      'Μετά από σπουδές στην Ελλάδα και την Αγγλία, ακολούθησε μια δύσκολη περίοδος ανεύρεσης εργασίας, στην υπό οικονομική κρίση χώρα μου, η οποία με οδήγησε να φύγω εκ νέου στο εξωτερικό.',
    αγγλικά:
      'After studying in Greece and England, a difficult period of finding work followed in my country, which was in economic crisis, which led me to go abroad again.',
    σουηδικά:
      'Efter studier i Grekland och England följde en svår period med att hitta arbete i mitt land, som befann sig i ekonomisk kris, vilket ledde till att jag åkte utomlands igen.',
  },
  {
    ελληνικά:
      'Με την πρώτη ευκαιρία που θα μου δοθεί μελλοντικά θέλω να ασχοληθώ με εφαρμογές ΙΣΤΟΥ 3.0 (WEB3).',
    αγγλικά:
      'At the first opportunity I get in the future, I want to work ον WEB3 applications.',
    σουηδικά:
      'Vid första tillfälle jag får i framtiden vill jag arbeta med WEB3-applikationer.',
  },
  {
    ελληνικά: 'Μηνιαία Δεδομένα',
    αγγλικά: 'Monthly Data',
    σουηδικά: 'Månadsdata',
  },
  {
    ελληνικά:
      'Μια υλοποίηση ενός ηλεκτρονικού καταστήματος εμπορίου μέσω δικτυακού εκπαιδευτικού βίντεο στο YT.',
    αγγλικά:
      'An implementation of an e-commerce store via online video tutorial on YT.',
    σουηδικά:
      'En implementering av en e-handelsbutik via onlinevideohandledning på YT.',
  },

  // Ν //
  { ελληνικά: 'Ναι', αγγλικά: 'Yes', σουηδικά: 'Ja' },
  { ελληνικά: 'Νεότερες', αγγλικά: 'Newest', σουηδικά: 'Nyaste' },
  // Ξ //
  // Ο //
  {
    ελληνικά:
      'Ο ιστότοπος αυτός δημιουργήθηκε για την επίδειξη των δεξιοτήτων μου στην ανάπτυξη ιστού, με αποτέλεσμα σύνθετα στοιχεία (όπως το «Χρονολόγιο») που αποδίδουν καλύτερα σε μεγαλύτερες οθόνες.',
    αγγλικά:
      'This website was created to showcase my web development skills, resulting in complex elements (like the "Timeline") that perform better on larger screens.',
    σουηδικά:
      'Den här webbplatsen skapades för att visa upp mina färdigheter i webbutveckling, vilket resulterade i komplexa element (som "Tidslinjen") som presterar bättre på större skärmar.',
  },
  {
    ελληνικά:
      'Ο ιστότοπος έχει σχεδιαστεί και αναπτυχθεί εξ ολοκλήρου από εμένα, χρησιμοποιώντας το πανίσχυρο πλαίσιο NextJS, με απώτερο στόχο την επίδειξη των ικανοτήτων μου με τον ευκολότερο και ταχύτερο δυνατό τρόπο.',
    αγγλικά:
      'The website has been designed and developed entirely by me, using the powerful NextJS framework, with the ultimate goal of demonstrating my skills in the easiest and fastest way possible.',
    σουηδικά:
      'Webbplatsen har designats och utvecklats helt av mig, med hjälp av det kraftfulla NextJS-ramverket, med det yttersta målet att visa mina färdigheter på det enklaste och snabbaste sättet.',
  },
  {
    ελληνικά:
      'Ο νέος μου προσωπικός ιστότοπος αναπτυγμένος εκ του μηδενός σε NextJS.',
    αγγλικά:
      'My new personal website developed completely from scratch in NextJS.',
    σουηδικά:
      'Min nya personliga webbplats utvecklades helt från grunden i NextJS.',
  },
  {
    ελληνικά:
      'Ο πρώτος μου ιστότοπος φτιαγμένος με βοηθητική ΤΝ ο οποίος εμφανίζει ένα νέο Δελφικό Παράγγελμα κάθε ημέρα.',
    αγγλικά:
      'My first website built with assistive AI that displays a new Delphic Maxim every day.',
    σουηδικά:
      'Min första webbplats byggdes med hjälp av assistiv AI som visar ett nytt Delphic Maxim varje dag.',
  },
  {
    ελληνικά: 'Ο Χρήστης Δημιουργήθηκε! Ανακατεύθυνση...',
    αγγλικά: 'User Created! Redirect...',
    σουηδικά: 'Användare skapad! Dirigera om...',
  },
  {
    ελληνικά: 'Οδηγός Ανάπτυξης Εφαρμογών iOS',
    αγγλικά: 'iOS Application Development Guide',
    σουηδικά: 'Utvecklingsguide för iOS-Appar',
  },
  {
    ελληνικά:
      'Οι προσεγγίσεις αυτές αποδεικνύουν όχι μόνο την τεχνική μου κατάρτιση, αλλά και την προσήλωσή μου στη δημιουργία εξατομικευμένων λύσεων που ανταποκρίνονται πλήρως στις ανάγκες του κάθε έργου. Αν αναζητάτε έναν συνεργάτη με βασικό του στόχο την συνεχή του εξέλιξη, ώστε να μπορεί να μετατρέψει το όραμά σας σε πραγματικότητα, είμαι εδώ για να συζητήσουμε το επόμενό σας έργο ή ιδέα.',
    αγγλικά:
      'These approaches demonstrate not only my technical training, but also my dedication to creating customized solutions that fully meet the needs of each project. If you are looking for a partner whose main goal is continuous development, so that he can turn your vision into reality, I am here to discuss your next project or idea.',
    σουηδικά:
      'Dessa tillvägagångssätt visar inte bara min tekniska utbildning, utan också mitt engagemang för att skapa skräddarsydda lösningar som helt uppfyller behoven i varje projekt. Om du letar efter en partner vars huvudmål är kontinuerlig utveckling, så att de kan förverkliga din vision, är jag här för att diskutera ditt nästa projekt eller din idé.',
  },
  { ελληνικά: 'Ολοκληρωμένα', αγγλικά: 'Completed', σουηδικά: 'Avslutad' },
  {
    ελληνικά:
      'Οργάνωσε το κυνήγι εργασίας σου με αυτήν την εφαρμογή ιχνηλάτησης.',
    αγγλικά: 'Organize your job hunt with this tracking app.',
    σουηδικά: 'Organisera din jobbjakt med denna spårningsapp.',
  },
  { ελληνικά: 'Οργάνωση', αγγλικά: 'Sort', σουηδικά: 'Sortera' },
  // Π //
  { ελληνικά: 'Παράδειγμα', αγγλικά: 'Example', σουηδικά: 'Exempel' },
  {
    ελληνικά:
      'Πάρα πολλά αιτήματα από αυτήν την διεύθυνση IP, δοκιμάστε ξανά μετά από 15 λεπτά.',
    αγγλικά:
      'Too many requests from this IP address, please try again in 15 minutes.',
    σουηδικά:
      'För många förfrågningar från denna IP-adress, försök igen om 15 minuter.',
  },
  { ελληνικά: 'Παλαιότερες', αγγλικά: 'Oldest', σουηδικά: 'Äldst' },
  {
    ελληνικά: 'Πανεπιστήμιο Κρήτης',
    αγγλικά: 'University of Crete',
    σουηδικά: 'Universitetet på Kreta',
  },
  {
    ελληνικά: 'Πανεπιστήμιο του Πόρτσμουθ',
    αγγλικά: 'University of Portsmouth',
    σουηδικά: 'Universitetet på Portsmouth',
  },
  {
    ελληνικά: 'Παρακαλώ Περιμένετε...',
    αγγλικά: 'Please Wait...',
    σουηδικά: 'Vänta Snäll...',
  },
  {
    ελληνικά:
      'Παράλληλα, στοχεύω να διευρύνω τις γνώσεις μου στην Τεχνητή Νοημοσύνη (TN) και στις τεχνολογίες WEB3, με στόχο να συμβαδίζω με τις τεχνολογικές εξελίξεις και να προσφέρω καινοτόμες λύσεις. Η πορεία μου αποτυπώνει το πάθος για συνεχή βελτίωση και την επιθυμία να συμβάλλω ενεργά στον σύγχρονο ψηφιακό κόσμο.',
    αγγλικά:
      'At the same time, I aim to expand my knowledge in Artificial Intelligence (AI) and WEB3 technologies, with the aim of keeping up with technological developments and offering innovative solutions. My path reflects the passion for continuous improvement and the desire to actively contribute to the modern digital world.',
    σουηδικά:
      'Samtidigt strävar jag efter att utöka mina kunskaper inom Artificiell Intelligens (AI) och WEB3-teknik, med målet att hålla mig à jour med den tekniska utvecklingen och erbjuda innovativa lösningar. Min karriärväg återspeglar en passion för ständig förbättring och en önskan att aktivt bidra till den moderna digitala världen.',
  },
  { ελληνικά: 'Πίνακας', αγγλικά: 'Dashboard', σουηδικά: 'Instrumentbräda' },
  { ελληνικά: 'Πιστοποιητικό', αγγλικά: 'Certificate', σουηδικά: 'Intyg' },
  {
    ελληνικά: 'Πλήρες Όνομα',
    αγγλικά: 'Full Name',
    σουηδικά: 'Fullständigt Namn',
  },
  {
    ελληνικά: 'Πλήρες  Όνομα', // με διπλό κενό λόγω τόνου στο Ο που το κάνει να φαίνεται κολλητά σε μερικές γραμματοσειρές
    αγγλικά: 'Full Name',
    σουηδικά: 'Fullständigt Namn',
  },
  {
    ελληνικά: 'Πλήρες Ονοματεπώνυμο',
    αγγλικά: 'Full Name',
    σουηδικά: 'Fullständigt Namn',
  },
  { ελληνικά: 'Πλήρης Απασχόληση', αγγλικά: 'Full-Time', σουηδικά: 'Heltid' },
  {
    ελληνικά: 'Πλήρης Οδηγός React 2024 & 2025',
    αγγλικά: 'Complete React 2024 & 2025 Guide',
    σουηδικά: 'React 2024 & 2025 Komplett Guide',
  },
  {
    ελληνικά: 'Πλήρους-Εύρους Ανάπτυξη Ιστού 2024',
    αγγλικά: 'Full-Stack Web Development 2024',
    σουηδικά: 'Full-Stack Webbutveckling 2024',
  },
  {
    ελληνικά: 'Πλήρους-Εύρους Javascript',
    αγγλικά: 'Full-Stack Javascript',
    σουηδικά: 'Full-Stack Javascript',
  },
  { ελληνικά: 'Πρακτική', αγγλικά: 'Internship', σουηδικά: 'Praktik' },
  {
    ελληνικά: 'Προγραμματιστής Εφαρμογών',
    αγγλικά: 'Application Developer',
    σουηδικά: 'Applikationsutvecklare',
  },
  {
    ελληνικά: 'Προγραμματιστής Ιστού',
    αγγλικά: 'Web Developer',
    σουηδικά: 'Webbutvecklare',
  },
  {
    ελληνικά: 'Προγραμματιστής Μπροστά Μέρους',
    αγγλικά: 'Frontend Developer',
    σουηδικά: 'Frontend Utvecklare',
  },
  {
    ελληνικά: 'Προγραμματιστής Πίσω Μέρους',
    αγγλικά: 'Backend Developer',
    σουηδικά: 'Backend Utvecklare',
  },
  {
    ελληνικά: 'Προγραμματιστής Πλήρους-Εύρους',
    αγγλικά: 'Full-Stack Developer',
    σουηδικά: 'Full-Stack Utvecklare',
  },
  {
    ελληνικά: 'Πρόγραμμα Εκκίνησης',
    αγγλικά: 'Bootcamp',
    σουηδικά: 'Bootcamp',
  },
  { ελληνικά: 'Προηγούμενη', αγγλικά: 'Previous ', σουηδικά: 'Tidigare' },
  {
    ελληνικά:
      'Προς το παρόν εστιάζω κυρίως στην ανάπτυξη διαδικτυακών εφαρμογών, έχοντας αποκτήσει αρκετές γνώσεις και εμπειρία στη δημιουργία σύγχρονων ιστοτόπων και εφαρμογών ιστού.',
    αγγλικά:
      'Currently, I focus mainly on web application development, having gained considerable knowledge and experience in creating modern websites and web applications.',
    σουηδικά:
      'För närvarande fokuserar jag främst på webbapplikationsutveckling, efter att ha skaffat mig betydande kunskap och erfarenhet av att skapa moderna webbplatser och webbapplikationer.',
  },
  {
    ελληνικά: 'Προς Υλοποίηση',
    αγγλικά: 'To Be Implemented',
    σουηδικά: 'För Implementering',
  },
  {
    ελληνικά: 'Προς το παρόν δεν υπάρχουν συχνές ερωτήσεις.',
    αγγλικά: 'There are no frequently asked questions at the moment',
    σουηδικά: 'Det finns för närvarande inga vanliga frågor.',
  },
  {
    ελληνικά: 'Προσθήκη επιλογών φίλτρου',
    αγγλικά: 'Add filter options',
    σουηδικά: 'Lägg till filteralternativ',
  },
  {
    ελληνικά: 'Προσθήκη Πλήκτρου για «Έργα Μαθήματος» σε γεγονός',
    αγγλικά: 'Add a Button for "Course Projects" to an event',
    σουηδικά: 'Lägga till en "Kursprojekt"-knapp till ett evenemang',
  },
  {
    ελληνικά: 'Προσθήκη Λίστας με «Έργα Μαθήματος» σε γεγονός',
    αγγλικά: 'Add a List of "Course Projects" to an event',
    σουηδικά: 'Lägga till en lista över "Kursprojekt" till ett evenemang',
  },
  {
    ελληνικά: 'Προσθήκη χρόνου διάρκειας γεγονότος',
    αγγλικά: 'Add event duration time',
    σουηδικά: 'Lägg till händelsens varaktighetstid',
  },
  {
    ελληνικά: 'Προσθήκη Εργασίας',
    αγγλικά: 'Add Job',
    σουηδικά: 'Lägg Τill Jobb',
  },
  { ελληνικά: 'Πρόσληψη', αγγλικά: 'Hire Me', σουηδικά: 'Αnställ Mig' },
  {
    ελληνικά:
      'Πρόσφατα, ανέπτυξα τον παρόντα ιστότοπο, για προσωπική χρήση, χρησιμοποιώντας το NextJS, ένα ισχυρό πλαίσιο (framework) React που μου επέτρεψε να παρουσιάσω τις δεξιότητές μου και τα έργα μου με επαγγελματικό τρόπο.',
    αγγλικά:
      'Recently, I developed this website, for personal use, using NextJS, a powerful React framework that allowed me to showcase my skills and projects in a professional manner.',
    σουηδικά:
      'Nyligen utvecklade jag den här webbplatsen, för personligt bruk, med hjälp av NextJS, ett kraftfullt React-ramverk som gjorde det möjligt för mig att visa upp mina färdigheter och projekt på ett professionellt sätt.',
  },
  {
    ελληνικά: 'Προσωπικός Ιστότοπος',
    αγγλικά: 'Personal Website',
    σουηδικά: 'Personlig Webbplats',
  },
  // Ρ //
  { ελληνικά: 'Ραβδόγραμμα', αγγλικά: 'Bar Chart', σουηδικά: 'Stapeldiagram' },
  { ελληνικά: 'Ρυθμίσεις', αγγλικά: 'Settings', σουηδικά: 'Inställningar' },
  // Σ //
  { ελληνικά: 'Σειρά Μαθημάτων', αγγλικά: 'Course', σουηδικά: 'Kurs' },
  { ελληνικά: 'Σελίδα', αγγλικά: 'Page', σουηδικά: 'Sida' },
  { ελληνικά: 'Σελίδα Χρήστη', αγγλικά: 'Profile', σουηδικά: 'Profil' },
  { ελληνικά: 'Σελίδα «Αρχική»', αγγλικά: 'Page "Home"', σουηδικά: 'Hemsida' },
  {
    ελληνικά: 'Σελίδα «Επικοινωνία»',
    αγγλικά: 'Page "Contact"',
    σουηδικά: 'Sidan "Kontakt"',
  },
  {
    ελληνικά: 'Σελίδα «Προς Υλοποίηση»',
    αγγλικά: 'Page "To Be Implemented"',
    σουηδικά: 'Sidan "För Implementering"',
  },
  {
    ελληνικά: 'Σελίδα «Χρονολόγιο»',
    αγγλικά: 'Page "Timeline"',
    σουηδικά: 'Sidan "Tidslinje"',
  },
  { ελληνικά: 'Σε εξέλιξη', αγγλικά: 'In progress', σουηδικά: 'Pågår' },
  { ελληνικά: 'Σπουδές', αγγλικά: 'Studies', σουηδικά: 'Studier' },
  {
    ελληνικά: 'Σπουδές Προγραμματισμού',
    αγγλικά: 'Programming Studies',
    σουηδικά: 'Programmeringsstudier',
  },
  { ελληνικά: 'Στατικό', αγγλικά: 'Static', σουηδικά: 'Statisk' },
  {
    ελληνικά:
      'Στις δεύτερες Πανελλήνιες Εξετάσεις κατάφερα να περάσω στο Πολυτεχνείο του Πανεπιστημίου Κρήτης όπου όμως επίσης επέλεξα να μην πάω.',
    αγγλικά:
      'In the second Panhellenic Exams, I managed to pass the Technical University of Crete, but I also chose not to go.',
    σουηδικά:
      'I det andra Panhelleniska provet lyckades jag gå vidare till yrkeshögskolan vid universitetet på Kreta, men jag valde också att inte gå.',
  },
  {
    ελληνικά: 'στις Μαρτυρίες',
    αγγλικά: 'in Testimonials',
    σουηδικά: 'i Vittnesmål',
  },
  {
    ελληνικά: 'στο Χρονολόγιο',
    αγγλικά: 'in Timeline',
    σουηδικά: 'på Tidslinjen',
  },
  { ελληνικά: 'Συμβουλευτική', αγγλικά: 'Consulting', σουηδικά: 'Konsultera' },
  {
    ελληνικά:
      'Συμμετοχή σε τρίμηνο εντατικό πρόγραμμα εκκίνησης για εκπαίδευση επάνω σε τεχνολογίες ανάπτυξης ιστού για πλήρους-εύρους JavaScript.',
    αγγλικά:
      'Participation in a three-month intensive bootcamp for training on web development technologies for full-stack JavaScript.',
    σουηδικά:
      'Deltagande i en tre månader lång intensiv bootcamp för utbildning i webbutvecklingsteknologier för fullstack JavaScript.',
  },
  {
    ελληνικά: 'Συμπλήρωσε όλα τα πεδία!',
    αγγλικά: 'Fill in all fields!',
    σουηδικά: 'Fyll i alla fält!',
  },
  {
    ελληνικά: 'Συμπλήρωση γεγονότων Χρονολογίου',
    αγγλικά: 'Completing Timeline events',
    σουηδικά: 'Fylla i tidslinjehändelser',
  },
  { ελληνικά: 'Συνέντευξη', αγγλικά: 'Interview', σουηδικά: 'Intervju' },
  { ελληνικά: 'Συνδέσου.', αγγλικά: 'Login.', σουηδικά: 'Logga In' },
  { ελληνικά: 'Συνεργασία', αγγλικά: 'Cooperation', σουηδικά: 'Samarbete' },
  { ελληνικά: 'Σύνδεση', αγγλικά: 'Login', σουηδικά: 'Logga In' },
  { ελληνικά: 'Συχνές Ερωτήσεις', αγγλικά: 'FAQ', σουηδικά: 'Vanliga Frågor' },
  { ελληνικά: 'Σχετικά', αγγλικά: 'About', σουηδικά: 'Om' },
  { ελληνικά: 'Σχετικά με εμένα', αγγλικά: 'About me', σουηδικά: 'Om mig' },
  {
    ελληνικά: 'Σχετικά με τον ιστότοπο',
    αγγλικά: 'About this website',
    σουηδικά: 'Om denna webbplats',
  },
  {
    ελληνικά: 'Σχεδιαστής ΔΧ / ΕΧ',
    αγγλικά: 'UI / UX Designer',
    σουηδικά: 'UI / UX Designer',
  },
  // Τ //
  {
    ελληνικά: 'Τα Στοιχεία Χρήστη Ενημερώθηκαν!',
    αγγλικά: 'User Details Updated!',
    σουηδικά: 'Användarinformation uppdaterad!',
  },
  {
    ελληνικά: 'Τεχνολογίες που χρησιμοποιώ',
    αγγλικά: 'Technologies I Use',
    σουηδικά: 'Teknologier jag använder',
  },
  {
    ελληνικά: 'ΤΝ για Προγραμματιστές',
    αγγλικά: 'AI for Developers',
    σουηδικά: 'AI för Utvecklare',
  },
  {
    ελληνικά:
      'ΤΝ για Προγραμματιστές με τα GitHub Copilot, Cursor AI & ChatGPT',
    αγγλικά: 'AI for Developers with GitHub Copilot, Cursor AI & ChatGPT',
    σουηδικά: 'AI för Utvecklare med GitHub Copilot, Cursor AI & ChatGPT',
  },
  {
    ελληνικά: 'Το γνωστό σε όλους μας παίγνιο μνήμης.',
    αγγλικά: 'The memory game we all know.',
    σουηδικά: 'Minnesspelet känner vi alla till.',
  },
  {
    ελληνικά: 'Το γνωστό σε όλους μας παίγνιο στρατηγικής.',
    αγγλικά: 'The strategy game we all know.',
    σουηδικά: 'Strategispelet vi alla känner till.',
  },
  {
    ελληνικά: 'Το μήνυμα εστάλη',
    αγγλικά: 'Message has been sent',
    σουηδικά: 'Meddelandet har skickats',
  },
  {
    ελληνικά: 'Το Παίγνιο Του Σάιμον',
    αγγλικά: "Simon's Game",
    σουηδικά: 'Simons Spel',
  },
  { ελληνικά: 'Τοποθεσία', αγγλικά: 'Location', σουηδικά: 'Spårande' },
  { ελληνικά: 'Τρίλιζα', αγγλικά: 'Tic Tac Toe', σουηδικά: 'Luffarschack' },
  {
    ελληνικά: 'Τύμπανα & Κρουστά',
    αγγλικά: 'Drums & Percussion',
    σουηδικά: 'Trummor & Slagverk',
  },
  { ελληνικά: 'Τύπος Εργασίας', αγγλικά: 'Job Type', σουηδικά: 'Arbetstyp' },
  // Υ //
  {
    ελληνικά: 'Υαλομορφισμός:',
    αγγλικά: 'Glassmorphism:',
    σουηδικά: 'Glasmorfism:',
  },
  { ελληνικά: 'Υβριδικά', αγγλικά: 'Hybrid', σουηδικά: 'Hybrid' },
  { ελληνικά: 'Υβριδική', αγγλικά: 'Hybrid', σουηδικά: 'Hybrid' },
  { ελληνικά: 'Υπηρεσίες', αγγλικά: 'Services', σουηδικά: 'Tjänster' },
  {
    ελληνικά: 'Υπήρξε κάποιο πρόβλημα. Δοκιμάστε ξανά σε λίγο.',
    αγγλικά: 'There was a problem. Please try again shortly.',
    σουηδικά: 'Det var ett problem. Försök snart igen.',
  },
  {
    ελληνικά: 'Υπό Ανάπτυξη',
    αγγλικά: 'Under Development',
    σουηδικά: 'Under Utveckling',
  },
  {
    ελληνικά:
      'Υπολόγισε την απόδοση της επένδυσής σου με αυτό το διαδικτυακό εργαλείο.',
    αγγλικά: 'Calculate your return on investment with this online tool.',
    σουηδικά:
      'Beräkna din avkastning på investeringen med detta onlineverktyg.',
  },
  {
    ελληνικά: 'Υπολογιστής Επένδυσης',
    αγγλικά: 'Investment Calculator',
    σουηδικά: 'Investerings Kalkylator',
  },
  // Φ //
  {
    ελληνικά: 'Φάση',
    αγγλικά: 'Phase',
    σουηδικά: 'Fas',
  },
  {
    ελληνικά: 'Φέγγος ορίων:',
    αγγλικά: 'Border glow:',
    σουηδικά: 'Gränsen glöd:',
  },
  {
    ελληνικά: 'Φέγγος στοιχείων:',
    αγγλικά: 'Element glow:',
    σουηδικά: 'Element glöd:',
  },
  {
    ελληνικά: 'Φίλτρα Αναζήτησης',
    αγγλικά: 'Search Filters',
    σουηδικά: 'Sökfilter',
  },
  {
    ελληνικά:
      'Φαίνεται ότι δεν μπορούμε να ξετρυπώσουμε την σελίδα που ψάχνεις.',
    αγγλικά:
      'It looks like we are not able to find the page you are looking for.',
    σουηδικά: 'Det verkar som att vi inte kan hitta sidan du letar efter.',
  },
  { ελληνικά: 'Φόρτωση', αγγλικά: 'Loading', σουηδικά: 'Laddning' },
  { ελληνικά: 'Φόρτωση...', αγγλικά: 'Loading...', σουηδικά: 'Laddning...' },
  // Χ //
  { ελληνικά: 'Χαρτοφυλάκιο', αγγλικά: 'Portfolio', σουηδικά: 'Portfölj' },
  { ελληνικά: 'Χρήστης', αγγλικά: 'User', σουηδικά: 'Användare' },
  { ελληνικά: 'Χρονική Γραμμή', αγγλικά: 'Timeline', σουηδικά: 'Tidslinje' },
  { ελληνικά: 'Χρονολόγιο', αγγλικά: 'Timeline', σουηδικά: 'Tidslinje' },
  // Ψ //
  // Ω //
  { ελληνικά: 'Ω -> Α', αγγλικά: 'Z -> A', σουηδικά: 'Ö -> A' },
  {
    ελληνικά: 'ΩΠ! ΚΑΤΙ ΠΗΓΕ ΛΑΘΟΣ.',
    αγγλικά: 'OOPS! SOMETHING WENT WRONG.',
    σουηδικά: 'HOPPSAN! NÅGOT GICK FEL.',
  },
  { ελληνικά: 'ηΤαχυδρομείο', αγγλικά: 'eMail', σουηδικά: 'ePost' },
  {
    ελληνικά: 'παράδειγμα@ταχυδρομείο.gr',
    αγγλικά: 'example@email.com',
    σουηδικά: 'exempel@e-post.com',
  },
  {
    ελληνικά: '5ήμερη Πρόκληση Προγραμματισμού',
    αγγλικά: '5-Day Programming Challenge',
    σουηδικά: '5-Dagars Programmeringsutmaning',
  },
  { ελληνικά: 'CSS', αγγλικά: 'CSS', σουηδικά: 'CSS' },
  { ελληνικά: 'CSS 2024', αγγλικά: 'CSS 2024', σουηδικά: 'CSS 2024' },
  {
    ελληνικά: 'Github Copilot & Εργαλεία ΤΝ για Γενική Ανάπτυξη',
    αγγλικά: 'Github Copilot & AI Tools for General Development',
    σουηδικά: 'Github Copilot & AI-Verktyg för Allmän Utveckling',
  },
  { ελληνικά: 'HTML', αγγλικά: 'HTML', σουηδικά: 'HTML' },
  { ελληνικά: 'JavaScript', αγγλικά: 'JavaScript', σουηδικά: 'JavaScript' },
  { ελληνικά: 'MERN 2023', αγγλικά: 'MERN 2023', σουηδικά: 'MERN 2023' },
  {
    ελληνικά: 'React Native 2023',
    αγγλικά: 'React Native 2023',
    σουηδικά: 'React Native 2023',
  },
];
