export const μαρτυρίες = [
  {
    id: 1,
    όνομα: 'Αλέξανδρος',
    βαθμολογία: 5,
    κείμενο:
      'Δεν μπορώ να περιγράψω το επίπεδο αριστείας και επαγγελματισμού του Δημήτρη. Με κατέκτησε!',
    διεύθυνσηΕικόνας: '/images/Μέγας Αλέξανδρος.jpg',
    κείμενοΕικόνας: 'Εικόνα Άνδρα',
    αυθεντικότητα: 'Ψεύτικη'
  },
  {
    id: 2,
    όνομα: 'Υπατία',
    βαθμολογία: 5,
    κείμενο:
      'Εκπληκτικός γνώστης του αντικειμένου του σε όλα τα επίπεδα. Πολυεπιστήμων!',
    διεύθυνσηΕικόνας: '/images/Υπατία.jpg',
    κείμενοΕικόνας: 'Εικόνα Γυναίκας',
    αυθεντικότητα: 'Ψεύτικη'
  },
  {
    id: 3,
    όνομα: 'Ηρακλής',
    βαθμολογία: 5,
    κείμενο:
      'Ο Δημήτρης "σήκωσε" όλο το βάρος της ανάπτυξης με τεράστια αντοχή και υπομονή. Διετέλεσε άθλο σωστό.',
    διεύθυνσηΕικόνας: '/images/Ηρακλής.jpg',
    κείμενοΕικόνας: 'Εικόνα Άνδρα',
    αυθεντικότητα: 'Ψεύτικη'
  },
  {
    id: 4,
    όνομα: 'Αθηνά',
    βαθμολογία: 5,
    κείμενο: 'Ένας μικρός θεός! Ήταν τόσο καλός που σκέφτομαι να ιδρύσω μια πόλη και να του την χαρίσω.',
    διεύθυνσηΕικόνας: '/images/Αθηνά.jpg',
    κείμενοΕικόνας: 'Εικόνα Γυναίκας',
    αυθεντικότητα: 'Ψεύτικη'
  },
  {
    id: 5,
    όνομα: 'Αριάδνη',
    βαθμολογία: 5,
    κείμενο: 'Ο Δημήτρης ξετύλιξε τον μίτο του εγχειρήματος και κατάφερε να με βγάλει από τον λαβύρινθο των επιλογών μου.',
    διεύθυνσηΕικόνας: '/images/Αριάδνη.jpg',
    κείμενοΕικόνας: 'Εικόνα Γυναίκας',
    αυθεντικότητα: 'Ψεύτικη'
  },
  // {
  //   id: 6,
  //   όνομα: 'Αθηνά',
  //   βαθμολογία: 5,
  //   κείμενο: 'Ένας μικρός θεός! Ήταν τόσο καλός που σκέφτομαι να ιδρύσω μια πόλη και να του την χαρίσω.',
  //   διεύθυνσηΕικόνας: '/images/Αθηνά.jpg',
  //   κείμενοΕικόνας: 'Εικόνα Γυναίκας',
  //   αυθεντικότητα: 'Ψεύτικη'
  // },
  // {
  //   id: 7,
  //   όνομα: 'Αθηνά',
  //   βαθμολογία: 5,
  //   κείμενο: 'Ένας μικρός θεός! Ήταν τόσο καλός που σκέφτομαι να ιδρύσω μια πόλη και να του την χαρίσω.',
  //   διεύθυνσηΕικόνας: '/images/Αθηνά.jpg',
  //   κείμενοΕικόνας: 'Εικόνα Γυναίκας',
  //   αυθεντικότητα: 'Ψεύτικη'
  // },
  // {
  //   id: 8,
  //   όνομα: 'Αθηνά',
  //   βαθμολογία: 5,
  //   κείμενο: 'Ένας μικρός θεός! Ήταν τόσο καλός που σκέφτομαι να ιδρύσω μια πόλη και να του την χαρίσω.',
  //   διεύθυνσηΕικόνας: '/images/Αθηνά.jpg',
  //   κείμενοΕικόνας: 'Εικόνα Γυναίκας',
  //   αυθεντικότητα: 'Ψεύτικη'
  // },
];
