export const μαρτυρίες = [
  {
    id: 1,
    όνομα: 'Αλέξανδρος',
    βαθμολογία: 5,
    κείμενο:
      'Δεν μπορώ να περιγράψω το επίπεδο αριστείας και επαγγελματισμού του Δημήτρη. Με κατέκτησε!',
    διεύθυνσηΕικόνας: '/images/Μέγας Αλέξανδρος.jpg',
    κείμενοΕικόνας: 'Εικόνα Άνδρα',
  },
  {
    id: 2,
    όνομα: 'Υπατία',
    βαθμολογία: 5,
    κείμενο:
      'Εκπληκτικός γνώστης του αντικειμένου του σε όλα τα επίπεδα. Πολυεπιστήμων!',
    διεύθυνσηΕικόνας: '/images/Υπατία.jpg',
    κείμενοΕικόνας: 'Εικόνα Γυναίκας',
  },
  {
    id: 3,
    όνομα: 'Ηρακλής',
    βαθμολογία: 5,
    κείμενο:
      'Ο Δημήτρης "σήκωσε" όλο το βάρος της ανάπτυξης με τεράστια αντοχή και υπομονή. Διετέλεσε άθλο σωστό.',
    διεύθυνσηΕικόνας: '/images/Ηρακλής.jpg',
    κείμενοΕικόνας: 'Εικόνα Άνδρα',
  },
  {
    id: 4,
    όνομα: 'Αθηνά',
    βαθμολογία: 5,
    κείμενο: 'Ήταν τόσο καλός που σκέφτομαι να ιδρύσω μια πόλη και να του την χαρίσω.',
    διεύθυνσηΕικόνας: '/images/Αθηνά.jpg',
    κείμενοΕικόνας: 'Εικόνα Γυναίκας',
  },
];
