export const συχνέςΕρωτήσεις = [
  // {
  //   id: 1,
  //   ερώτηση: 'Τι σου έδωσε κίνητρο να δημιουργήσεις αυτό τον ιστότοπο;',
  //   απάντηση:
  //     'Η επιθυμία να μοιραστώ τις γνώσεις μου και να βοηθήσω άλλους να υλοποιήσουν τις ιδέες τους και τα όνειρά τους.',
  // },
  // {
  //   id: 2,
  //   ερώτηση: 'Από που έλαβες έμπνευση για την ανάπτυξη αυτού του ιστοτόπου;',
  //   απάντηση:
  //     'Η βασική πηγή έμπνευσής μου είναι πάντα η φύση και ο Ελληνικός Πολιτισμός. Δεδομένου όμως ότι η ενασχόληση μου αυτή δεν έχει να κάνει και πολύ με την φύση αλλά κυρίως με την τεχνολογία θέλησα να παρουσιάσω μία μίξη στοιχείων τεχνολογίας επηρεασμένα από την Ελλάδα. Οπότε ο ιστότοπος κατέληξε να παραπέμπει σε ένα προϊόν τεχνολογίας, του οποίου όμως διάφορα στοιχεία του έχουν άμεση σχέση με την Ελλάδα. Άλλα είναι φανερά και άλλα πιο "κρυφά". Μπορείς να τα βρεις όλα; Προς το παρόν είναι 7 στο σύνολο. ',
  // },
];
