import { έννοιες } from '../db/έννοιεςΜετάφρασης.js';

const μετάφραση = (κείμενο, γλώσσα) => {
  if (!κείμενο) {
    console.log(`❗️ Δεν δόθηκε κείμενο (${κείμενο}) προς μετάφραση. ❗️`);
    const κενόΚείμενο = '';
    return κενόΚείμενο;
  }

  if (!γλώσσα) {
    console.warn(
      `❗️ Δεν δόθηκε γλώσσα για το κείμενο (${κείμενο}) προς μετάφραση. ❗️`
    );
    return κείμενο;
  }

  const κείμενοΣεΜικρούςΧαρακτήρες = κείμενο.toLowerCase();

  const δείκτηςΑντικειμένου = έννοιες.findIndex(
    (έννοια) =>
      έννοια.ελληνικά.toLowerCase() === κείμενοΣεΜικρούςΧαρακτήρες ||
      έννοια.αγγλικά.toLowerCase() === κείμενοΣεΜικρούςΧαρακτήρες ||
      έννοια.σουηδικά.toLowerCase() === κείμενοΣεΜικρούςΧαρακτήρες
  );

  if (
    δείκτηςΑντικειμένου === null ||
    δείκτηςΑντικειμένου === undefined ||
    δείκτηςΑντικειμένου === '' ||
    δείκτηςΑντικειμένου === 0 ||
    δείκτηςΑντικειμένου === -1
  ) {
    // console.log(`❗️ Κρατήθηκε το κείμενο «${κείμενο}» λόγω έλλειψης μετάφρασης. ❗️ -- Δείκτης Αντικειμένου: ${δείκτηςΑντικειμένου}`);
    return κείμενο;
  }

  const έννοιαΣεΓλώσσα =
    γλώσσα.toLowerCase() === 'english'
      ? έννοιες[δείκτηςΑντικειμένου].αγγλικά
        ? έννοιες[δείκτηςΑντικειμένου].αγγλικά
        : console.log(
            `❗️ Δεν βρέθηκε η μετάφραση του «${κείμενο}» στα ${γλώσσα}.`
          )
      : γλώσσα.toLowerCase() === 'svenska'
        ? έννοιες[δείκτηςΑντικειμένου].σουηδικά
          ? έννοιες[δείκτηςΑντικειμένου].σουηδικά
          : console.log(
              `❗️ Δεν βρέθηκε η μετάφραση του «${κείμενο}» στα ${γλώσσα}.`
            )
        : έννοιες[δείκτηςΑντικειμένου].ελληνικά
          ? έννοιες[δείκτηςΑντικειμένου].ελληνικά
          : console.log(
              `❗️ Δεν βρέθηκε η μετάφραση του «${κείμενο}» στα ${γλώσσα}.`
            );

  return έννοιαΣεΓλώσσα;
};

export { μετάφραση };
