import { έννοιες } from '../db/έννοιεςΜετάφρασης.js';

const μετάφραση = (κείμενο, γλώσσα) => {
  const κείμενοΣεΜικρούςΧαρακτήρες = κείμενο.toLowerCase();

  const δείκτηςΑντικειμένου = έννοιες.findIndex(
    (έννοια) =>
      έννοια.ελληνικά.toLowerCase() === κείμενοΣεΜικρούςΧαρακτήρες ||
      έννοια.αγγλικά.toLowerCase() === κείμενοΣεΜικρούςΧαρακτήρες ||
      έννοια.σουηδικά.toLowerCase() === κείμενοΣεΜικρούςΧαρακτήρες
  );

  const έννοιαΣεΓλώσσα =
    γλώσσα.toLowerCase() === 'english'
      ? έννοιες[δείκτηςΑντικειμένου].αγγλικά
      : γλώσσα.toLowerCase() === 'svenska'
      ? έννοιες[δείκτηςΑντικειμένου].σουηδικά
      : έννοιες[δείκτηςΑντικειμένου].ελληνικά;

  return έννοιαΣεΓλώσσα;
};

export { μετάφραση };
