'use client';

import Μαρτυρία from '@/components/Μαρτυρίες/Μαρτυρία';

import { μαρτυρίες } from '@/db/μαρτυρίες';

const TestimonialsFilters = () => {
  const αυθεντικέςΜαρτυρίες = μαρτυρίες.filter(
    (μαρτυρία) => μαρτυρία.αυθεντικότητα === 'Αληθινή'
  );
  const μηΑυθεντικέςΜαρτυρίες = μαρτυρίες.filter(
    (μαρτυρία) => μαρτυρία.αυθεντικότητα === 'Ψεύτικη'
  );

  const αριθμόςΑυθεντικώνΜαρτυριών = αυθεντικέςΜαρτυρίες.length;

  const μαρτυρίεςΠροςΕμφάνιση =
    αριθμόςΑυθεντικώνΜαρτυριών >= 4
      ? αυθεντικέςΜαρτυρίες
      : αυθεντικέςΜαρτυρίες.concat(μηΑυθεντικέςΜαρτυρίες);

  return (
    <>
      {μαρτυρίεςΠροςΕμφάνιση.map((μαρτυρία) => (
        <Μαρτυρία
          key={μαρτυρία.id}
          id={μαρτυρία.id}
          όνομα={μαρτυρία.όνομα}
          βαθμολογία={μαρτυρία.βαθμολογία}
          κείμενο={μαρτυρία.κείμενο}
          διεύθυνσηΕικόνας={μαρτυρία.διεύθυνσηΕικόνας}
          κείμενοΕικόνας={μαρτυρία.κείμενοΕικόνας}
          αυθεντικότητα={μαρτυρία.αυθεντικότητα}
        />
      ))}
    </>
  );
};

export default TestimonialsFilters;
