'use client';

import styles from './ΚοινόΠληκτρο.module.css';

import Link from 'next/link';

import { useAppContext } from '@/context/AppContext';
import { usePathname } from 'next/navigation';
import { μετάφραση } from '@/utils/μετάφραση';

const BasicButton = ({
  id,
  είδος, // Τιμές: "αποστολή" / "σύνδεσμος" / "απλό"
  type,
  style, // Τιμές: "βασικό-πλήκτρο" / "δευτερεύον-πλήκτρο" / "πλήκτρο-επιτυχίας"
  value,
  κίνησηΑιώρησης, // Τιμές: "επάνω" / "κάτω" / "δεξιά" / "αριστερά" / "επιτόπια"
  σύνδεσμος,
  onSubmit,
  children,
}) => {
  const { language, μορφήΣτοιχείων, φέγγοςΟρίων, φέγγοςΣτοιχείων } =
    useAppContext();

  const path = usePathname();

  // const διεύθυνση =
  //   σύνδεσμος === '/programming/about/me' ||
  //   σύνδεσμος === '/programming/about/site'
  //     ? '/programming/about'
  //     : σύνδεσμος;

  return είδος === 'αποστολή' ? (
    <button
      id={id}
      type={type}
      className={
        styles[`${style}`] +
        ' ' +
        styles[
          `${μορφήΣτοιχείων === 'υαλομορφισμός' ? 'με-υαλομορφισμό' : μορφήΣτοιχείων === 'ημιδιαφανή στοιχεία' ? 'με-ημιδιαφανή-στοιχεία' : μορφήΣτοιχείων === 'αδιαφανή στοιχεία' ? 'με-αδιαφανή-στοιχεία' : ''}`
        ] +
        ' ' +
        styles[`${φέγγοςΟρίων === true ? 'με-φέγγος-ορίων' : ''}`] +
        ' ' +
        styles[`${φέγγοςΣτοιχείων === true ? 'με-φέγγος-στοιχείων' : ''}`] +
        ' ' +
        styles[
          κίνησηΑιώρησης !== 'επιτόπια'
            ? `αιώρηση-προς-${κίνησηΑιώρησης}`
            : 'αιώρηση-επιτόπια'
        ]
      }
      onSubmit={(e) => onSubmit(e)}
    >
      {μετάφραση(`${value}`, language)}
    </button>
  ) : (
    <Link
      href={σύνδεσμος}
      className={
        styles[`${style}`] +
        ' ' +
        styles[
          `${μορφήΣτοιχείων === 'υαλομορφισμός' ? 'με-υαλομορφισμό' : μορφήΣτοιχείων === 'ημιδιαφανή στοιχεία' ? 'με-ημιδιαφανή-στοιχεία' : μορφήΣτοιχείων === 'αδιαφανή στοιχεία' ? 'με-αδιαφανή-στοιχεία' : ''}`
        ] +
        ' ' +
        styles[`${φέγγοςΟρίων === true ? 'με-φέγγος-ορίων' : ''}`] +
        ' ' +
        styles[`${φέγγοςΣτοιχείων === true ? 'με-φέγγος-στοιχείων' : ''}`] +
        ' ' +
        styles[
          κίνησηΑιώρησης !== 'επιτόπια'
            ? `αιώρηση-προς-${κίνησηΑιώρησης}`
            : 'αιώρηση-επιτόπια'
        ] +
        ' ' +
        styles[path.endsWith(σύνδεσμος) ? 'active' : '']
      }
    >
      {children}
    </Link>
  );
};

export default BasicButton;
