// 'use client';

import styles from './page.module.css';

import Ηρώο from '@/components/Ηρώο';
import ΠλαίσιοΜορφής from '@/components/ΠλαίσιοΜορφής';
import ΚείμενοΤίτλοςΜικρήςΟθόνης from '@/components/Κείμενα/ΚείμενοΤίτλοςΜικρήςΟθόνης';
import ΠλήκτροΚειμένουΜικρήςΟθόνης from '@/components/Πλήκτρα/ΠλήκτρΚειμένουΜικρήςΟθόνης';

// import { useAppContext } from '@/context/AppContext'; //<-------------- Στο τέλος να ελέγξω αν χρειάζεται

const Αρχική = () => {
  // const { language, υπόβαθροΠρογραμματισμού } = useAppContext();

  return (
    <main>
      <section
        className={
          styles.αρχική
          //   styles[
          //     `${υπόβαθροΠρογραμματισμού === 'δυναμικό' ? 'αρχική' : 'αρχική'}`
          //   ]
        }
        id="αρχική"
      >
        <Ηρώο />
      </section>
      <ΠλαίσιοΜορφής
        καθορισμόςΔιαστάσεων="από μέσα"
        ακτίναΓωνίας={15}
        πάχοςΟρίου={1}
        ενεργόςΔιακόπτηςΦέγγουςΟρίων
        ενεργόςΔιακόπτηςΦέγγουςΣτοιχείων
      >
        <ΚείμενοΤίτλοςΜικρήςΟθόνης pxΓιαΑπόκρυψη={1024}/>
      </ΠλαίσιοΜορφής>
      <ΠλήκτροΚειμένουΜικρήςΟθόνης pxΓιαΑπόκρυψη={1024} />
    </main>
  );
};

export default Αρχική;
